const texts = [
	[
		{
			text: 'Слушай, Израиль: Господь, Бог наш, Господь един есть',
			book: 'Втор',
			chapter: '6',
			verse: '4',
			id: '1',
			reason: ['Существует лишь один Бог'],
		},
		{
			text: 'Знаю человека во Христе, который… восхищен был до третьего неба',
			book: '2Кор',
			chapter: '12',
			verse: '2',
			id: '2',
			reason: ['Бог обитает на третьем небе'],
		},
		{
			text: 'Господь на небесах поставил престол Свой',
			book: 'Псал',
			chapter: '102',
			verse: '19',
			id: '3',
			reason: ['Престол Божий находится на небе'],
		},
		{
			text: 'Не наполняю ли Я небо и землю',
			book: 'Иер',
			chapter: '23',
			verse: '24',
			id: '4',
			reason: ['Бог Отец Вездесущий и Всенаполняющий в лице Его Духа'],
		},
		{
			text: 'Сотворим человека по образу Нашему, по подобию Нашему',
			book: 'Быт',
			chapter: '1',
			verse: '26',
			id: '5',
			reason: ['Как Личность Бог Отец имеет Свой образ'],
		},
		{
			text: 'Разум Его неисследим',
			book: 'Ис',
			chapter: '40',
			verse: '28 ч/посл',
			id: '6',
			reason: ['Свойства Бога Отца: Высший Разум'],
		},
		{
			text: 'По множеству могущества и великой силе у Него ничто не выбывает',
			book: 'Ис',
			chapter: '40',
			verse: '26',
			id: '7',
			reason: ['Свойства Бога Отца: Вечная Сила'],
		},
		{
			text: 'Ибо у Тебя источник жизни; во свете Твоем мы видим свет',
			book: 'Псал',
			chapter: '35',
			verse: '10',
			id: '8',
			reason: ['Свойства Бога Отца: Жизненная Сила'],
		},
		{
			text: 'Ибо невидимое Его, вечная сила Его и Божество… видимы',
			book: 'Римл',
			chapter: '1',
			verse: '20',
			id: '9',
			reason: ['Свойства Бога Отца: Высшая Нравственность'],
		},
		{
			text: 'Единый имеющий бессмертие, который обитает в неприступном свете',
			book: '1Тим',
			chapter: '6',
			verse: '16',
			id: '10',
			reason: ['Бог Отец один имеет бессмертие'],
		},
		{
			text: 'Ибо, как Отец имеет жизнь в Самом Себе',
			book: 'Иоан',
			chapter: '5',
			verse: '26 ч/1',
			id: '11',
			reason: ['Бог Отец имеет жизнь в Самом Себе'],
		},
		{
			text: 'Я написал вам, отцы, потому что вы познали Безначального',
			book: '1Иоан',
			chapter: '2',
			verse: '14',
			id: '12',
			reason: ['Бог Отец не имеет начала бытия'],
		},
		{
			text: 'Он есть Бог живой и присносущий, и царство Его несокрушимо, и владычество Его бесконечно',
			book: 'Дан',
			chapter: '6',
			verse: '26',
			id: '13',
			reason: ['Бог Отец не имеет конца бытия'],
		},
		{
			text: 'Бога не видел никто никогда',
			book: 'Иоан',
			chapter: '1',
			verse: '18 ч/1',
			id: '14',
			reason: ['Бог Отец невидим для Своих творени'],
		},
		{
			text: 'Ангелы… всегда видят лицо Отца Моего Небесного',
			book: 'Матф',
			chapter: '18',
			verse: '10',
			id: '15',
			reason: ['При особых случаях Сын Божий и ангелы могут видеть лицо Отца'],
		},
		{
			text: 'Он сотворил землю силою Своею, утвердил вселенную мудростью Своею',
			book: 'Иер',
			chapter: '10',
			verse: '12',
			id: '16',
			reason: ['Бог Отец – Творец вселенной'],
		},
		{
			text: 'Ты знаешь, когда я сажусь и когда встаю; Ты разумеешь помышления мои издали',
			book: 'Псал',
			chapter: '138',
			verse: '2',
			id: '17',
			reason: ['Бог Отец – Всевидящий и Всезнающий'],
		},
		{
			text: 'Он… низлагает царей и поставляет царей',
			book: 'Дан',
			chapter: '2',
			verse: '21',
			id: '18',
			reason: ['Бог Отец управляет судьбами народов'],
		},
		{
			text: 'Из праха подъемлет Он бедного, из брения возвышает нищего',
			book: '1Цар',
			chapter: '2',
			verse: '8',
			id: '19',
			reason: ['Бог Отец управляет судьбами отдельных личностей'],
		},
		{
			text: 'И сошел Господь в облаке, и остановился там близ него, и провозгласил имя Иеговы',
			book: 'Исх',
			chapter: '34',
			verse: '5',
			id: '20',
			reason: ['Имя Бога Отца есть Его характер'],
		},
		{
			text: 'На закон Его будут уповать острова',
			book: 'Ис',
			chapter: '42',
			verse: '4',
			id: '21',
			reason: ['Имя Бога Отца – Закон. Первый текст'],
		},
		{
			text: 'На имя Его будут уповать народы',
			book: 'Матф',
			chapter: '12',
			verse: '21',
			id: '22',
			reason: ['Имя Бога Отца – Закон. Второй текст'],
		},
		{
			text: 'Итак будьте совершенны, как совершен Отец ваш Небесный',
			book: 'Матф',
			chapter: '5',
			verse: '48',
			id: '23',
			reason: ['Человеку возможно приобрести характер Отца'],
		},
		{
			text: 'Никто не приходит к Отцу, как только чрез Меня',
			book: 'Иоан',
			chapter: '14',
			verse: '6 ч/посл',
			id: '24',
			reason: ['Приобрести характер Отца можно только через Христа в вести своего времени'],
		},
		{
			text: 'Никто не может прийти ко Мне, если не привлечет его Отец',
			book: 'Иоан',
			chapter: '6',
			verse: '44',
			id: '25',
			reason: ['Прийти ко Христу в лице вести своего времени могут только те, кого привлекает характер Отца'],
		},
		{
			text: 'Сто сорок четыре тысячи, у которых имя Отца Его написано на челах',
			book: 'Откр',
			chapter: '14',
			verse: '1',
			id: '26',
			reason: ['Восстановление образа Божьего – имя Отца на чёлах искупленных'],
		},
		{
			text: 'И буду вам Отцом, и вы будете Моими сынами и дщерями',
			book: '2Кор',
			chapter: '6',
			verse: '18',
			id: '27',
			reason: ['Кто имеет и проявляет характер Отца – Его сын'],
		},
		{
			text: 'Ваш отец диавол',
			book: 'Иоан',
			chapter: '8',
			verse: '44',
			id: '28',
			reason: ['Кто имеет и проявляет характер противоположный Божьему – сын дьявола'],
		},
	],
	[
		{
			text: 'Кто не любит, тот не познал Бога, потому что Бог есть любовь.',
			book: '1Иоан',
			chapter: '4',
			verse: '8',
			id: '29',
			reason: ['Единый характер Бога Отца имеет две стороны: любовь'],
		},
		{
			text: 'Где Бог правосудия?',
			book: 'Мал',
			chapter: '2',
			verse: '17',
			id: '30',
			reason: ['Единый характер Бога Отца имеет две стороны: правосудие'],
		},
		{
			text: 'Правосудие и правота — основание престола Твоего; милость и истина предходят пред лицом Твоим',
			book: 'Псал',
			chapter: '88',
			verse: '15',
			id: '31',
			reason: ['Любовь и правосудие – основание престола и правления Бога Отца'],
		},
		{
			text: 'Милость и истина сретятся, правда и мир облобызаются',
			book: 'Псал',
			chapter: '84',
			verse: '11',
			id: '32',
			reason: ['Господь Бог на Голгофе доказал гармоничность двух сторон Своего характера'],
		},
		{
			text: 'Моя рука основала землю, и Моя десница распростерла небеса',
			book: 'Ис',
			chapter: '48',
			verse: '13',
			id: '33',
			reason: ['Проявления десницы Божьей: творческие'],
		},
		{
			text: 'Он держал в деснице Своей семь звезд',
			book: 'Откр',
			chapter: '1',
			verse: '16',
			id: '34',
			reason: ['Проявления десницы Божьей: управительные'],
		},
		{
			text: 'Удержит меня десница Твоя',
			book: 'Псал',
			chapter: '138',
			verse: '10',
			id: '35',
			reason: ['Проявления десницы Божьей: вразумляющие'],
		},
		{
			text: 'Десница Твоя, Господи, сразила врага',
			book: 'Исх',
			chapter: '15',
			verse: '6',
			id: '36',
			reason: ['Проявления десницы Божьей: воинствующие'],
		},
	],
	[
		{
			text: 'Единородный Сын, сущий в недре Отчем, Он явил',
			book: 'Иоан',
			chapter: '1',
			verse: '18 ч/посл',
			id: '37',
			reason: ['Сын Божий – единородный у Отца'],
		},
		{
			text: 'Ибо кому когда из Ангелов сказал Бог: Ты Сын Мой, Я ныне родил Тебя?',
			book: 'Евр',
			chapter: '1',
			verse: '5',
			id: '38',
			reason: ['Сын Божий рождён от Отца'],
		},
		{
			text: 'Который есть образ Бога невидимого, рожденный прежде всякой твари',
			book: 'Кол',
			chapter: '1',
			verse: '15',
			id: '39',
			reason: ['Четыре рождения Сына Божьего: предвечное'],
		},
		{
			text: 'О Сыне Своем, Который родился от семени Давидова по плоти',
			book: 'Римл',
			chapter: '1',
			verse: '3',
			id: '40',
			reason: ['Четыре рождения Сына Божьего: по плоти на земле'],
		},
		{
			text: 'Хотя Он и Сын, однако страданиями навык послушанию',
			book: 'Евр',
			chapter: '5',
			verse: '8',
			id: '41',
			reason: ['Четыре рождения Сына Божьего: духовное'],
		},
		{
			text: 'И Слово стало плотию, и обитало с нами, полное благодати и истины',
			book: 'Иоан',
			chapter: '1',
			verse: '14',
			id: '42',
			reason: ['Четыре рождения Сына Божьего: вестевое'],
		},
		{
			text: 'Я и Отец — одно',
			book: 'Иоан',
			chapter: '10',
			verse: '30',
			id: '43',
			reason: ['Сын Божий – высшая Божественная Личность, как и Бог Отец'],
		},
		{
			text: 'Видевший Меня видел Отца',
			book: 'Иоан',
			chapter: '14',
			verse: '9',
			id: '44',
			reason: ['Сын Божий – точное подобие Отца'],
		},
		{
			text: 'Был Свет истинный, Который просвещает всякого человека, приходящего в мир',
			book: 'Иоан',
			chapter: '1',
			verse: '9',
			id: '45',
			reason: ['Свойства Сына Божьего: Высший Разум'],
		},
		{
			text: 'Держа все словом силы Своей',
			book: 'Евр',
			chapter: '1',
			verse: '3',
			id: '46',
			reason: ['Свойства Сына Божьего: Вечная Сила'],
		},
		{
			text: 'Так и Сыну дал иметь жизнь в Самом Себе',
			book: 'Иоан',
			chapter: '5',
			verse: '26 ч/посл',
			id: '47',
			reason: ['Свойства Сына Божьего: Жизненная Сила'],
		},
		{
			text: 'Ибо в Нем обитает вся полнота Божества телесно',
			book: 'Кол',
			chapter: '2',
			verse: '9',
			id: '48',
			reason: ['Свойства Сына Божьего: Высшая Нравственность'],
		},
		{
			text: 'Образ Господа он видит; как же вы не убоялись упрекать раба Моего, Моисея?',
			book: 'Числ',
			chapter: '12',
			verse: '8',
			id: '49',
			reason: ['Сын Божий есть видимый Бог'],
		},
		{
			text: 'И даже вознесся на Вождя воинства сего',
			book: 'Дан',
			chapter: '8',
			verse: '11',
			id: '50',
			reason: ['Сын Божий – Глава ангелов'],
		},
		{
			text: 'Я желаю исполнить волю Твою, Боже мой',
			book: 'Псал',
			chapter: '39',
			verse: '9',
			id: '51',
			reason: ['Сын Божий – Исполнитель вола Отца'],
		},
		{
			text: 'Никто не отнимает ее (жизнь) у Меня, но Я Сам отдаю ее',
			book: 'Иоан',
			chapter: '10',
			verse: '18',
			id: '52',
			reason: ['Жертва Сына Божьего – добровольная'],
		},
		{
			text: 'Они вопиют, но нет спасающего; ко Господу, – но Он не внемлет им',
			book: 'Псал',
			chapter: '17',
			verse: '42',
			id: '53',
			reason: ['Христос не является Ходатаем за отступников'],
		},
		{
			text: 'Кто же верный и благоразумный раб, которого господин его поставил над слугами своими, чтобы давать им пищу во время?',
			book: 'Матф',
			chapter: '24',
			verse: '45',
			id: '54',
			reason: ['Христос через людей посылает пищу вовремя'],
		},
	],
	[
		{
			text: 'Ибо дух плоти и костей не имеет, как видите у Меня',
			book: 'Лук',
			chapter: '24',
			verse: '39',
			id: '55',
			reason: ['Дух Божий не имеет личности'],
		},
		{
			text: 'Дух истины, Который от Отца исходит',
			book: 'Иоан',
			chapter: '15',
			verse: '26',
			id: '56',
			reason: ['Дух Божий исходит от Отца'],
		},
		{
			text: 'Дух Святой… научит вас всему и напомнит вам все, что Я говорил вам',
			book: 'Иоан',
			chapter: '14',
			verse: '26',
			id: '57',
			reason: ['Свойства Духа Божьего: Высший Разум'],
		},
		{
			text: 'Словом Господа сотворены небеса, и духом уст Его — все воинство их',
			book: 'Псал',
			chapter: '32',
			verse: '6',
			id: '58',
			reason: ['Свойства Духа Божьего: Вечная Сила'],
		},
		{
			text: 'Дух Божий создал меня, и дыхание Вседержителя дало мне жизнь',
			book: 'Иов',
			chapter: '33',
			verse: '4',
			id: '59',
			reason: ['Свойства Духа Божьего: Жизненная Сила'],
		},
		{
			text: 'Если кто не родится от воды и Духа, не может войти в Царствие Божие',
			book: 'Иоан',
			chapter: '3',
			verse: '5',
			id: '60',
			reason: ['Свойства Духа Божьего: Высшая Нравственность'],
		},
		{
			text: 'Куда пойду от Духа Твоего, и от лица Твоего куда убегу?',
			book: 'Псал',
			chapter: '138',
			verse: '7',
			id: '61',
			reason: ['Дух Божий наполняет всю Вселенную'],
		},
		{
			text: 'И Дух Божий носился над водою',
			book: 'Быт',
			chapter: '1',
			verse: '2 ч/посл',
			id: '62',
			reason: ['Два проявления Духа Божьего: Буквальное'],
		},
		{
			text: 'Дух Господа Бога на Мне',
			book: 'Ис',
			chapter: '61',
			verse: '1',
			id: '63',
			reason: ['Два проявления Духа Божьего: Духовное'],
		},
		{
			text: 'Ибо сами уста Его повелели, и сам дух Его соберет их',
			book: 'Ис',
			chapter: '34',
			verse: '16',
			id: '64',
			reason: ['Дух Божий – практический Исполнитель вола Отца'],
		},
		{
			text: 'Если Я не пойду, Утешитель не придет к вам',
			book: 'Иоан',
			chapter: '16',
			verse: '7',
			id: '65',
			reason: ['Святой Дух – Заместитель Христа в ВПС'],
		},
		{
			text: 'Одному дается Духом слово мудрости…',
			book: '1Кор',
			chapter: '12',
			verse: '8',
			id: '66',
			reason: ['Два проявления Духа Святого: Дары'],
		},
		{
			text: 'Плод же духа: любовь, радость, мир, долготерпение',
			book: 'Гал',
			chapter: '5',
			verse: '22',
			id: '67',
			reason: ['Два проявления Духа Святого: Плоды'],
		},
		{
			text: 'Языки суть знамение не для верующих, а для неверующих; пророчество же не для неверующих, а для верующих',
			book: '1Кор',
			chapter: '14',
			verse: '22',
			id: '68',
			reason: ['Световые и чудодейственные дары'],
		},
		{
			text: 'Ибо не мерою дает Бог Духа',
			book: 'Иоан',
			chapter: '3',
			verse: '34',
			id: '69',
			reason: ['Ежедневное проявление даров и плодов Святого Духа'],
		},
		{
			text: 'Тела ваши суть храм живущего в вас Святого Духа, которого имеете вы от Бога',
			book: '1Кор',
			chapter: '6',
			verse: '19',
			id: '70',
			reason: ['Святой Дух формирует нравственное сознание членов Церкви'],
		},
		{
			text: 'Всякое даяние доброе и всякий дар совершенный нисходит свыше, от Отца светов',
			book: 'Иак',
			chapter: '1',
			verse: '17',
			id: '71',
			reason: ['Всё доброе в мире – продукт работы Святого Духа'],
		},
		{
			text: 'Не вечно Духу Моему быть пренебрегаемым человеками',
			book: 'Быт',
			chapter: '6',
			verse: '3',
			id: '72',
			reason: ['Легкомысленное отношение к действиям Духа Святого может перейти в хулу'],
		},
		{
			text: 'Он даст вам дождь в меру и будет ниспосылать вам дождь, дождь ранний и поздний, как прежде',
			book: 'Иоил',
			chapter: '2',
			verse: '23',
			id: '73',
			reason: ['Особые времена обильных проявлений даров Святого Духа'],
		},
		{
			text: 'Не всякому духу верьте, но испытывайте духов, от Бога ли они',
			book: '1Иоан',
			chapter: '4',
			verse: '1',
			id: '74',
			reason: ['Проявления Святого Духа контролируются Законом и вестью своего времени'],
		},
	],
	[
		{
			text: 'Ты совершен был в путях твоих со дня сотворения твоего',
			book: 'Иез',
			chapter: '28',
			verse: '15',
			id: '75',
			reason: ['Ангелы сотворены Богом'],
		},
		{
			text: 'Не много Ты умалил его пред ангелами',
			book: 'Псал',
			chapter: '8',
			verse: '6',
			id: '76',
			reason: ['Природа ангелов более высокая, чем у людей'],
		},
		{
			text: 'Ибо в воскресении ни женятся, ни выходят замуж, но пребывают, как Ангелы Божии на небесах',
			book: 'Матф',
			chapter: '22',
			verse: '30',
			id: '77',
			reason: ['Ангелы ни женятся, ни выходят замуж'],
		},
		{
			text: 'Не все ли они суть служебные духи, посылаемые на служение для тех, которые имеют наследовать спасение?',
			book: 'Евр',
			chapter: '1',
			verse: '14',
			id: '78',
			reason: ['Ангелы – служебные духи'],
		},
		{
			text: 'Ангел Господень, сошедший с небес, приступив отвалил камень',
			book: 'Матф',
			chapter: '28',
			verse: '2',
			id: '79',
			reason: ['В общении с людьми ангелы бывают: Видимыми, во всей славе'],
		},
		{
			text: 'И пришли те два Ангела в Содом вечером, когда Лот сидел у ворот',
			book: 'Быт',
			chapter: '19',
			verse: '1',
			id: '80',
			reason: ['В общении с людьми ангелы бывают: В образе человека'],
		},
		{
			text: 'И открыл Господь глаза Валааму, и увидел он Ангела Господня',
			book: 'Числ',
			chapter: '22',
			verse: '31',
			id: '81',
			reason: ['В общении с людьми ангелы бывают: Невидимыми, но постоянно присутствующими'],
		},
		{
			text: 'Если есть у него Ангел-наставник, один из тысячи, чтобы показать человеку прямой путь его',
			book: 'Иов',
			chapter: '33',
			verse: '23',
			id: '82',
			reason: ['За каждым членом Церкви закрепляется ангел Божий'],
		},
		{
			text: 'То, что ныне проповедано вам… во что желают проникнуть Ангелы',
			book: '1Петр',
			chapter: '1',
			verse: '12',
			id: '83',
			reason: ['ВПС представляет интерес для ангелов'],
		},
		{
			text: 'Вот, Я посылаю пред тобою Ангела Моего хранить тебя на пути',
			book: 'Исх',
			chapter: '23',
			verse: '20',
			id: '84',
			reason: ['Ангелы особенно охраняют служителей'],
		},
		{
			text: 'Впрочем я возвещу тебе, что начертано в истинном писании',
			book: 'Дан',
			chapter: '10',
			verse: '21',
			id: '85',
			reason: ['Ангелы дают пророчества'],
		},
		{
			text: 'Ангел отвечал ему: молитвы твои и милостыни твои пришли на память пред Богом',
			book: 'Деян',
			chapter: '10',
			verse: '4',
			id: '86',
			reason: ['Ангелы приготовляют сердца людей к принятию истины'],
		},
		{
			text: 'Но князь царства Персидского стоял против меня двадцать один день',
			book: 'Дан',
			chapter: '10',
			verse: '13',
			id: '87',
			reason: ['Ангелы руководят мировыми событиями'],
		},
	],
	[
		{
			text: 'Он сказал,- и сделалось; Он повелел,- и явилось',
			book: 'Псал',
			chapter: '32',
			verse: '9',
			id: '88',
			reason: ['Бог при творении не опирается на уже существующую материю'],
		},
		{
			text: 'Когда еще Он не сотворил… ни начальных пылинок вселенной',
			book: 'Притч',
			chapter: '8',
			verse: '26',
			id: '89',
			reason: ['Бог может использовать уже сотворённую Им же материю'],
		},
		{
			text: 'Не напрасно сотворил ее; Он образовал ее для жительства',
			book: 'Ис',
			chapter: '45',
			verse: '18',
			id: '90',
			reason: ['Бог создает миры для жительства'],
		},
		{
			text: 'И был день, когда пришли сыны Божии предстать пред Господа',
			book: 'Иов',
			chapter: '1',
			verse: '6',
			id: '91',
			reason: ['Сыны Божии — Адамы своих планет'],
		},
		{
			text: 'Дабы ныне соделалась известною чрез Церковь начальствам и властям на небесах многоразличная премудрость Божия',
			book: 'Еф',
			chapter: '3',
			verse: '10',
			id: '92',
			reason: ['Мирожителей радует домостроительство Царства благодати'],
		},
		{
			text: 'При общем ликовании утренних звезд, когда все сыны Божии восклицали от радости?',
			book: 'Иов',
			chapter: '38',
			verse: '7',
			id: '93',
			reason: ['Мирожители радовались при творении земли'],
		},
		{
			text: 'Земля же была безвидна и пуста, и тьма над бездною',
			book: 'Быт',
			chapter: '1',
			verse: '2 ч/1',
			id: '94',
			reason: ['Планеты в начале могут быть незаселенными'],
		},
	],
	[
		{
			text: 'Небеса и земля составлены из воды и водою',
			book: '2Петр',
			chapter: '3',
			verse: '5',
			id: '95',
			reason: ['Земля образована из простейших элементов'],
		},
		{
			text: 'Все соделал Он прекрасным в свое время, и вложил мир в сердце их',
			book: 'Еккл',
			chapter: '3',
			verse: '11',
			id: '96',
			reason: ['Господь всё сотворил прекрасным, и вложил мир в сердце человека'],
		},
		{
			text: 'И создал Господь Бог из ребра, взятого у человека, жену, и привел ее к человеку',
			book: 'Быт',
			chapter: '2',
			verse: '22',
			id: '97',
			reason: ['Жена имеет тесную, сердечную близость к мужу'],
		},
		{
			text: 'Среди улицы его, и по ту и по другую сторону реки, древо жизни, двенадцать раз приносящее плоды, дающее на каждый месяц плод свой',
			book: 'Откр',
			chapter: '22',
			verse: '2',
			id: '98',
			reason: ['Человек должен был периодически обращаться к дереву жизни и вкушать плоды его, чтобы вечно жить'],
		},
		{
			text: 'И увидел я новое небо и новую землю; ибо прежнее небо и прежняя земля миновали',
			book: 'Откр',
			chapter: '21',
			verse: '1',
			id: '99',
			reason: ['Потерянный рай возвратится'],
		},
		{
			text: 'Мой совет состоится, и всё, что Мне угодно, Я сделаю',
			book: 'Ис',
			chapter: '46',
			verse: '10',
			id: '100',
			reason: ['План Господа относительно нашей земли всё равно исполнится'],
		},
	],
	[
		{
			text: 'По определениям Твоим все стоит доныне; ибо все служит Тебе',
			book: 'Псал',
			chapter: '118',
			verse: '91',
			id: '101',
			reason: ['Законы природы исполняют волю Отца'],
		},
		{
			text: 'И увидел Бог все, что Он создал, и вот, хорошо весьма',
			book: 'Быт',
			chapter: '1',
			verse: '31',
			id: '102',
			reason: ['Бог Отец преследовал благие цели создавая законы природы'],
		},
		{
			text: 'Если кто разорит храм Божий, того покарает Бог',
			book: '1Кор',
			chapter: '3',
			verse: '17',
			id: '103',
			reason: ['Нарушение законов влечёт наказание'],
		},
		{
			text: 'Поставил его владыкою над делами рук Твоих; все положил под ноги его',
			book: 'Псал',
			chapter: '8',
			verse: '7',
			id: '104',
			reason: ['Соблюдение законов — благословение'],
		},
		{
			text: 'Пошлешь дух Твой — созидаются, и Ты обновляешь лицо земли',
			book: 'Псал',
			chapter: '103',
			verse: '30',
			id: '105',
			reason: ['Законы природы — результат работы Духа Божьего'],
		},
		{
			text: 'Стой, солнце, над Гаваоном, и луна, над долиною Аиалонскою!',
			book: 'Иис.Н.',
			chapter: '10',
			verse: '12',
			id: '106',
			reason: ['Бог не зависит от законов'],
		},
	],
	[
		{
			text: 'И дал мне Господь две скрижали каменные, написанные перстом Божиим',
			book: 'Втор',
			chapter: '9',
			verse: '10',
			id: '107',
			reason: ['Бог написал заповеди Своим перстом'],
		},
		{
			text: 'Начертай ясно на скрижалях, чтобы читающий легко мог прочитать',
			book: 'Авв',
			chapter: '2',
			verse: '2',
			id: '108',
			reason: ['ВНЗ в земной редакции приспособлен к условиям жизни людей'],
		},
		{
			text: 'Да будет воля Твоя и на земле, как на небе',
			book: 'Матф',
			chapter: '6',
			verse: '10',
			id: '109',
			reason: ['Закон – Конституция Вселенной'],
		},
		{
			text: 'Законом познается грех',
			book: 'Римл',
			chapter: '3',
			verse: '20',
			id: '110',
			reason: ['ВНЗ — измеритель праведности и греховности'],
		},
		{
			text: 'Где нет закона, нет и преступлений',
			book: 'Римл',
			chapter: '4',
			verse: '15',
			id: '111',
			reason: ['Наличие преступления говорит о наличии Закона'],
		},
		{
			text: 'И в сем будет наша праведность, если мы будем стараться исполнять все сии заповеди пред лицом Господа, Бога нашего',
			book: 'Втор',
			chapter: '6',
			verse: '25',
			id: '112',
			reason: ['Праведность — это исполнение Закона'],
		},
		{
			text: 'На сих двух заповедях утверждается весь закон и пророки',
			book: 'Матф',
			chapter: '22',
			verse: '40',
			id: '113',
			reason: ['В ВНЗ выражена любовь к Богу и к человеку (ближнему)'],
		},
		{
			text: 'Я видел предел всякого совершенства; но Твоя заповедь безмерно обширна',
			book: 'Псал',
			chapter: '118',
			verse: '96',
			id: '114',
			reason: ['В ВНЗ содержится не только буква, но и духовный смысл (сферы)'],
		},
		{
			text: 'Если нечестивый будет помилован, то не научится он правде',
			book: 'Ис',
			chapter: '26',
			verse: '10',
			id: '115',
			reason: ['Нельзя оставлять грешника ненаказанным'],
		},
		{
			text: 'Ибо это есть любовь к Богу, чтобы мы соблюдали заповеди Его; и заповеди Его не тяжки',
			book: '1Иоан',
			chapter: '5',
			verse: '3',
			id: '116',
			reason: ['Любовь к Богу — соблюдение ВНЗ'],
		},
		{
			text: 'Которыми дарованы нам великие и драгоценные обетования, дабы вы чрез них соделались причастниками Божеского естества',
			book: '2Петр',
			chapter: '1',
			verse: '4',
			id: '117',
			reason: ['Наличием Божеского естества обусловливается вечная жизнь'],
		},
		{
			text: 'Не скроем от детей их, возвещая роду грядущему',
			book: 'Псал',
			chapter: '77',
			verse: '4',
			id: '118',
			reason: ['ВНЗ передавался изначально устно'],
		},
		{
			text: 'И объявил Он вам завет Свой, который повелел вам исполнять, десятословие, и написал его на двух каменных скрижалях',
			book: 'Втор',
			chapter: '4',
			verse: '13',
			id: '119',
			reason: ['Затем ВНЗ был начертан на скрижалях'],
		},
		{
			text: 'Множеством беззаконий твоих в неправедной торговле твоей ты осквернил святилища твои',
			book: 'Иез',
			chapter: '28',
			verse: '18',
			id: '120',
			reason: ['Сатана нарушил ВНЗ'],
		},
		{
			text: 'Закон Господа совершен, укрепляет душу',
			book: 'Псал',
			chapter: '18',
			verse: '8',
			id: '121',
			reason: ['ВНЗ совершен'],
		},
	],
	[
		{
			text: 'Если ты удержишь ногу твою ради субботы от исполнения прихотей твоих во святой день Мой',
			book: 'Ис',
			chapter: '58',
			verse: '13',
			id: '122',
			reason: ['Суббота названа "днём Господним"'],
		},
		{
			text: 'И благословил Бог седьмой день, и освятил его',
			book: 'Быт',
			chapter: '2',
			verse: '3',
			id: '123',
			reason: ['Господь освятил субботу от самого начала'],
		},
		{
			text: 'Господь Бог, сотворивший концы земли, не утомляется и не изнемогает',
			book: 'Ис',
			chapter: '40',
			verse: '28 ч/1',
			id: '124',
			reason: ['Суббота — пример для нас, так как Бог не утомляется'],
		},
		{
			text: 'И святите субботы Мои, чтоб они были знамением между Мною и вами, дабы вы знали, что Я — Господь Бог ваш',
			book: 'Иез',
			chapter: '20',
			verse: '20',
			id: '125',
			reason: ['Суббота — знамение творения'],
		},
		{
			text: 'Субботы Мои соблюдайте; ибо это — знамение между Мною и вами в роды ваши, дабы вы знали, что Я Господь, освящающий вас',
			book: 'Исх',
			chapter: '31',
			verse: '13',
			id: '126',
			reason: ['Суббота — знамение освящения'],
		},
		{
			text: 'Ибо, кто вошел в покой Его, тот и сам успокоился от дел своих, как и Бог от Своих»',
			book: 'Евр',
			chapter: '4',
			verse: '10',
			id: '127',
			reason: ['Два покоя, определяемые субботой Господней: Покой от дел житейских'],
		},
		{
			text: 'Посему для народа Божия еще остается субботство',
			book: 'Евр',
			chapter: '4',
			verse: '9',
			id: '128',
			reason: ['Два покоя, определяемые субботой Господней: Покой во Христе (духовный), покой от греха'],
		},
		{
			text: 'Посему Сын Человеческий есть господин и субботы',
			book: 'Марк',
			chapter: '2',
			verse: '28',
			id: '129',
			reason: ['Создателем субботы является Сам Христос'],
		},
		{
			text: 'И сказал им: суббота для человека, а не человек для субботы',
			book: 'Марк',
			chapter: '2',
			verse: '27',
			id: '130',
			reason: ['Суббота дана для блага человека'],
		},
		{
			text: 'Из субботы в субботу будет приходить всякая плоть пред лицо Мое на поклонение',
			book: 'Ис',
			chapter: '66',
			verse: '23',
			id: '131',
			reason: ['Суббота будет и в вечности'],
		},
		{
			text: 'В субботы священники в храме нарушают субботу, однако невиновны',
			book: 'Матф',
			chapter: '12',
			verse: '5',
			id: '132',
			reason: ['Дела Божьи: Храмового служения'],
		},
		{
			text: 'И вошел, по обыкновению Своему, в день субботний в синагогу, и встал читать',
			book: 'Лук',
			chapter: '4',
			verse: '16',
			id: '133',
			reason: ['Дела Божьи: Миссионерские'],
		},
		{
			text: 'Зачем тебе ехать к нему? сегодня не новомесячие и не суббота',
			book: '4Цар',
			chapter: '4',
			verse: '23',
			id: '134',
			reason: ['Дела Божьи: Посещение священных собраний'],
		},
		{
			text: 'Сколько же лучше человек овцы! Итак можно в субботы делать добро',
			book: 'Матф',
			chapter: '12',
			verse: '12',
			id: '135',
			reason: ['Дела Божьи: Дела милосердия'],
		},
		{
			text: 'Кто из вас, имея одну овцу, если она в субботу упадет в яму, не возьмёт ее и не вытащит?',
			book: 'Матф',
			chapter: '12',
			verse: '11',
			id: '136',
			reason: ['Дела необходимости в субботу'],
		},
		{
			text: 'Шесть дней работай, и делай всякие дела твои',
			book: 'Исх',
			chapter: '20',
			verse: '9',
			id: '137',
			reason: ['Дела человеческие (житейские)'],
		},
		{
			text: 'Вы делаете дела отца вашего',
			book: 'Иоан',
			chapter: '8',
			verse: '41',
			id: '138',
			reason: ['Дела сатанинские'],
		},
	],
	[
		{
			text: 'Все обнажено и открыто пред очами Его: Ему дадим отчет',
			book: 'Евр',
			chapter: '4',
			verse: '13',
			id: '139',
			reason: ['Ответственность человека за злоупотребление свободной волей'],
		},
		{
			text: 'Ибо все из Него, Им и к Нему',
			book: 'Римл',
			chapter: '11',
			verse: '36',
			id: '140',
			reason: ['Все люди зависимы от Бога'],
		},
		{
			text: 'Придите ко Мне, все труждающиеся и обремененные, и Я успокою вас',
			book: 'Матф',
			chapter: '11',
			verse: '28',
			id: '141',
			reason: ['Господь ожидает, чтобы люди к Нему пришли добровольно'],
		},
		{
			text: 'Доброго, которого хочу, не делаю, а злое, которого не хочу, делаю',
			book: 'Римл',
			chapter: '7',
			verse: '19',
			id: '142',
			reason: ['Нужна борьба со злом в себе, чтобы наша воля соответствовала воле Божьей'],
		},
		{
			text: 'И уже не я живу, но живет во мне Христос',
			book: 'Гал',
			chapter: '2',
			verse: '20',
			id: '143',
			reason: ['Мы должны исполнять волю Божью как свою собственную'],
		},
		{
			text: 'И посылал к ним Господь, Бог отцов их, посланников Своих от раннего утра',
			book: '2Парал',
			chapter: '36',
			verse: '15',
			id: '144',
			reason: ['Господь предупреждает о последствиях злоупотребления свободной волей'],
		},
		{
			text: 'Ибо нет лицеприятия у Бога',
			book: 'Римл',
			chapter: '2',
			verse: '11',
			id: '145',
			reason: ['Господь проявляет Свой характер (любовь и правосудие) сообразуясь со свободной волей человека'],
		},
	],
	[
		{
			text: 'Как упал ты с неба, денница, сын зари!',
			book: 'Ис',
			chapter: '14',
			verse: '12',
			id: '146',
			reason: ['Сатана был низвержен с неба'],
		},
		{
			text: 'Низвержен на землю, и ангелы его низвержены с ним',
			book: 'Откр',
			chapter: '12',
			verse: '9',
			id: '147',
			reason: ['Ангелы были низвержены с сатаной'],
		},
		{
			text: 'Хвост его увлек с неба третью часть звезд и поверг их на землю',
			book: 'Откр',
			chapter: '12',
			verse: '4 ч/1',
			id: '148',
			reason: ['Сатаной была увлечена была треть ангелов'],
		},
		{
			text: 'И ангелов, не сохранивших своего достоинства… соблюдает… на суд великого дня',
			book: 'Иуд',
			chapter: '1',
			verse: '6',
			id: '149',
			reason: ['Ангелы сатаны будут судимы и наказаны. Первый текст'],
		},
		{
			text: 'Бог ангелов согрешивших не пощадил, но, связав узами адского мрака, предал блюсти на суд для наказания',
			book: '2Петр',
			chapter: '2',
			verse: '4',
			id: '150',
			reason: ['Ангелы сатаны будут судимы и наказаны. Второй текст'],
		},
		{
			text: 'И произошла на небе война: Михаил и Ангелы его воевали против дракона, и дракон и ангелы его воевали против них',
			book: 'Откр',
			chapter: '12',
			verse: '7',
			id: '151',
			reason: ['Война на небе'],
		},
	],
	[
		{
			text: 'Изгнал тебя, херувим осеняющий, из среды огнистых камней',
			book: 'Иез',
			chapter: '28',
			verse: '16',
			id: '152',
			reason: ['Сатана — бывший осеняющий херувим'],
		},
		{
			text: 'И сатану, стоящего по правую руку его, чтобы противодействовать ему',
			book: 'Зах',
			chapter: '3',
			verse: '1',
			id: '153',
			reason: ['Павший херувим проявляет себя в четырёх видах: Сатана — противник'],
		},
		{
			text: 'Потому что низвержен клеветник братий наших, клеветавший на них пред Богом нашим день и ночь',
			book: 'Откр',
			chapter: '12',
			verse: '10',
			id: '154',
			reason: ['Павший херувим проявляет себя в четырёх видах: Диавол — клеветник'],
		},
		{
			text: 'Но боюсь, чтобы, как змий хитростью своею прельстил Еву…',
			book: '2Кор',
			chapter: '11',
			verse: '3',
			id: '155',
			reason: ['Павший херувим проявляет себя в четырёх видах: Древний змей — воплощается, приспосабливается'],
		},
		{
			text: 'Дракон сей стал пред женою, которой надлежало родить…',
			book: 'Откр',
			chapter: '12',
			verse: '4 ч/посл',
			id: '156',
			reason: ['Павший херувим проявляет себя в четырёх видах: Дракон — воплощение в госсистемы'],
		},
		{
			text: 'По воле князя, господствующего в воздухе, духа, действующего ныне в сынах противления',
			book: 'Еф',
			chapter: '2',
			verse: '2',
			id: '157',
			reason: ['Сатана воплощается в идеях, обществах и людях посредством своего духа'],
		},
		{
			text: 'Чтобы они освободились от сети диавола, который уловил их в свою волю',
			book: '2Тим',
			chapter: '2',
			verse: '26',
			id: '158',
			reason: ['Сатана уловляет людей в свою волю'],
		},
	],
	[
		{
			text: 'Блаженны те, которые соблюдают заповеди Его, чтобы иметь им право на древо жизни',
			book: 'Откр',
			chapter: '22',
			verse: '14',
			id: '159',
			reason: ['Доступ к дереву жизни обусловлен послушанием'],
		},
		{
			text: 'В день, в который ты вкусишь от него, смертью умрёшь',
			book: 'Быт',
			chapter: '2',
			verse: '17',
			id: '160',
			reason: ['Дерево жизни — средство проверки послушания'],
		},
		{
			text: 'Они же, подобно Адаму, нарушили завет и там изменили Мне',
			book: 'Ос',
			chapter: '6',
			verse: '7',
			id: '161',
			reason: ['Завет Господа с Адамом и Евой'],
		},
		{
			text: 'И не Адам прельщен; но жена, прельстившись, впала в преступление',
			book: '1Тим',
			chapter: '2',
			verse: '14',
			id: '162',
			reason: ['Сатана прельстил сначала Еву'],
		},
		{
			text: 'Посему, как одним человеком грех вошел в мир, и грехом смерть',
			book: 'Римл',
			chapter: '5',
			verse: '12',
			id: '163',
			reason: ['Одним человеком грех вошёл в мир'],
		},
		{
			text: 'Но мы знаем, что закон, если что говорит, говорит к состоящим под законом, так что… весь мир становится виновен пред Богом',
			book: 'Римл',
			chapter: '3',
			verse: '19',
			id: '164',
			reason: ['Весь мир оказался в подсудном состоянии'],
		},
	],
	[
		{
			text: 'По откровению тайны, о которой от вечных времен было умолчано',
			book: 'Римл',
			chapter: '14',
			verse: '24',
			id: '165',
			reason: ['ВПС существовал до грехопадения'],
		},
		{
			text: 'Которых имена не написаны в книге жизни у Агнца, закланного от создания мира',
			book: 'Откр',
			chapter: '13',
			verse: '8',
			id: '166',
			reason: ['Практическое ВПС начался с грехопадения, после сотворения мира'],
		},
		{
			text: 'По предвечному определению, которое Он исполнил во Христе Иисусе, Господе нашем',
			book: 'Еф',
			chapter: '3',
			verse: '11',
			id: '167',
			reason: ['Сын Божий практически осуществил "предвечное определение"'],
		},
		{
			text: 'Господу угодно было, ради правды Своей, возвеличить и прославить закон',
			book: 'Ис',
			chapter: '42',
			verse: '21',
			id: '168',
			reason: ['Три плана ВПС: план оправдания Закона и правления Божьего'],
		},
		{
			text: 'Вот Агнец Божий, Который берет на Себя грех мира',
			book: 'Иоан',
			chapter: '1',
			verse: '29',
			id: '169',
			reason: ['Три плана ВПС: план искупления грешника'],
		},
		{
			text: 'Ты - Петр, и на сем камне Я создам Церковь Мою, и врата ада не одолеют ее',
			book: 'Матф',
			chapter: '16',
			verse: '18',
			id: '170',
			reason: ['Три плана ВПС: план домостроительства Царства благодати'],
		},
		{
			text: 'Чтобы оправдание закона исполнилось в нас, живущих не по плоти, но по духу',
			book: 'Римл',
			chapter: '8',
			verse: '4',
			id: '171',
			reason: ['Оправдание ВНЗ должно исполниться и в нашей жизни'],
		},
		{
			text: 'Посему Он должен был во всем уподобиться братиям',
			book: 'Евр',
			chapter: '2',
			verse: '17',
			id: '172',
			reason: ['Христос в земной жизни со всём уподобился нам'],
		},
	],
	[
		{
			text: 'Благодать воцарилась чрез праведность к жизни вечной Иисусом Христом, Господом нашим',
			book: 'Римл',
			chapter: '5',
			verse: '21',
			id: '173',
			reason: ['В церкви царствует благодать Святого Духа'],
		},
		{
			text: 'Ибо Ему надлежит царствовать, доколе низложит всех врагов под ноги Свои',
			book: '1Кор',
			chapter: '15',
			verse: '25',
			id: '174',
			reason: ['Христос — Царь Царства благодати'],
		},
		{
			text: 'Итак вы уже не чужие и не пришельцы, но сограждане святым и свои Богу',
			book: 'Еф',
			chapter: '2',
			verse: '19',
			id: '175',
			reason: ['Граждане Царства благодати'],
		},
		{
			text: 'И свет во тьме светит, и тьма не объяла его',
			book: 'Иоан',
			chapter: '1',
			verse: '5',
			id: '176',
			reason: ['Три родословные нити Царства благодати: Нить световая, идейная'],
		},
		{
			text: 'Не прекратится у Давида муж, сидящий на престоле дома Израилева',
			book: 'Иер',
			chapter: '33',
			verse: '17',
			id: '177',
			reason: ['Три родословные нити Царства благодати: Нить служителей, служебная'],
		},
		{
			text: 'Если сии уставы перестанут действовать… то и племя Израилево перестанет быть народом предо Мною навсегда',
			book: 'Иер',
			chapter: '31',
			verse: '36',
			id: '178',
			reason: ['Три родословные нити Царства благодати: Нить общественная, церковная'],
		},
	],
	[
		{
			text: 'И семь лампад на нем, и по семи трубочек у лампад, которые наверху его',
			book: 'Зах',
			chapter: '4',
			verse: '2',
			id: '179',
			reason: ['Семь ветхозаветних периодов — семь лампад'],
		},
		{
			text: 'Семь светильников, которые ты видел, суть семь церквей',
			book: 'Откр',
			chapter: '1',
			verse: '20',
			id: '180',
			reason: ['Семь новозаветних периодов — семь светильников'],
		},
		{
			text: 'Если начаток свят, то и целое; и если корень свят, то и ветви',
			book: 'Римл',
			chapter: '11',
			verse: '16',
			id: '181',
			reason: ['Три части периода: Начаток'],
		},
		{
			text: 'Я насадил тебя как благородную лозу, — самое чистое семя; как же ты превратилась у Меня в дикую отрасль чужой лозы?',
			book: 'Иер',
			chapter: '2',
			verse: '21',
			id: '182',
			reason: ['Три части периода: Отступление'],
		},
		{
			text: 'Так и в нынешнее время, по избранию благодати, сохранился остаток',
			book: 'Римл',
			chapter: '11',
			verse: '5',
			id: '183',
			reason: ['Три части периода: Остаток'],
		},
		{
			text: 'С того времени, как выйдет повеление о восстановлении Иерусалима, до Христа Владыки семь седмин и шестьдесят две седмины',
			book: 'Дан',
			chapter: '9',
			verse: '25',
			id: '184',
			reason: ['70 седьмин — наглядное представление деления периода. Текст первый'],
		},
		{
			text: 'И утвердит завет для многих одна седмина',
			book: 'Дан',
			chapter: '9',
			verse: '27',
			id: '185',
			reason: ['70 седьмин — наглядное представление деления периода. Текст второй'],
		},
		{
			text: 'Они отломились неверием, а ты держишься верою',
			book: 'Римл',
			chapter: '11',
			verse: '20',
			id: '186',
			reason: ['Отступники каждого периода сравниваются с отламывающимися ветвями'],
		},
	],
	[
		{
			text: 'Все Писание богодухновенно и полезно…',
			book: '2Тим',
			chapter: '3',
			verse: '16',
			id: '187',
			reason: ['Слово Божье — богодухновенно'],
		},
		{
			text: 'Изрекали его святые Божии человеки, будучи движимы Духом Святым',
			book: '2Петр',
			chapter: '1',
			verse: '21',
			id: '188',
			reason: ['Библия написана человеческими орудиями по вдохновению Святого Духа'],
		},
		{
			text: '…А наипаче в том, что им вверено слово Божие',
			book: 'Римл',
			chapter: '3',
			verse: '2',
			id: '189',
			reason: ['Неканонические книги Библии не являются богодухновенными, так как их не было на еврейском (или арамейском) языке'],
		},
		{
			text: 'Ибо слово Божие живо и действенно и острее всякого меча обоюдоострого',
			book: 'Евр',
			chapter: '4',
			verse: '12',
			id: '190',
			reason: ['Библия — вечно живое слово'],
		},
		{
			text: 'Все это происходило с ними, как образы; а описано в наставление нам, достигшим последних веков',
			book: '1Кор',
			chapter: '10',
			verse: '11',
			id: '191',
			reason: ['Слово Божье в историях прошлого содержит наставления для нас'],
		},
		{
			text: 'Горе им, потому что идут путем Каиновым, предаются обольщению мзды, как Валаам, и в упорстве погибают, как Корей',
			book: 'Иуд',
			chapter: '1',
			verse: '11',
			id: '192',
			reason: ['Повторность всех библейских опытов борьбы и пророчеств'],
		},
		{
			text: 'Слова мудрых — как иглы и как вбитые гвозди, и составители их — от единого пастыря',
			book: 'Еккл',
			chapter: '12',
			verse: '11',
			id: '193',
			reason: ['В Библии нет идейный противоречий, так как составители — от Единого Пастыря'],
		},
		{
			text: 'Бог, многократно и многообразно говоривший издревле отцам в пророках',
			book: 'Евр',
			chapter: '1',
			verse: '1',
			id: '194',
			reason: ['Библия содержит символы, образы, прообразы'],
		},
		{
			text: 'Слова Господни — слова чистые, серебро, очищенное от земли в горниле, семь раз переплавленное',
			book: 'Псал',
			chapter: '11',
			verse: '7',
			id: '195',
			reason: ['Слово Божье представлено в символе серебра'],
		},
		{
			text: 'Не прибавляйте к тому, что я заповедую вам, и не убавляйте от того',
			book: 'Втор',
			chapter: '4',
			verse: '2',
			id: '196',
			reason: ['К Слову Божьему нельзя ни прибавлять, ни убавлять'],
		},
		{
			text: 'Если Он назвал богами тех, к которым было слово Божие, и не может нарушиться Писание',
			book: 'Иоан',
			chapter: '10',
			verse: '35',
			id: '197',
			reason: ['Кажущиеся противоречия Библии разрешаются её гармонией'],
		},
		{
			text: 'Истреблен будет народ Мой за недостаток ведения',
			book: 'Ос',
			chapter: '4',
			verse: '6',
			id: '198',
			reason: ['Только закалившие свои души гармонией всей Библии смогут устоять'],
		},
		{
			text: 'И свет луны будет, как свет солнца, а свет солнца будет светлее всемеро',
			book: 'Ис',
			chapter: '30',
			verse: '26',
			id: '199',
			reason: ['В последнее время ветхозаветние прообразы будут изучены и поняты во всех деталях'],
		},
		{
			text: 'Исследуйте Писания, ибо вы думаете чрез них иметь жизнь вечную',
			book: 'Иоан',
			chapter: '5',
			verse: '39',
			id: '200',
			reason: ['Библию необходимо исследовать'],
		},
		{
			text: 'И присоединяли толкование, и народ понимал прочитанное',
			book: 'Неем',
			chapter: '8',
			verse: '8',
			id: '201',
			reason: ['Библию должны толковать служители'],
		},
		{
			text: 'Зачем и вы преступаете заповедь Божию ради предания вашего?',
			book: 'Матф',
			chapter: '15',
			verse: '3',
			id: '202',
			reason: ['Никакие человеческие постановления не должны заменять Библию'],
		},
		{
			text: 'Но не принесло им пользы слово слышанное, не растворенное верою слышавших',
			book: 'Евр',
			chapter: '4',
			verse: '2',
			id: '203',
			reason: ['Не достаточно только читать и знать Слово Божье. Нужно растворять его верой'],
		},
		{
			text: 'Я бодрствую над словом Моим, чтоб оно скоро исполнилось',
			book: 'Иер',
			chapter: '1',
			verse: '12',
			id: '204',
			reason: ['Всё, что написано в Библии — исполнится'],
		},
	],
	[
		{
			text: 'Одно тело и один дух, как вы и призваны к одной надежде вашего звания',
			book: 'Еф',
			chapter: '4',
			verse: '4',
			id: '205',
			reason: ['Церковь — общество с одной идеей и организацией'],
		},
		{
			text: 'Только все должно быть благопристойно и чинно',
			book: '1Кор',
			chapter: '14',
			verse: '40',
			id: '206',
			reason: ['Церковь — общество с одним идеалом духовно-нравственной жизни'],
		},
		{
			text: 'Иисус же сказал им… мир вам! как послал Меня Отец, так и Я посылаю вас',
			book: 'Иоан',
			chapter: '20',
			verse: '21',
			id: '207',
			reason: ['Церковью управляет Христос в лице служителей'],
		},
		{
			text: 'И все покорил под ноги Его, и поставил Его выше всего, главою Церкви',
			book: 'Еф',
			chapter: '1',
			verse: '22',
			id: '208',
			reason: ['Глава Церкви — Христос'],
		},
		{
			text: 'Один Господь, одна вера, одно крещение',
			book: 'Еф',
			chapter: '4',
			verse: '5',
			id: '209',
			reason: ['Церковь Божья — единственная'],
		},
		{
			text: 'Они ставили порог свой у порога Моего и вереи дверей своих подле Моих верей, так что одна стена была между Мною и ими',
			book: 'Иез',
			chapter: '43',
			verse: '8',
			id: '210',
			reason: ['Кроме Церкви Божьей есть и ложные религиозные общества'],
		},
		{
			text: 'Ибо касающийся вас, касается зеницы ока Его',
			book: 'Зах',
			chapter: '2',
			verse: '8',
			id: '211',
			reason: ['Господь хранит Свою Церковь'],
		},
		{
			text: 'И если бы не сократились те дни, то не спаслась бы никакая плоть; но ради избранных сократятся те дни',
			book: 'Матф',
			chapter: '24',
			verse: '22',
			id: '212',
			reason: ['Господь сокращает время скорби для Церкви'],
		},
		{
			text: 'Выслушаем сущность всего: бойся Бога и заповеди Его соблюдай, потому что в этом все для человека',
			book: 'Еккл',
			chapter: '12',
			verse: '13',
			id: '213',
			reason: ['Признаки истинности Церкви Божьей: Признаёт и соблюдает ВНЗ'],
		},
		{
			text: 'Потому что Бог во Христе примирил с Собою мир, не вменяя людям преступлений их',
			book: '2Кор',
			chapter: '5',
			verse: '19',
			id: '214',
			reason: ['Признаки истинности Церкви Божьей: Находится в свете ВВЕ'],
		},
		{
			text: 'Но притом и новую заповедь пишу вам… потому что тьма проходит и истинный свет уже светит',
			book: '1Иоан',
			chapter: '2',
			verse: '8',
			id: '215',
			reason: ['Признаки истинности Церкви Божьей: Находится в свете всв'],
		},
		{
			text: 'Царство Твое — царство всех веков, и владычество Твое во все роды',
			book: 'Псал',
			chapter: '144',
			verse: '13',
			id: '216',
			reason: ['Признаки истинности Церкви Божьей: Имеет непрерывную родословную нить'],
		},
		{
			text: 'Церковь Бога живого, столп и утверждение истины',
			book: '1Тим',
			chapter: '3',
			verse: '15',
			id: '217',
			reason: ['Церковь Божья является хранителем истины'],
		},
		{
			text: 'А Господь Бог есть истина',
			book: 'Иер',
			chapter: '10',
			verse: '10',
			id: '218',
			reason: ['Истина в её пяти основных проявлениях: Бог Отец есть истина'],
		},
		{
			text: 'Иисус сказал ему: Я есмь путь и истина и жизнь',
			book: 'Иоан',
			chapter: '14',
			verse: '6 ч/1',
			id: '219',
			reason: ['Истина в её пяти основных проявлениях: Сын Божий лично и в вести есть истина'],
		},
		{
			text: 'Потому что Дух есть истина',
			book: '1Иоан',
			chapter: '5',
			verse: '6',
			id: '220',
			reason: ['Истина в её пяти основных проявлениях: Дух Святой есть истина'],
		},
		{
			text: 'Правда Твоя — правда вечная, и закон Твой — истина',
			book: 'Псал',
			chapter: '118',
			verse: '142',
			id: '221',
			reason: ['Истина в её пяти основных проявлениях: Закон Божий есть истина'],
		},
		{
			text: 'Освяти их истиною Твоею: слово Твое есть истина',
			book: 'Иоан',
			chapter: '17',
			verse: '17',
			id: '222',
			reason: ['Истина в её пяти основных проявлениях: Слово Божье есть истина'],
		},
		{
			text: 'Вы — соль земли…',
			book: 'Матф',
			chapter: '5',
			verse: '13',
			id: '223',
			reason: ['Церковь — соль земли'],
		},
		{
			text: 'Вы — свет мира…',
			book: 'Матф',
			chapter: '5',
			verse: '14',
			id: '224',
			reason: ['Церковь — свет мира'],
		},
		{
			text: 'Итак идите, научите все народы…',
			book: 'Матф',
			chapter: '28',
			verse: '19',
			id: '225',
			reason: ['Цели церкви: Внешняя — проповедь ВВЕ'],
		},
		{
			text: 'Чтобы представить всякого человека совершенным во Христе Иисусе',
			book: 'Кол',
			chapter: '1',
			verse: '28',
			id: '226',
			reason: ['Цели церкви: Внутренняя — приготовление к Царству славы'],
		},
		{
			text: 'Которая есть Тело Его, полнота Наполняющего все во всем',
			book: 'Еф',
			chapter: '1',
			verse: '23',
			id: '227',
			reason: ['Церковь — духовно-символическое тело Христа'],
		},
		{
			text: 'Ибо, как тело без духа мертво, так и вера без дел мертва',
			book: 'Иак',
			chapter: '2',
			verse: '26',
			id: '228',
			reason: ['Формальное пребывание в Церкви не даст спасения'],
		},
	],
	[
		{
			text: 'Бог же терпения и утешения да дарует вам быть в единомыслии между собою, по учению Христа Иисуса',
			book: 'Римл',
			chapter: '15',
			verse: '5',
			id: '229',
			reason: ['Истинное единство основано: На идейном единстве с Отцом и Сыном (Истина)'],
		},
		{
			text: 'У множества же уверовавших было одно сердце и одна душа',
			book: 'Деян',
			chapter: '4',
			verse: '32',
			id: '230',
			reason: ['Истинное единство основано: На сердечных чувствах взаимной любви друг ко другу'],
		},
		{
			text: 'Но тщетно чтут Меня, уча учениям, заповедям человеческим',
			book: 'Матф',
			chapter: '15',
			verse: '9',
			id: '231',
			reason: ['Ложное единство основано: На человеческих учениях'],
		},
		{
			text: 'Затыкали уши свои, и единодушно устремились на него',
			book: 'Деян',
			chapter: '7',
			verse: '57',
			id: '232',
			reason: ['Ложное единство основано: На сердечных чувствах ложной любви'],
		},
		{
			text: 'Думаете ли вы, что Я пришел дать мир земле? нет, говорю вам, но разделение',
			book: 'Лук',
			chapter: '12',
			verse: '51',
			id: '233',
			reason: ['Справедливое разделение'],
		},
		{
			text: 'Следовало ли тебе помогать нечестивцу и любить ненавидящих Господа? За это на тебя гнев от лица Господня',
			book: '2Парал',
			chapter: '19',
			verse: '2',
			id: '234',
			reason: ['Греховное отсутствие разделения'],
		},
		{
			text: 'Уклоняйся от зла, и делай добро, и будешь жить вовек',
			book: 'Псал',
			chapter: '36',
			verse: '27',
			id: '235',
			reason: ['Справедливое уклонение'],
		},
		{
			text: 'Не дай мне уклониться от заповедей Твоих',
			book: 'Псал',
			chapter: '118',
			verse: '10',
			id: '236',
			reason: ['Несправедливое уклонение'],
		},
		{
			text: 'Черту провел над поверхностию воды, до границ света со тьмою',
			book: 'Иов',
			chapter: '26',
			verse: '10',
			id: '237',
			reason: ['Необходимо знать границу между светом и тьмой'],
		},
		{
			text: 'Человек полагает предел тьме, и тщательно разыскивает камень во мраке и тени смертной',
			book: 'Иов',
			chapter: '28',
			verse: '3',
			id: '238',
			reason: ['Необходимо полагать предел тьме'],
		},
		{
			text: 'И вы хорошо делаете, что обращаетесь к нему, как к светильнику, сияющему в темном месте',
			book: '2Петр',
			chapter: '1',
			verse: '19',
			id: '239',
			reason: ['Пророчества — светильник'],
		},
		{
			text: 'Разумеешь ли равновесие облаков, чудное дело Совершеннейшего в знании?',
			book: 'Иов',
			chapter: '37',
			verse: '16',
			id: '240',
			reason: ['Гармония Библии — равновесие облаков'],
		},
	],
	[
		{
			text: 'Я, Господь, хранитель его, в каждое мгновение напояю его; ночью и днем стерегу его, чтобы кто не ворвался в него',
			book: 'Ис',
			chapter: '27',
			verse: '3',
			id: '241',
			reason: ['Непрерывность Царства благодати обеспечивается световыми дарами от Господа'],
		},
		{
			text: 'Все же сие производит один и тот же Дух, разделяя каждому особо, как Ему угодно',
			book: '1Кор',
			chapter: '12',
			verse: '11',
			id: '242',
			reason: ['Не все дары раздаются каждому одинаково'],
		},
		{
			text: 'И будет после того, излию от Духа Моего… старцам вашим будут сниться сны, и юноши ваши будут видеть видения',
			book: 'Иоил',
			chapter: '2',
			verse: '28',
			id: '243',
			reason: ['Чудодейственные дары проявляются время от времени'],
		},
		{
			text: 'Ибо я весьма желаю увидеть вас, чтобы преподать вам некое дарование духовное к утверждению вашему',
			book: 'Римл',
			chapter: '1',
			verse: '11',
			id: '244',
			reason: ['Дары Духа даются в основном посредственно — через весть и вестников'],
		},
		{
			text: 'Нехорошо взять хлеб у детей и бросить псам',
			book: 'Матф',
			chapter: '15',
			verse: '26',
			id: '245',
			reason: ['Вне церкви не могут проявляться духовные дары, имеющие отношение к всв'],
		},
		{
			text: 'По плодам их узнаете их. Собирают ли с терновника виноград или с репейника смоквы?',
			book: 'Матф',
			chapter: '7',
			verse: '16',
			id: '246',
			reason: ['Как узнать, от Бога ли дух'],
		},
	],
	[
		{
			text: 'Ибо Христос вошел не в рукотворенное святилище, по образу истинного устроенное',
			book: 'Евр',
			chapter: '9',
			verse: '24',
			id: '247',
			reason: ['На небе есть святилище. Земное святилище было устроено по образцу небесного'],
		},
		{
			text: 'И отверзся храм Божий на небе, и явился ковчег завета Его в храме Его',
			book: 'Откр',
			chapter: '11',
			verse: '19',
			id: '248',
			reason: ['В небесном святилище тоже есть ковчег'],
		},
		{
			text: 'Там Я буду открываться тебе и говорить с тобою над крышкою, посреди двух херувимов, которые над ковчегом откровения',
			book: 'Исх',
			chapter: '25',
			verse: '22',
			id: '249',
			reason: ['ВНЗ помещённый в ковчег — средоточие святилища'],
		},
		{
			text: 'Где были золотой сосуд с манною, жезл Ааронов расцветший и скрижали завета',
			book: 'Евр',
			chapter: '9',
			verse: '4',
			id: '250',
			reason: ['Предметы в ковчеге'],
		},
		{
			text: 'Ты, сын человеческий, возвести дому Израилеву о храме сем, чтоб они устыдились беззаконий своих, и чтобы сняли с него меру',
			book: 'Иез',
			chapter: '43',
			verse: '10',
			id: '251',
			reason: ['Земное святилище и все предметы его были прообразом храма истины'],
		},
		{
			text: 'И наполнился храм дымом от славы Божией и от силы Его, и никто не мог войти в храм',
			book: 'Откр',
			chapter: '15',
			verse: '8',
			id: '252',
			reason: ['Следственный суд в небесном святилище будет продолжаться до закрытия благодати'],
		},
	],
	[
		{
			text: 'И сказал мне: на две тысячи триста вечеров и утр; и тогда святилище очистится',
			book: 'Дан',
			chapter: '8',
			verse: '14',
			id: '253',
			reason: ['Пророчество о 2300-х вечерах и утрах'],
		},
		{
			text: 'День за год, день за год Я определил тебе',
			book: 'Иез',
			chapter: '4',
			verse: '6',
			id: '254',
			reason: ['Пророческий день — гражданский год'],
		},
		{
			text: 'Семьдесят седмин определены для народа твоего и святого города твоего',
			book: 'Дан',
			chapter: '9',
			verse: '24',
			id: '255',
			reason: ['Семьдесят седьмин — начало 2300 вечеров и утр'],
		},
		{
			text: 'От меня дано повеление, чтобы в царстве моем всякий из народа Израилева… желающий идти в Иерусалим, шел с тобою',
			book: 'Ездр',
			chapter: '7',
			verse: '13',
			id: '256',
			reason: ['Указ Артаксеркса о восстановлении Иерусалима'],
		},
		{
			text: 'Внимает Господь и слышит это, и пред лицом Его пишется памятная книга',
			book: 'Мал',
			chapter: '3',
			verse: '16',
			id: '257',
			reason: ['Суд в небесном святилище проходит по написанному в памятных книгах'],
		},
		{
			text: 'Ибо всем нам должно явиться пред судилище Христово, чтобы каждому получить соответственно тому, что он делал…',
			book: '2Кор',
			chapter: '5',
			verse: '10',
			id: '258',
			reason: ['Суд в небесном святилище проходит по делам человека'],
		},
		{
			text: 'Ибо время начаться суду с дома Божия; если же прежде с нас начнется, то какой конец непокоряющимся Евангелию Божию?',
			book: '1Петр',
			chapter: '4',
			verse: '17',
			id: '259',
			reason: ['Суд сначала будет проходить над домом Божьим'],
		},
	],
	[
		{
			text: 'Вам же и прочим, находящимся в Фиатире',
			book: 'Откр',
			chapter: '2',
			verse: '24',
			id: '260',
			reason: ['Два остатка периода Фиатиры (а также Сардиса и Филадельфии)'],
		},
		{
			text: 'И дана мне трость, подобная жезлу, и сказано: встань и измерь храм Божий и жертвенник, и поклоняющихся в нем',
			book: 'Откр',
			chapter: '11',
			verse: '1',
			id: '261',
			reason: ['Верхний остаток сохранял полноту Царства благодати по трём отделам'],
		},
		{
			text: 'Здесь терпение святых, соблюдающих заповеди Божии и веру в Иисуса',
			book: 'Откр',
			chapter: '14',
			verse: '12',
			id: '262',
			reason: ['Знамя верхнего остатка'],
		},
		{
			text: 'Здесь терпение и вера святых',
			book: 'Откр',
			chapter: '13',
			verse: '10',
			id: '263',
			reason: ['Знамя нижнего остатка'],
		},
		{
			text: 'А внешний двор храма исключи и не измеряй его, ибо он дан язычникам',
			book: 'Откр',
			chapter: '11',
			verse: '2',
			id: '264',
			reason: ['Нижний остаток — внешний двор храма истины'],
		},
		{
			text: 'Кто эта, восходящая от пустыни как бы столбы дыма',
			book: 'Песн.П',
			chapter: '3',
			verse: '6',
			id: '265',
			reason: ['Нижнее течение — церковь восходящая от пустыни'],
		},
	],
	[
		{
			text: 'И видел я другого Ангела сильного, сходящего с неба, облеченного облаком',
			book: 'Откр',
			chapter: '10',
			verse: '1',
			id: '266',
			reason: ['Великое адвент-движение'],
		},
		{
			text: 'И застроятся потомками твоими пустыни вековые: ты восстановишь основания многих поколений',
			book: 'Ис',
			chapter: '58',
			verse: '12',
			id: '267',
			reason: ['Адвент-движение должно было: Восстановить все истины, попранные зверем'],
		},
		{
			text: 'Бегите из среды Вавилона и спасайте каждый душу свою, чтобы не погибнуть от беззакония его',
			book: 'Иер',
			chapter: '51',
			verse: '6',
			id: '268',
			reason: ['Адвент-движение должно было: Спасти из Вавилона искренних душ'],
		},
		{
			text: 'Ибо, если мы веруем, что Иисус умер и воскрес, то и умерших в Иисусе Бог приведет с Ним',
			book: '1Фес',
			chapter: '4',
			verse: '14',
			id: '269',
			reason: ['Адвент-движение должно было: Приготовить народ Божий ко встрече со Спасителем'],
		},
		{
			text: 'Но в полночь раздался крик: «вот, жених идет, выходите навстречу ему»',
			book: 'Матф',
			chapter: '25',
			verse: '6',
			id: '270',
			reason: ['Полночный крик'],
		},
		{
			text: 'Даже возмечтает отменить у них праздничные времена и закон',
			book: 'Дан',
			chapter: '7',
			verse: '25',
			id: '271',
			reason: ['Папство отменило праздничные времена и закон'],
		},
	],
	[
		{
			text: 'Вот, Я пошлю к вам Илию пророка пред наступлением дня Господня, великого и страшного',
			book: 'Мал',
			chapter: '4',
			verse: '5',
			id: '272',
			reason: ['Иной ангел, совершает работу в духе и силе Илии'],
		},
		{
			text: 'Господь потрясет все от великой реки до потока Египетского, и вы, сыны Израиля, будете собраны',
			book: 'Ис',
			chapter: '27',
			verse: '12',
			id: '273',
			reason: ['Две части работы Иного ангела: Внутрицерковная реформация в Лаодикии'],
		},
		{
			text: 'И придут затерявшиеся в Ассирийской земле и изгнанные в землю Египетскую, и поклонятся Господу',
			book: 'Ис',
			chapter: '27',
			verse: '13',
			id: '274',
			reason: ['Две части работы Иного ангела: Работа ко всему миру'],
		},
		{
			text: 'На пастырей воспылал гнев Мой… ибо посетит Господь Саваоф стадо Свое',
			book: 'Зах',
			chapter: '10',
			verse: '3',
			id: '275',
			reason: ['Четыре стадии Иного ангела: Работа к отступившим в церкви АСД'],
		},
		{
			text: 'И пойдут многие народы и скажут: «придите, и взойдем на гору Господню»',
			book: 'Мих',
			chapter: '4',
			verse: '2',
			id: '276',
			reason: ['Четыре стадии Иного ангела: Работа к миру с неполными истинами'],
		},
		{
			text: 'Я сделаю Иерусалим чашею исступления для всех окрестных народов',
			book: 'Зах',
			chapter: '12',
			verse: '2',
			id: '277',
			reason: ['Четыре стадии Иного ангела: Работа к миру с полными истинами'],
		},
		{
			text: 'Защищать будет Господь жителей Иерусалима, и самый слабый между ними… будет как Давид',
			book: 'Зах',
			chapter: '12',
			verse: '8',
			id: '278',
			reason: ['Четыре стадии Иного ангела: Работа к миру в силе чудодейственных даров Святого Духа'],
		},
	],
	[
		{
			text: 'После сего я увидел иного Ангела, сходящего с неба и имеющего власть великую',
			book: 'Откр',
			chapter: '18',
			verse: '1',
			id: '279',
			reason: ['Весть Верного Свидетеля — первая стадия Иного ангела'],
		},
		{
			text: 'И ухватятся семь женщин за одного мужчину в тот день',
			book: 'Ис',
			chapter: '4',
			verse: '1',
			id: '280',
			reason: ['Едом — седьмая жена-отступница'],
		},
		{
			text: 'Пастыри Мои не искали овец Моих и пасли пастыри самих себя, а овец Моих не пасли',
			book: 'Иез',
			chapter: '34',
			verse: '8',
			id: '281',
			reason: ['Пророчество о том, что руководство павших АСД не примут эту весть и будут сопротивляться ей'],
		},
		{
			text: 'Се, стою у двери и стучу: если кто услышит голос Мой и отворит дверь, войду к нему',
			book: 'Откр',
			chapter: '3',
			verse: '20',
			id: '282',
			reason: ['ВСВИ примут лишь отдельные искренние души'],
		},
		{
			text: 'Но в те дни, когда возгласит седьмой Ангел, когда он вострубит, совершится тайна Божия',
			book: 'Откр',
			chapter: '10',
			verse: '7',
			id: '283',
			reason: ['При возгласе седьмого ангела должна совершиться (завершиться) тайна ВПС'],
		},
		{
			text: 'Но оставлю среди тебя народ смиренный и простой',
			book: 'Соф',
			chapter: '3',
			verse: '12',
			id: '284',
			reason: ['Из отступившего общества лже-АСД выйдут искренние'],
		},
	],
	[
		{
			text: 'Сердце мудрого знает и время и устав',
			book: 'Еккл',
			chapter: '8',
			verse: '5',
			id: '285',
			reason: ['Мудрые знают уставы времени'],
		},
		{
			text: 'Лицемеры! различать лицо неба вы умеете, а знамений времен не можете?',
			book: 'Матф',
			chapter: '16',
			verse: '3',
			id: '286',
			reason: ['Важно замечать знамения времени'],
		},
		{
			text: 'Но когда пришла полнота времени, Бог послал Сына Своего (Единородного)',
			book: 'Гал',
			chapter: '4',
			verse: '4',
			id: '287',
			reason: ['«Полнота времени»'],
		},
		{
			text: 'Знаешь ли ты уставы неба, можешь ли установить господство его на земле?',
			book: 'Иов',
			chapter: '38',
			verse: '33',
			id: '288',
			reason: ['Господь устанавливает господство уставов на земле'],
		},
		{
			text: 'Кто это говорит: «и то бывает, чему Господь не повелел быть»?',
			book: 'Пл.Иер',
			chapter: '3',
			verse: '37',
			id: '289',
			reason: ['Всё происходит по воле Божьей'],
		},
		{
			text: 'И сказал: «доселе дойдешь, и не перейдешь, и здесь предел надменным волнам твоим»?',
			book: 'Иов',
			chapter: '38',
			verse: '11',
			id: '290',
			reason: ['Господь полагает предел нечестивым'],
		},
		{
			text: 'Но вы, братия, не во тьме, чтобы день застал вас, как тать',
			book: '1Фес',
			chapter: '5',
			verse: '4',
			id: '291',
			reason: ['Народ Божий знает время и устав'],
		},
		{
			text: 'Так и слово Мое, которое исходит из уст Моих, — оно не возвращается ко Мне тщетным',
			book: 'Ис',
			chapter: '55',
			verse: '11',
			id: '292',
			reason: ['Слово Господа не возвращается тщетным'],
		},
	],
	[
		{
			text: 'Не хорошо быть человеку одному; сотворим ему помощника, соответственного ему',
			book: 'Быт',
			chapter: '2',
			verse: '18',
			id: '293',
			reason: ['Брак — Божье учреждение'],
		},
		{
			text: 'А сподобившиеся достигнуть того века и воскресения из мертвых ни женятся, ни замуж не выходят',
			book: 'Лук',
			chapter: '20',
			verse: '35',
			id: '294',
			reason: ['Брак будет существовать до будущего рая'],
		},
		{
			text: 'Кто найдет добродетельную жену? цена ее выше жемчугов',
			book: 'Притч',
			chapter: '31',
			verse: '10',
			id: '295',
			reason: ['Цели брака: 1.1. Помощь физическая'],
		},
		{
			text: 'И если станет преодолевать кто-либо одного, то двое устоят против него',
			book: 'Еккл',
			chapter: '4',
			verse: '12',
			id: '296',
			reason: ['Цели брака: 1.2. Помощь духовная'],
		},
		{
			text: 'И благословил их Бог, и сказал им Бог: плодитесь и размножайтесь, и наполняйте землю',
			book: 'Быт',
			chapter: '1',
			verse: '28',
			id: '297',
			reason: ['Цели брака: 2. Рождение и воспитание детей'],
		},
		{
			text: 'Но, во избежание блуда, каждый имей свою жену, и каждая имей своего мужа',
			book: '1Кор',
			chapter: '7',
			verse: '2',
			id: '298',
			reason: ['Цели брака: 3. Сохранение от блуда'],
		},
		{
			text: 'И не бери из дочерей их жен сынам своим',
			book: 'Исх',
			chapter: '34',
			verse: '16',
			id: '299',
			reason: ['Вступать в брак можно только в Господе – лишь с братьями и сёстрами во Христе'],
		},
		{
			text: 'Итак, что Бог сочетал, того человек да не разлучает',
			book: 'Матф',
			chapter: '19',
			verse: '6',
			id: '300',
			reason: ['Незаконный развод не разрешается Словом Божьим'],
		},
		{
			text: 'Кто разводится с женою своею, кроме вины любодеяния, тот подает ей повод прелюбодействовать',
			book: 'Матф',
			chapter: '5',
			verse: '32',
			id: '301',
			reason: ['Причины законного развода: Прелюбодеяние одной из сторон'],
		},
		{
			text: 'Если же неверующий хочет развестись, пусть разводится; брат или сестра в таких случаях не связаны',
			book: '1Кор',
			chapter: '7',
			verse: '15',
			id: '302',
			reason: ['Причины законного развода: Нежелание неверующего жить с верующим'],
		},
		{
			text: 'Жены, повинуйтесь своим мужьям, чтобы те из них, которые не покоряются слову… приобретаемы были',
			book: '1Петр',
			chapter: '3',
			verse: '1',
			id: '303',
			reason: ['Жена не должна господствовать над мужем'],
		},
		{
			text: 'Потому что муж есть глава жены, как и Христос глава Церкви',
			book: 'Еф',
			chapter: '5',
			verse: '23',
			id: '304',
			reason: ['Муж и жена — прообраз Христа и Церкви'],
		},
	],
	[
		{
			text: 'И всякого скота чистого возьми по семи… а из скота нечистого по два…',
			book: 'Быт',
			chapter: '7',
			verse: '2',
			id: '305',
			reason: ['Деление на чистых и нечистых животных было от самого начала Царства благодати'],
		},
		{
			text: 'И взял из всякого скота чистого, и из всех птиц чистых, и принес во всесожжение',
			book: 'Быт',
			chapter: '8',
			verse: '20',
			id: '306',
			reason: ['Жертвы разрешалось приносить только из чистых животных'],
		},
		{
			text: 'Чтобы отличать нечистое от чистого, и животных, которых можно есть, от животных, которых есть не должно',
			book: 'Лев',
			chapter: '11',
			verse: '47',
			id: '307',
			reason: ['Разрешение употреблять в пищу мясо распространялось только на мясо чистых животных'],
		},
		{
			text: 'Никакого тука и никакой крови не ешьте',
			book: 'Лев',
			chapter: '3',
			verse: '17',
			id: '308',
			reason: ['Запрет вкушать тук и кровь'],
		},
		{
			text: 'Потому что душа тела в крови, и Я назначил ее вам для жертвенника',
			book: 'Лев',
			chapter: '17',
			verse: '11',
			id: '309',
			reason: ['Душа в крови'],
		},
		{
			text: 'А написать им, чтоб они воздерживались от… удавленины и крови',
			book: 'Деян',
			chapter: '15',
			verse: '20',
			id: '310',
			reason: ['В новозаветнее время закон о пище не утратил актуальность'],
		},
		{
			text: 'Иисус Христос вчера и сегодня и вовеки тот же',
			book: 'Евр',
			chapter: '13',
			verse: '8',
			id: '311',
			reason: ['В моральном отношении у Бога нет изменения'],
		},
	],
	[
		{
			text: 'Нет власти не от Бога, существующие же власти от Бога установлены',
			book: 'Римл',
			chapter: '13',
			verse: '1',
			id: '312',
			reason: ['Всякая государственная власть как система бытового упорядочения – от Бога'],
		},
		{
			text: 'Итак отдавайте кесарево кесарю, а Божие Богу',
			book: 'Матф',
			chapter: '22',
			verse: '21',
			id: '313',
			reason: ['Наше отношение к государственным властям'],
		},
		{
			text: 'Итак отдавайте всякому должное: кому подать, подать; кому оброк, оброк; кому страх, страх; кому честь, честь',
			book: 'Римл',
			chapter: '13',
			verse: '7',
			id: '314',
			reason: ['В отношении властей мира сего в их законных рамках мы обязаны отдавать должное'],
		},
		{
			text: 'Должно повиноваться больше Богу, нежели человекам',
			book: 'Деян',
			chapter: '5',
			verse: '29',
			id: '315',
			reason: ['Отношение к превышающим законные права властям'],
		},
		{
			text: 'Царство Мое не от мира сего; если бы от мира сего было Царство Мое, то служители Мои подвизались бы за Меня',
			book: 'Иоан',
			chapter: '18',
			verse: '36',
			id: '316',
			reason: ['Мы не можем участвовать в политических мероприятиях, ставящих целью свержение властей'],
		},
		{
			text: 'Тогда говорит ему Иисус: возврати меч твой в его место, ибо все, взявшие меч, мечом погибнут',
			book: 'Матф',
			chapter: '26',
			verse: '52',
			id: '317',
			reason: ['Наше отношение к военному вопросу'],
		},
		{
			text: 'А Я говорю вам: не клянись вовсе',
			book: 'Матф',
			chapter: '5',
			verse: '34',
			id: '318',
			reason: ['Наше отношение к клятве'],
		},
	],
	[
		{
			text: 'Слово ваше (да будет) всегда с благодатию, приправлено солью, дабы вы знали, как отвечать каждому',
			book: 'Кол',
			chapter: '4',
			verse: '6',
			id: '319',
			reason: ['Нужно правильно вести себя в общениях со злоумышленными'],
		},
		{
			text: 'Ибо каждый понесет свое бремя',
			book: 'Гал',
			chapter: '6',
			verse: '5',
			id: '320',
			reason: ['Отвечать лишь за себя'],
		},
		{
			text: 'Не давайте святыни псам и не бросайте жемчуга вашего перед свиньями',
			book: 'Матф',
			chapter: '7',
			verse: '6',
			id: '321',
			reason: ['Не допускать вмешательство в религиозную сферу'],
		},
		{
			text: 'Разве вам позволено бичевать Римского гражданина, да и без суда?',
			book: 'Деян',
			chapter: '22',
			verse: '25',
			id: '322',
			reason: ['Защищать свои права'],
		},
		{
			text: 'Потому что я оказался пред Ним чист, да и перед тобою, царь, я не сделал преступления',
			book: 'Дан',
			chapter: '6',
			verse: '22',
			id: '323',
			reason: ['Отрицать несправедливые обвинения'],
		},
		{
			text: 'Но Иисус и на это ничего не отвечал, так что Пилат дивился',
			book: 'Марк',
			chapter: '15',
			verse: '5',
			id: '324',
			reason: ['Святое молчание'],
		},
	],
	[
		{
			text: 'Ибо прах ты, и в прах возвратишься',
			book: 'Быт',
			chapter: '3',
			verse: '19',
			id: '325',
			reason: ['Человек сотворён из праха'],
		},
		{
			text: 'В семидесяти душах пришли отцы твои в Египет',
			book: 'Втор',
			chapter: '10',
			verse: '22',
			id: '326',
			reason: ['Четыре значения слова «душа»: Сам человек'],
		},
		{
			text: 'Да возвратится душа отрока сего в него!',
			book: '3Цар',
			chapter: '17',
			verse: '21',
			id: '327',
			reason: ['Четыре значения слова «душа»: Физическая жизнь человека'],
		},
		{
			text: 'Кровь есть душа; не ешь души вместе с мясом',
			book: 'Втор',
			chapter: '12',
			verse: '23',
			id: '328',
			reason: ['Четыре значения слова «душа»: Кровь'],
		},
		{
			text: 'И найдете покой душам вашим',
			book: 'Матф',
			chapter: '11',
			verse: '29',
			id: '329',
			reason: ['Четыре значения слова «душа»: Внутренние чувства'],
		},
		{
			text: 'Он возвращается в землю свою; в тот день исчезают все помышления его',
			book: 'Псал',
			chapter: '145',
			verse: '4',
			id: '330',
			reason: ['Смерть – это бессознательное состояние'],
		},
		{
			text: 'Я узрю Его сам; мои глаза, не глаза другого, увидят Его',
			book: 'Иов',
			chapter: '19',
			verse: '27',
			id: '331',
			reason: ['Человек будет воссоздан с его физическим и моральным обликом для воздаяния'],
		},
		{
			text: 'Как бы не… взял также от дерева жизни, и не вкусил, и не стал жить вечно',
			book: 'Быт',
			chapter: '3',
			verse: '22',
			id: '332',
			reason: ['Вкушение плодов древа жизни продлевало жизнь'],
		},
		{
			text: 'Верующий в Сына имеет жизнь вечную',
			book: 'Иоан',
			chapter: '3',
			verse: '36',
			id: '333',
			reason: ['Жизнь вечная человеку даруется через: Веру во Христа'],
		},
		{
			text: 'Тем, которые постоянством в добром деле ищут славы, чести и бессмертия, жизнь вечную',
			book: 'Римл',
			chapter: '2',
			verse: '7',
			id: '334',
			reason: ['Жизнь вечная человеку даруется через: Соблюдение ВНЗ'],
		},
		{
			text: 'Слушающий слово Мое и верующий в Пославшего Меня имеет жизнь вечную',
			book: 'Иоан',
			chapter: '5',
			verse: '24 ч/1',
			id: '335',
			reason: ['Вечная жизнь начинается уже здесь, в Царстве благодати'],
		},
		{
			text: 'Говорю вам тайну: не все мы умрем, но все изменимся',
			book: '1Кор',
			chapter: '15',
			verse: '51',
			id: '336',
			reason: ['Дожившие до Второго пришествия Христа не вкусят смерти'],
		},
		{
			text: 'И когда скажут вам: «обратитесь к вызывателям умерших…», тогда отвечайте… спрашивают ли мертвых о живых?',
			book: 'Ис',
			chapter: '8',
			verse: '19',
			id: '337',
			reason: ['Спиритизм осуждается Библией'],
		},
	],
	[
		{
			text: 'Блаженны мёртвые, умирающие в Господе… дела их идут вслед за ними',
			book: 'Откр',
			chapter: '14',
			verse: '13',
			id: '338',
			reason: ['Дела умерших людей идут вслед за ними'],
		},
		{
			text: 'Радуйтесь с радующимися и плачьте с плачущими',
			book: 'Римл',
			chapter: '12',
			verse: '15',
			id: '339',
			reason: ['Святой долг — принять личное участие в похоронах'],
		},
		{
			text: 'Сердце мудрых — в доме плача, а сердце глупых — в доме веселия',
			book: 'Еккл',
			chapter: '7',
			verse: '4',
			id: '340',
			reason: ['Плач лучше веселья'],
		},
		{
			text: 'И многие из Иудеев пришли к Марфе и Марии — утешать их в печали о брате их',
			book: 'Иоан',
			chapter: '11',
			verse: '19',
			id: '341',
			reason: ['На похоронах должно быть сочувствие к родственникам умершего'],
		},
		{
			text: 'Что это за памятник, который я вижу? И сказали ему жители города: это могила человека Божия',
			book: '4Цар',
			chapter: '23',
			verse: '17',
			id: '342',
			reason: ['На могиле должен быть надгробный памятник'],
		},
		{
			text: 'Так говорит Господь: сделай завещание для дома твоего, ибо ты умрешь, не выздоровеешь',
			book: 'Ис',
			chapter: '38',
			verse: '1',
			id: '343',
			reason: ['Перед смертью член церкви должен сделать завещание'],
		},
	],
	[
		{
			text: 'Да распространит Бог Иафета; и да вселится он в шатрах Симовых',
			book: 'Быт',
			chapter: '9',
			verse: '27',
			id: '344',
			reason: ['В конце периода Семидесяти седьмин исполнилось пророчество Ноя'],
		},
		{
			text: 'Вам первым надлежало быть проповедану слову Божию; но как вы отвергаете его… то вот, мы обращаемся к язычникам',
			book: 'Деян',
			chapter: '13',
			verse: '46',
			id: '345',
			reason: ['Израиль отверг весть Евангелия, после чего весть пошла к язычникам'],
		},
		{
			text: 'Да помрачатся глаза их, чтоб не видеть, и хребет их да будет согбен навсегда',
			book: 'Римл',
			chapter: '11',
			verse: '10',
			id: '346',
			reason: ['Израиль как избранная нация отвержен навсегда'],
		},
		{
			text: 'Ибо вам принадлежит обетование… и всем дальним, кого ни призовет Господь Бог наш',
			book: 'Деян',
			chapter: '2',
			verse: '39',
			id: '347',
			reason: ['Обетования Божьи, данные древнему Израилю, относятся ныне к духовному Израилю'],
		},
		{
			text: 'Ибо не все те Израильтяне, которые от Израиля',
			book: 'Римл',
			chapter: '9',
			verse: '6',
			id: '348',
			reason: ['В Новом завете Израиль не ограничен буквальной родословной'],
		},
		{
			text: 'Но тот Иудей, кто внутренно таков… ему и похвала не от людей, но от Бога',
			book: 'Римл',
			chapter: '2',
			verse: '29',
			id: '349',
			reason: ['Израиль в Новом завете — это Израиль по духу'],
		},
	],
	[
		{
			text: 'Как непостижимы судьбы Его и неисследимы пути Его!',
			book: 'Римл',
			chapter: '11',
			verse: '33',
			id: '350',
			reason: ['Судьба от Бога – неисследима'],
		},
		{
			text: 'Который хочет, чтобы все люди спаслись и достигли познания истины',
			book: '1Тим',
			chapter: '2',
			verse: '4',
			id: '351',
			reason: ['Воля Божья – чтобы все люди без исключения спаслись'],
		},
		{
			text: 'А Христос за всех умер, чтобы живущие уже не для себя жили, но для умершего за них',
			book: '2Кор',
			chapter: '5',
			verse: '15',
			id: '352',
			reason: ['Христос умер за всех людей'],
		},
		{
			text: 'Если будешь искать Его, то найдешь Его; а если оставишь Его, Он оставит тебя навсегда',
			book: '1Парал',
			chapter: '28',
			verse: '9',
			id: '353',
			reason: ['Спасение и вечная жизнь зависят главным образом от самого человека'],
		},
		{
			text: 'Бог не искушается злом и Сам не искушает никого',
			book: 'Иак',
			chapter: '1',
			verse: '13',
			id: '354',
			reason: ['Бог непричастен злу'],
		},
		{
			text: 'Но каждый искушается, увлекаясь и обольщаясь собственною похотью',
			book: 'Иак',
			chapter: '1',
			verse: '14',
			id: '355',
			reason: ['Человек сам себя отдаёт власти злого духа'],
		},
	],
	[
		{
			text: 'Так как Он избрал нас в Нем… чтобы мы были святы и непорочны пред Ним',
			book: 'Еф',
			chapter: '1',
			verse: '4',
			id: '356',
			reason: ['Библия об избрании'],
		},
		{
			text: 'И те, которые с Ним, суть званые и избранные и верные',
			book: 'Откр',
			chapter: '17',
			verse: '14',
			id: '357',
			reason: ['Избрание к спасению – это ещё не есть спасение'],
		},
		{
			text: 'За то, что ты отверг слово Господа, и Он отверг тебя, чтобы ты не был царем',
			book: '1Цар',
			chapter: '15',
			verse: '23',
			id: '358',
			reason: ['Избранные порой отступали'],
		},
		{
			text: 'Некогда не народ, а ныне народ Божий; некогда непомилованные, а ныне помилованы',
			book: '1Петр',
			chapter: '2',
			verse: '10',
			id: '359',
			reason: ['Неизбранные проявляли верность'],
		},
		{
			text: 'Только это я нашел, что Бог сотворил человека правым, а люди пустились во многие помыслы',
			book: 'Еккл',
			chapter: '7',
			verse: '29',
			id: '360',
			reason: ['Бог сотворил человека правым'],
		},
		{
			text: 'Какая польза человеку, если он приобретет весь мир, а душе своей повредит?',
			book: 'Матф',
			chapter: '16',
			verse: '26',
			id: '361',
			reason: ['Избрание Богом людей с их рождения в Свои орудия не гарантировало им спасения'],
		},
	],
	[
		{
			text: 'И я слышал число запечатленных: запечатленных было сто сорок четыре тысячи из всех колен сынов Израилевых',
			book: 'Откр',
			chapter: '7',
			verse: '4',
			id: '362',
			reason: ['Должно быть запечатлено определённое число искупленных'],
		},
		{
			text: 'Неправедный пусть еще делает неправду; нечистый пусть еще сквернится; праведный да творит правду еще, и святой да освящается еще',
			book: 'Откр',
			chapter: '22',
			verse: '11',
			id: '363',
			reason: ['После закрытия благодати судьбы всех будут решены'],
		},
		{
			text: 'Семь Ангелов, имеющих семь последних язв, которыми оканчивалась ярость Божия',
			book: 'Откр',
			chapter: '15',
			verse: '1',
			id: '364',
			reason: ['В семи последних язвах окончится ярость Божья'],
		},
		{
			text: 'Посему Он оставит их до времени',
			book: 'Мих',
			chapter: '5',
			verse: '3',
			id: '365',
			reason: ['Искупленные и запечатленные будут оставлены Духом Святым для последнего испытания'],
		},
		{
			text: 'Тогда явится знамение Сына Человеческого на небе; и тогда восплачутся все племена земные',
			book: 'Матф',
			chapter: '24',
			verse: '30',
			id: '366',
			reason: ['Христос Вторым пришествием спасёт Свой народ'],
		},
		{
			text: 'И говорят горам и камням: падите на нас и сокройте нас от лица Сидящего на престоле и от гнева Агнца',
			book: 'Откр',
			chapter: '6',
			verse: '16',
			id: '367',
			reason: ['Реакция нечестивых на Второе пришествие Христа'],
		},
		{
			text: 'О, какой день! ибо день Господень близок: как опустошение от Всемогущего придет он',
			book: 'Иоил',
			chapter: '1',
			verse: '15',
			id: '368',
			reason: ['Иоиль о закрытии благодати'],
		},
		{
			text: 'Близок великий день Господа, близок — и очень поспешает: уже слышен голос дня Господня. Горько возопиет тогда и самый храбрый!',
			book: 'Соф',
			chapter: '1',
			verse: '14',
			id: '369',
			reason: ['Софония о закрытии благодати'],
		},
		{
			text: 'Горе желающим дня Господня! Для чего вам этот день Господень? он — тьма, а не свет',
			book: 'Ам',
			chapter: '5',
			verse: '18',
			id: '370',
			reason: ['Амос о закрытии благодати'],
		},
		{
			text: 'Прошла жатва, кончилось лето, а мы не спасены',
			book: 'Иер',
			chapter: '8',
			verse: '20',
			id: '371',
			reason: ['Иеремия о закрытии благодати'],
		},
		{
			text: 'И заревет на него в тот день как бы рев разъяренного моря; и взглянет он на землю, и вот тьма, горе, и свет померк в облаках',
			book: 'Ис',
			chapter: '5',
			verse: '30',
			id: '372',
			reason: ['Исаия о закрытии благодати'],
		},
		{
			text: 'О, горе! велик тот день, не было подобного ему; это — бедственное время для Иакова, но он будет спасен от него',
			book: 'Иер',
			chapter: '30',
			verse: '7',
			id: '373',
			reason: ['Время язв названо бедственным временем для Иакова'],
		},
		{
			text: 'Вот, наступают дни… когда Я пошлю на землю голод, — не голод хлеба, не жажду воды, но жажду слышания слов Господних',
			book: 'Ам',
			chapter: '8',
			verse: '11',
			id: '374',
			reason: ['После закрытия благодати люди не смогут утолить свою духовную жажду и духовный голод'],
		},
	],
	[
		{
			text: 'Ибо, как молния исходит от востока и видна бывает даже до запада, так будет пришествие Сына Человеческого',
			book: 'Матф',
			chapter: '24',
			verse: '27',
			id: '375',
			reason: ['Второе пришествие будет видимым одновременно по всему миру'],
		},
		{
			text: 'Сей Иисус, вознесшийся от вас на небо, приидет таким же образом, как вы видели Его восходящим на небо',
			book: 'Деян',
			chapter: '1',
			verse: '11',
			id: '376',
			reason: ['Второе пришествие будет личным и видимым'],
		},
		{
			text: 'Когда же приидет Сын Человеческий во славе Своей и все святые Ангелы с Ним',
			book: 'Матф',
			chapter: '25',
			verse: '31',
			id: '377',
			reason: ['Во Втором пришествии Сына Божьего будут сопровождать ангелы'],
		},
		{
			text: 'О дне же том и часе никто не знает, ни Ангелы небесные, а только Отец Мой один',
			book: 'Матф',
			chapter: '24',
			verse: '36',
			id: '378',
			reason: ['День и час пришествия Христа никто не будет знать до самого конца'],
		},
		{
			text: 'День гнева — день сей, день скорби и тесноты, день опустошения и разорения, день тьмы и мрака',
			book: 'Соф',
			chapter: '1',
			verse: '15',
			id: '379',
			reason: ['Для части людей день пришествия Христа будет днём страшным и ужасным'],
		},
		{
			text: 'И скажут в тот день: вот Он, Бог наш! на Него мы уповали, и Он спас нас!.. возрадуемся и возвеселимся во спасении Его!',
			book: 'Ис',
			chapter: '25',
			verse: '9',
			id: '380',
			reason: ['Для других день пришествия Христа будет днём радости и счастья'],
		},
	],
	[
		{
			text: 'И многие из спящих в прахе земли пробудятся, одни для жизни вечной, другие на вечное поругание и посрамление',
			book: 'Дан',
			chapter: '12',
			verse: '2',
			id: '381',
			reason: ['В частичном воскресении воскреснут два класса людей'],
		},
		{
			text: 'Отныне узрите Сына Человеческого, сидящего одесную силы и грядущего на облаках небесных',
			book: 'Матф',
			chapter: '26',
			verse: '64',
			id: '382',
			reason: ['Из нечестивых воскреснут: Прямые виновники и участники страданий Христа'],
		},
		{
			text: 'Се, грядет с облаками, и узрит Его всякое око и те, которые пронзили Его; и возрыдают пред Ним все племена земные',
			book: 'Откр',
			chapter: '1',
			verse: '7',
			id: '383',
			reason: ['Из нечестивых воскреснут: Самые ярые враги истины и гонители народа Божьего'],
		},
		{
			text: 'И тогда откроется беззаконник, которого Господь Иисус убьет духом уст Своих и истребит явлением пришествия Своего',
			book: '2Фес',
			chapter: '2',
			verse: '8',
			id: '384',
			reason: ['После частичного воскресения нечестивые будут убиты духом уст Христа'],
		},
		{
			text: 'И заключу с ними завет мира, завет вечный будет с ними',
			book: 'Иез',
			chapter: '37',
			verse: '26',
			id: '385',
			reason: ['После частичного воскресения Бог: Заключит с искупленными вечный завет мира'],
		},
		{
			text: 'Скрой, что говорили семь громов, и не пиши сего',
			book: 'Откр',
			chapter: '10',
			verse: '4',
			id: '386',
			reason: ['После частичного воскресения Бог: Объявит день и час пришествия Христа'],
		},
	],
	[
		{
			text: 'Блажен и свят имеющий участие в воскресении первом: над ними смерть вторая не имеет власти',
			book: 'Откр',
			chapter: '20',
			verse: '6',
			id: '387',
			reason: ['Библия о первом воскресении'],
		},
		{
			text: 'И изыдут творившие добро в воскресение жизни, а делавшие зло в воскресение осуждения',
			book: 'Иоан',
			chapter: '5',
			verse: '29',
			id: '388',
			reason: ['Библия о воскресении жизни'],
		},
		{
			text: 'И не войдет в него ничто нечистое… а только те, которые написаны у Агнца в книге жизни',
			book: 'Откр',
			chapter: '21',
			verse: '27',
			id: '389',
			reason: ['В воскресении жизни воскреснут только записанные в книге жизни'],
		},
		{
			text: 'Ибо вострубит, и мертвые воскреснут нетленными, а мы изменимся',
			book: '1Кор',
			chapter: '15',
			verse: '52',
			id: '390',
			reason: ['Тела живых святых во мгновение ока будут преображены'],
		},
		{
			text: 'Потом мы, оставшиеся в живых, вместе с ними восхищены будем на облаках в сретение Господу на воздухе',
			book: '1Фес',
			chapter: '4',
			verse: '17',
			id: '391',
			reason: ['Искупленные святые будут восхищены на небо'],
		},
		{
			text: 'И когда Он снял седьмую печать, сделалось безмолвие на небе, как бы на полчаса',
			book: 'Откр',
			chapter: '8',
			verse: '1',
			id: '392',
			reason: ['Искупленные святые вместе со Христом будут в течение семи дней вознесены на небо небес'],
		},
	],
	[
		{
			text: 'Наше же жительство — на небесах, откуда мы ожидаем и Спасителя, Господа (нашего) Иисуса Христа',
			book: 'Фил',
			chapter: '3',
			verse: '20',
			id: '393',
			reason: ['Тысячелетнее царство будет на небесах'],
		},
		{
			text: 'Он взял дракона, змия древнего, который есть диавол и сатана, и сковал его на тысячу лет',
			book: 'Откр',
			chapter: '20',
			verse: '2',
			id: '394',
			reason: ['Дьявол будет скован на тысячу лет'],
		},
		{
			text: 'И небо скрылось, свившись как свиток',
			book: 'Откр',
			chapter: '6',
			verse: '14',
			id: '395',
			reason: ['Непохороненные, трупы людей будут лежать на поверхности земли, не подверженные разложению ввиду анаэробной среды'],
		},
		{
			text: 'И судимы были мертвые по написанному в книгах, сообразно с делами своими',
			book: 'Откр',
			chapter: '20',
			verse: '12',
			id: '396',
			reason: ['Дела, отмеченные в памятных книгах — определитель меры наказания'],
		},
		{
			text: 'Разве не знаете, что мы будем судить ангелов, не тем ли более дела житейские?',
			book: '1Кор',
			chapter: '6',
			verse: '3',
			id: '397',
			reason: ['Павших ангелов будут судить искупленные'],
		},
		{
			text: 'И будут заключены в темницу, и после многих дней будут наказаны',
			book: 'Ис',
			chapter: '24',
			verse: '22',
			id: '398',
			reason: ['Исаия о состоянии нечестивых во время тысячелетнего суда'],
		},
		{
			text: 'И будут пораженные Господом в тот день — от конца земли до конца земли, не будут оплаканы и не будут прибраны и похоронены',
			book: 'Иер',
			chapter: '25',
			verse: '33',
			id: '399',
			reason: ['Иеремия о состоянии нечестивых во время тысячелетнего суда'],
		},
	],
	[
		{
			text: 'Прочие же из умерших не ожили, доколе не окончится тысяча лет',
			book: 'Откр',
			chapter: '20',
			verse: '5',
			id: '400',
			reason: ['Воскресение всех нечестивых'],
		},
		{
			text: 'И станут ноги Его в тот день на горе Елеонской… и раздвоится гора Елеонская… весьма большою долиною',
			book: 'Зах',
			chapter: '14',
			verse: '4',
			id: '401',
			reason: ['Нисхождение Христа на гору Елеонскую, от чего образуется большая долина'],
		},
		{
			text: 'И град будет падать на лес, и город спустится в долину',
			book: 'Ис',
			chapter: '32',
			verse: '19',
			id: '402',
			reason: ['Нисхождение города Нового Иерусалима с неба в долину'],
		},
		{
			text: 'И вышли на широту земли и окружили стан святых и город возлюбленный',
			book: 'Откр',
			chapter: '20',
			verse: '8',
			id: '403',
			reason: ['Нечестивые во главе с сатаной окружают Новый Иерусалим'],
		},
		{
			text: 'Идите от Меня, проклятые, в огонь вечный, уготованный диаволу и ангелам его',
			book: 'Матф',
			chapter: '25',
			verse: '41',
			id: '404',
			reason: ['Над всеми нечестивыми изрекается Христом приговор вечной смерти'],
		},
		{
			text: 'Ибо вот, придет день, пылающий как печь; тогда все надменные и поступающие нечестиво будут как солома',
			book: 'Мал',
			chapter: '4',
			verse: '1',
			id: '405',
			reason: ['Окончательное уничтожение нечестивых в огненном озере. Смерть вторая'],
		},
		{
			text: 'Тогда небеса с шумом прейдут, стихии же, разгоревшись, разрушатся, земля и все дела на ней сгорят',
			book: '2Петр',
			chapter: '3',
			verse: '10',
			id: '406',
			reason: ['Вся земля будет очищена и обновлена огнём'],
		},
	],
	[
		{
			text: 'Он ожидал города, имеющего основание, которого художник и строитель Бог',
			book: 'Евр',
			chapter: '11',
			verse: '10',
			id: '407',
			reason: ['Художник и строитель Нового Иерусалима — Бог '],
		},
		{
			text: 'Побеждающему дам вкушать от древа жизни, которое посреди рая Божия',
			book: 'Откр',
			chapter: '2',
			verse: '7',
			id: '408',
			reason: ['Человек вновь обретёт право на доступ к дереву жизни'],
		},
		{
			text: 'И народ твой весь будет праведный, навеки наследует землю',
			book: 'Ис',
			chapter: '60',
			verse: '21',
			id: '409',
			reason: ['Человек вновь станет владыкой всей земли'],
		},
		{
			text: 'И сделает пустыни его, как рай, и степь его, как сад Господа',
			book: 'Ис',
			chapter: '51',
			verse: '3',
			id: '410',
			reason: ['Земля будет представлять из себя цветущий сад'],
		},
		{
			text: 'Не видел того глаз, не слышало ухо, и не приходило то на сердце человеку, что приготовил Бог любящим Его',
			book: '1Кор',
			chapter: '2',
			verse: '9',
			id: '411',
			reason: ['Ап.Павел о неизъяснимом богатстве благодати Божьей'],
		},
		{
			text: 'Се, скиния Бога с человеками, и Он будет обитать с ними',
			book: 'Откр',
			chapter: '21',
			verse: '3',
			id: '412',
			reason: ['Сам Бог будет обитать с искупленными'],
		},
	    {
			text: 'Ибо те, которые так говорят, показывают, что они ищут отечества',
			book: 'Евр',
			chapter: '11',
			verse: '14',
			id: '413',
			reason: ['В Библии наследие блаженных называется их отечеством'],
		},
    ],
];

const texts2 = [
    [
        {
            text: 'Кто принимает вас, принимает Меня, а кто принимает Меня, принимает Пославшего Меня',
            book: 'Матф',
            chapter: '10',
            verse: '40',
            id: '64',
            reason: [''], //  move to 2nd part
        }, 
        {
            text: 'Полно вам; все общество, все святы, и среди их Господь!',
            book: 'Числ',
            chapter: '16',
            verse: '3',
            id: '52',
            reason: ['Сатана восста'],
        }
    ]
];

const chaptersTitles = [
    'БОГ ОТЕЦ',
    'ДВЕ СТОРОНЫ ХАРАКТЕРА БОГА ОТЦА',
    'СЫН БОЖИЙ',
    'ДУХ БОЖИЙ',
    'АНГЕЛЫ',
    'МИРЫ (ПЛАНЕТЫ) И МИРОЖИТЕЛИ ВСЕЛЕННОЙ',
    'ТВОРЕНИЕ ЗЕМЛИ И ЧЕЛОВЕКА',
    'ЗАКОНЫ ПРИРОДЫ',
    'НРАВСТВЕННЫЙ ЗАКОН БОЖИЙ (ДЕСЯТЬ ЗАПОВЕДЕЙ)',
    'СУББОТА ГОСПОДНЯ',
    'СВОБОДНАЯ ВОЛЯ',
    'ГРЕХОПАДЕНИЕ АНГЕЛОВ',
    'САТАНА И ЗЛЫЕ АНГЕЛЫ',
    'ГРЕХОПАДЕНИЕ ЛЮДЕЙ',
    'ВЕЛИКИЙ ПЛАН СПАСЕНИЯ',
    'ЦАРСТВО БЛАГОДАТИ',
    'СВЕТОВЫЕ ПЕРИОДЫ ЦАРСТВА БЛАГОДАТИ',
    'БИБЛИЯ — СЛОВО БОЖЬЕ',
    'ЦЕРКОВЬ',
    'ЕДИНСТВО. РАЗДЕЛЕНИЕ. УКЛОНЕНИЕ',
    'ДУХОВНЫЕ ДАРЫ',
    'СВЯТИЛИЩЕ ЗЕМНОЕ И НЕБЕСНОЕ',
    '2300 ВЕЧЕРОВ И УТР. СЛЕДСТВЕННЫЙ СУД',
    'ДВА ТЕЧЕНИЯ ЦАРСТВА БЛАГОДАТИ: ВЕРХНЕЕ И НИЖНЕЕ',
    'ТРИ АНГЕЛЬСКИЕ ВЕСТИ',
    'ИНОЙ АНГЕЛ (ЧЕТВЁРТЫЙ)',
    'ВЕСТЬ СВИДЕТЕЛЯ ВЕРНОГО И ИСТИННОГО',
    'УСТАВЫ ВРЕМЕНИ',
    'БРАК',
    'ЗАКОН О ПИЩЕ ЧИСТОЙ И НЕЧИСТОЙ',
    'ГОСУДАРСТВЕННЫЕ ВЛАСТИ',
    'ЗАКОН ПОВЕДЕНИЯ ПЕРЕД ЗЛОУМЫШЛЕННЫМИ',
    'ПРИРОДА ЧЕЛОВЕКА. ДУША. СМЕРТЬ И СОСТОЯНИЕ МЁРТВЫХ',
    'ПОХОРОНЫ',
    'ИЗРАИЛЬ БУКВАЛЬНЫЙ И ДУХОВНЫЙ',
    'СУДЬБА',
    'ИЗБРАНИЕ',
    'ЗАКРЫТИЕ БЛАГОДАТИ И ИЗЛИТИЕ СЕМИ ПОСЛЕДНИХ ЯЗВ',
    'ВТОРОЕ ПРИШЕСТВИЕ ХРИСТА',
    'ЧАСТИЧНОЕ ВОСКРЕСЕНИЕ',
    'ПЕРВОЕ ВОСКРЕСЕНИЕ — ВОСКРЕСЕНИЕ ЖИЗНИ',
    'ТЫСЯЧЕЛЕТНЕЕ ЦАРСТВО',
    'ТРЕТЬЕ ПРИШЕСТВИЕ ХРИСТА. ВТОРОЕ ВОСКРЕСЕНИЕ — ВОСКРЕСЕНИЕ ОСУЖДЕНИЯ. УНИЧТОЖЕНИЕ НЕЧЕСТИВЫХ',
    'НОВОЕ НЕБО И НОВАЯ ЗЕМЛЯ',
]

const bibleBooks = ['Быт', 'Исх', 'Лев', 'Числ', 'Втор', 'Иис.Н', 'Суд', 'Руф', '1Цар', '2Цар', '3Цар', '4Цар', '1Парал', '2Парал', 'Ездр', 'Неем', 'Есф', 'Иов', 'Псал', 'Притч', 'Еккл', 'Песн.п', 'Ис', 'Иер', 'Пл.Иер', 'Иез', 'Дан', 'Ос', 'Иоил', 'Ам', 'Авд', 'Ион', 'Мих', 'Наум', 'Авв', 'Соф', 'Агг', 'Зах', 'Мал', 'Матф', 'Марк', 'Лук', 'Иоан', 'Деян', 'Иак', '1Петр', '2Петр', '1Иоан', '2Иоан', '3Иоан', 'Иуд', 'Римл', '1Кор', '2Кор', 'Гал', 'Еф', 'Фил', 'Кол', '1Фес', '2Фес', '1Тим', '2Тим', 'Тит', 'Филим', 'Евр', 'Откр'];

const similarBooks = [
	['Быт', 'Исх', 'Лев', 'Числ', 'Втор'],
	['Иис.Н', 'Суд', 'Руф', '1Цар', '2Цар', '3Цар', '4Цар', '1Парал', '2Парал', 'Ездр', 'Неем', 'Есф'],
	['Иов', 'Псал', 'Притч', 'Еккл', 'Песн.п'],
	['Ис', 'Иер', 'Пл.Иер', 'Иез'],
	['Дан', 'Ос', 'Иоил', 'Ам', 'Авд', 'Ион', 'Мих', 'Наум', 'Авв', 'Соф', 'Агг', 'Зах', 'Мал'],
	['Матф', 'Марк', 'Лук', 'Иоан', 'Деян', 'Откр'],
	['Иак', '1Петр', '2Петр', '1Иоан', '2Иоан', '3Иоан', 'Иуд', 'Римл', '1Кор', '2Кор', 'Гал', 'Еф', 'Фил', 'Кол', '1Фес', '2Фес', '1Тим', '2Тим', 'Тит', 'Филим', 'Евр']
];

// bibleBooks.forEach(book => {
// 	const similarCollection = similar.find(col => col.includes(book));

// 	const similarBooksArr = [];
// 	similarCollection.forEach(b => {
// 		if (b != book) {
// 			similarBooksArr.push(b);
// 		}
// 	});
// 	similarBooks.push(similarBooksArr);
// })

const max = [
    ['31','25','24','26','32','22','24','22','29','32','32','20','18','24','21','16','27','33','38','18','34','24','20','67','34','35','46','22','35','43','55','32','20','31','29','43','36','30','23','23','57','38','34','34','28','34','31','22','33','26'],
    ['22','25','22','31','23','30','25','32','35','29','10','51','22','31','27','36','16','27','25','26','36','31','33','18','40','37','21','43','46','38','18','35','23','35','35','38','29','31','43','38'],
    ['17','16','17','35','19','30','38','36','24','20','47','8','59','56','33','34','16','30','37','27','24','33','44','23','55','46','34'],
    ['54','34','51','49','31','27','89','26','23','36','35','15','34','45','41','50','13','32','22','29','35','41','30','25','18','65','23','31','39','17','54','42','56','29','34','13'],
    ['46','37','29','49','33','25','26','20','29','22','32','32','18','29','23','22','20','22','21','20','23','30','25','22','19','19','26','68','29','20','30','52','29','12'],
    ['18','24','17','24','16','26','26','35','27','43','23','24','33','15','63','10','18','28','51','9','45','34','16','33'],
    ['36','23','31','24','31','40','25','35','57','18','40','15','25','20','20','31','13','31','30','48','25'],
    ['22','23','18','22'],
    ['28','36','21','22','12','21','17','22','27','27','15','25','23','52','35','23','58','30','24','43','15','23','28','23','44','25','12','25','11','31','13'],
    ['27','32','39','12','25','23','29','18','13','19','27','31','39','33','37','23','29','33','43','26','22','51','39','25'],
    ['53','46','28','34','18','38','51','66','28','29','43','33','34','31','34','34','24','46','21','43','29','53'],
    ['18','25','27','44','27','33','20','29','37','36','21','21','25','29','38','20','41','37','37','21','26','20','37','20','30'],
    ['54','55','24','43','26','81','40','40','44','14','47','40','14','17','29','43','27','17','19','8','30','19','32','31','31','32','34','21','30'],
    ['17','18','17','22','14','42','22','18','31','19','23','16','22','15','19','14','19','34','11','37','20','12','21','27','28','23','9','27','36','27','21','33','25','33','27','23'],
    ['11','70','13','24','17','22','28','36','15','44'],
    ['11','20','32','23','19','19','73','18','38','39','36','47','31'],
    ['22','23','15','17','14','14','10','17','32','3'],
    ['22','13','26','21','27','30','21','22','35','22','20','25','28','22','35','22','16','21','29','29','34','30','17','25','6','14','23','28','25','31','40','22','33','37','16','33','24','41','35','27','26','17'],
    ['6','12','9','9','13','11','18','10','39','7','9','6','7','5','11','15','51','15','10','14','32','6','10','22','12','14','9','11','13','25','11','22','23','28','13','40','23','14','18','14','12','5','27','18','12','10','15','21','23','21','11','7','9','24','14','12','12','18','14','9','13','12','11','14','20','8','36','37','6','24','20','28','23','11','13','21','72','13','20','17','8','19','13','14','17','7','19','53','17','16','16','5','23','11','13','12','9','9','5','8','29','22','35','45','48','43','14','31','7','10','10','9','26','9','10','2','29','176','7','8','9','4','8','5','6','5','6','8','8','3','18','3','3','21','26','9','8','24','14','10','7','12','15','21','10','11','9','14','9','6'],
    ['33','22','35','27','23','35','27','36','18','32','31','28','25','35','33','33','28','24','29','30','31','29','35','34','28','28','27','28','27','33','31'],
    ['18','26','22','17','19','12','29','17','18','20','10','14'],
    ['16','17','11','16','16','12','14','14'],
    ['31','22','25','6','30','13','25','22','21','34','16','6','22','32','9','14','14','7','25','6','17','25','18','23','12','21','13','29','24','33','9','20','24','17','10','22','38','22','8','31','29','25','28','28','25','13','15','22','26','11','23','15','12','17','13','12','21','14','21','22','11','12','19','12','25','24'],
    ['19','37','25','31','31','30','34','22','26','25','23','17','27','22','21','21','27','23','15','18','14','30','40','10','38','24','22','17','32','24','40','44','26','22','19','32','21','28','18','16','18','22','13','30','5','28','7','47','39','46','64','34'],
    ['22','22','66','22','22'],
    ['28','10','27','17','17','14','27','18','11','22','25','28','23','23','8','63','24','32','14','49','32','31','49','27','17','21','36','26','21','26','18','32','33','31','15','38','28','23','29','49','26','20','27','31','25','24','23','35'],
    ['21','49','33','34','31','28','28','27','27','21','45','13'],
    ['11','23','5','19','15','11','16','14','17','15','12','14','15','10'],
    ['20','32','21'],
    ['15','16','15','13','27','14','17','14','15'],
    ['21'],
    ['16','11','10','11'],
    ['16','13','12','13','15','16','20'],
    ['15','13','19'],
    ['17','20','19'],
    ['18','15','20'],
    ['15','23'],
    ['21','13','10','14','11','15','14','23','17','12','17','14','9','21'],
    ['14','17','18','6'],
    ['25','23','17','25','48','34','29','34','38','42','30','50','58','36','39','28','27','35','30','34','46','46','39','51','46','75','66','20'],
    ['45','28','35','41','43','56','37','38','50','52','33','44','37','72','47','20'],
    ['80','52','38','44','39','49','50','56','62','42','54','59','35','35','32','31','37','43','48','47','38','71','56','53'],
    ['51','25','36','54','47','71','53','59','41','42','57','50','38','31','27','33','26','40','42','31','25'],
    ['26','47','26','37','42','15','60','40','43','48','30','25','52','28','41','40','34','28','40','38','40','30','35','27','27','32','44','31'],
    ['27','26','18','17','20'],
    ['25','25','22','19','14'],
    ['21','22','18'],
    ['10','29','24','21','21'],
    ['13'],
    ['15'],
    ['25'],
    ['32','29','31','25','21','23','25','39','33','21','36','21','14','26','33','24'],
    ['31','16','23','21','13','20','40','13','27','33','34','31','13','40','58','24'],
    ['24','17','18','18','21','18','16','24','15','18','32','21','13'],
    ['24','21','29','31','26','18'],
    ['23','22','21','32','33','24'],
    ['30','30','21','23'],
    ['29','23','25','18'],
    ['10','20','13','18','28'],
    ['12','17','18'],
    ['20','15','16','16','25','21'],
    ['18','26','17','22'],
    ['16','15','15'],
    ['24'],
    ['14','18','19','16','14','20','28','13','28','39','40','29','25'],
    ['20','29','22','11','14','17','17','13','21','11','19','17','18','20','8','21','18','24','21','15','27','21']
];

let mixedSelection;

const properFont = function(string) {
    const testCont = document.createElement('div');
    testCont.id = 'test';
    testCont.innerHTML = string;
    document.getElementById('main').appendChild(testCont);
    let curWidth = parseInt(testCont.clientWidth);
    let curFontSize = 26;
    let maxWidthAllowed = window.innerWidth*0.8 - 18 - 6; // 9 - padding, 3 - border
    
    // debugger;
    while (curWidth > maxWidthAllowed) {
        curFontSize--
        testCont.style.fontSize = `${curFontSize}px`;
        curWidth = parseInt(testCont.clientWidth);
    }

    testCont.remove();
    // console.log(`${curFontSize}px`)
    return `${curFontSize}px`;
};

// const getDefaultFontSize = () => {
//     const element = document.createElement('div');
//     element.style.width = '1rem';
//     element.style.display = 'none';
//     document.body.append(element);

//     const widthMatch = window
//         .getComputedStyle(element)
//         .getPropertyValue('width')
//         .match(/\d+/);

//     element.remove();

//     if (!widthMatch || widthMatch.length < 1) {
//         return null;
//     }

//     const result = Number(widthMatch[0]);
//     return !isNaN(result) ? result : null;
// };

// const getSimilar = function(el, arr, num) {
//     let sameBookArr = arr.filter((curEl) => curEl.book == el.book);
//     let sameChapterArr = arr.filter((curEl) => curEl.chapter == el.chapter);
//     let sameVerseArr = arr.filter((curEl) => curEl.verse == el.verse);
//     let resultArr = [];
//     sameBookArr.forEach(element => {
//         resultArr.push(element);
//     });
//     sameChapterArr.forEach(element => {
//         resultArr.push(element);
//     });
//     sameVerseArr.forEach(element => {
//         resultArr.push(element);
//     });
//     let idsArr = [];
//     resultArr.forEach(el => {
//         if (idsArr.indexOf(el.id) == -1) {
//             idsArr.push(el.id)
//         }
//     })
//     let twoArr = [];
//     let threeArr = [];
//     idsArr.forEach(el => {
//         if (idsArr.filter(el).length > 1) {
//             twoArr.push(sameVerseArr.find(element => element.id == el));
//         } else if (idsArr.filter(el).length > 2) {
//             threeArr.push(sameVerseArr.find(element => element.id == el));
//         }
//     })
//     if (num == 2) {
//         return twoArr;
//     } else if (num == 3) {
//         return threeArr;
//     }
// }; 

const getSimilar = function(el, arr) {
    // debugger;
    let sameBookArr = arr.filter((curEl) => curEl.book == el.book);
    // let sameChapterArr = arr.filter((curEl) => curEl.chapter == el.chapter);
    // let sameVerseArr = arr.filter((curEl) => curEl.verse == el.verse);
    let resultArr = [];
    sameBookArr.forEach(element => {
        resultArr.push(element);
    });
    // sameChapterArr.forEach(element => {
    //     resultArr.push(element);
    // });
    // sameVerseArr.forEach(element => {
    //     resultArr.push(element);
    // });
    let idsArr = [];
    resultArr.forEach(element => {
        if (idsArr.indexOf(element.id) == -1) {
            idsArr.push(element.id)
        }
    })
    let ind = idsArr.indexOf(el.id);
    idsArr.splice(ind, 1);

    return idsArr;
}; 

const getRandom = function(max) {
    let rand = 1 + Math.random() * max;
    return Math.floor(rand);
};

const shuffle = function(array) {
    let currentIndex = array.length, randomIndex;
    while (currentIndex > 0) {
      randomIndex = Math.floor(Math.random() * currentIndex);
      currentIndex--;
      [array[currentIndex], array[randomIndex]] = [array[randomIndex], array[currentIndex]];
    }  
    return array;
}

const getCurrentSelection = function(chaptersArr) {
    const currentSelection = [];
    chaptersArr.forEach(element => {
        texts[element - 1].forEach(text => {
            currentSelection.push(text);
        })
    })
    mixedSelection = shuffle(currentSelection);
};

// getCurrentSelection([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]);

const remove = function (el, arr) {
    let elToRemove = arr.find(element => element.id == el.id);
    if (elToRemove) {
        let index = arr.indexOf(elToRemove);
        arr.splice(index, 1);    
    }
}

const arrContains = function (el, arr) {
    let check = arr.find(element => element.id == el.id);
    let result = check ? true : false;
    return result;
}

const getElByID = function (el, arr) {
    let result = arr.find(element => element.id == el.id);
    if (result) {
        return result;
    } else {
        return undefined;
    }
}

const getAnyEl = function(arr) {
    const random = Math.floor(Math.random() * arr.length);
    return arr[random];
}

const mixColors = function (colorOld, colorNew, percentage) {
    const resultObj = {
        r: 0,
        g: 0,
        b: 0,
    };

    const colors = {
        blanchedalmond: {
            r: 255,
            g: 235,
            b: 205,
        },
    
        darkslategrey: {
            r: 47,
            g: 79,
            b: 79,
        },
    
        darkseagreen: {
            r: 143,
            g: 188,
            b: 143,
        },
    
        lightcoral: {
            r: 240,
            g: 128,
            b: 128,
        },
    
        gold: {
            r: 255,
            g: 215,
            b: 0,
        },
    };

    ['r', 'g', 'b'].forEach(letter => {
        if (colors[colorOld][letter] == colors[colorNew][letter]) {
            resultObj[letter] = colors[colorOld][letter]
        } else {
            let average = Math.round(colors[colorOld][letter] + (colors[colorNew][letter] - colors[colorOld][letter])*percentage);
            let [min, max] = [0, 0];
            if (colors[colorOld][letter] > colors[colorNew][letter]) {
                max = colors[colorOld][letter];
                min = colors[colorNew][letter];
            } else {
                max = colors[colorNew][letter];
                min = colors[colorOld][letter];
            }
            if (average > max) {
                resultObj[letter] = max;
            } else if (average < min) {
                resultObj[letter] = min;
            } else {
                resultObj[letter] = average;
            }
        }
    
    });

    // resultObj.r = Math.round(colors[colorOld].r + (colors[colorNew].r - colors[colorOld].r)*percentage);
    // resultObj.g = Math.round(colors[colorOld].g + (colors[colorNew].g - colors[colorOld].g)*percentage);
    // resultObj.b = Math.round(colors[colorOld].b + (colors[colorNew].b - colors[colorOld].b)*percentage);

    // console.log(`rgb(${resultObj.r},${resultObj.g},${resultObj.b})`);
    return `rgb(${resultObj.r},${resultObj.g},${resultObj.b})`;
}

// const allowDrop = function(event) {
//     console.log('allowDrop');
//     event.preventDefault();
//     event.stopPropagation();
// }

const pointsText = function(points) {
    let string = Math.abs(points).toString();
    let lastTwo = string.substring(string.length - 2);
    let lastOne = string.substring(string.length - 1);
    if (lastTwo == '11' || lastTwo == '12' || lastTwo == '13' || lastTwo == '14') {
        return 'баллов';
    } else if (lastOne == '1') {
        return 'балл';
    } else if (lastOne == '2' || lastOne == '3' || lastOne == '4') {
        return 'балла';
    } else {
        return 'баллов';
    }
}

const mainMenu = {
    user: {
        name: localStorage.getItem('name') ? localStorage.getItem('name') : '',
        setName: function(name) {
            this.name = name;
        },
        getName: function() {
            return this.name;
        },

        mode: 'training',

        currentView: 'initial',

        chapters: localStorage.getItem('chapters') ? JSON.parse(localStorage.getItem('chapters')) : '',
        setChapters: function(arr) {
            this.chapters = arr;
            localStorage.setItem('chapters', JSON.stringify(arr));
        },
        getChapters: function() {
            let arr = [];
            this.chapters.forEach(el => {
                if (el.substring(0,2) == 'f_') {
                    arr.push(parseInt(el.slice(2)));
                }
            })
            getCurrentSelection(arr);
        },
        getFlags: function() {
            let boxes = document.getElementsByClassName('form-check-input');
            let arr = [];
            [...boxes].forEach(el => {
                if (el.checked) {
                    arr.push(el.getAttribute('id'));
                }
            });
            this.setChapters(arr);
        },
        setFlags: function() {
            let boxes = document.getElementsByClassName('form-check-input');
            [...boxes].forEach(box => {
                if (this.chapters.includes(box.getAttribute('id'))) {
                    box.checked = true;
                } else {
                    box.checked - false;
                }
            });
        },
        displayChapters: function() {
            let text = '';
            let currPrefix = '';
            let currChapter = '';
            let range = false;
            let arr = this.chapters;
            arr.forEach((id, ind) => {
                if (['fund1', 'fund2'].includes(id)) {
                    return;
                }
                if (id.substring(0, 2) != currPrefix) {
                    currChapter = '';
                    currPrefix = id.substring(0, 2);
                    if (currPrefix == 'f_') {
                        text += 'Основы Истины I,';
                    }
                    if (arr[ind + 1] && (currPrefix == arr[ind + 1].substring(0, 2))) {
                        text += ' пункты ';
                    } else {
                        text += ' пункт ';
                    }
                    currChapter = id.slice(2);
                    text += currChapter;
                } else {
                    if (parseInt(currChapter) + 1 == parseInt(id.slice(2))) {
                        range = true;
                        if (text.slice(-1) != '-') {
                            text += '-';
                        }
                        if (arr[ind + 1]) {
                            if (parseInt(id.slice(2)) + 1 == parseInt(arr[ind + 1].slice(2))) {
                                currChapter = id.slice(2);
                            } else {
                                text += `${id.slice(2)}, `;    
                            }
                        } else {
                            text += id.slice(2);
                        }
                    } else {
                        if (text.slice(-2) != ', ') {
                            text += ', ';
                        }
                        text += id.slice(2);
                        currChapter = id.slice(2);
                    }
                }
            });

            return text;
        },
    },

    transition: false,

    pending: null,

    renderButtons: function() {
        const btnsContainer = document.getElementsByClassName('btnsContainer')[0];
        btnsContainer.innerHTML = '';
        if (this.user.mode == 'training') {
            ['Карточки', 'Хронология', 'По книгам', 'Викторины', 'Подбор'].forEach(function(title) {
                const button = document.createElement('button');
                button.classList.add('menuBtn');
                button.innerHTML = title;
                btnsContainer.appendChild(button);
            })
            // main.appendChild(btnsContainer);
    
            const buttons = [...btnsContainer.childNodes];
            [1].forEach(function(num) {
                buttons[num].style.opacity = '0.5';
            })
    
            buttons[0].addEventListener('click', function(event) {
                studyGame.start();
            })
    
            buttons[2].addEventListener('click', function(event) {
                booksGame.start();
            })        
    
            buttons[3].addEventListener('click', function(event) {
                quizGame.start();
            })        
    
            buttons[4].addEventListener('click', function(event) {
                matchGame.start();
            })
        } else if (this.user.mode == 'study') {
            ['Уроки', 'Книга', 'Глава', 'Стих', 'Текст', 'Значение'].forEach(function(title, i) {
                const button = document.createElement('button');
                if (i == 0) {
                    const lessonContMainMenu = document.createElement('div');
                    lessonContMainMenu.classList.add('lessonContMainMenu');
                    const lesson = document.createElement('img');
                    lesson.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/person-chalkboard-solid.svg');
                    lesson.classList.add('svgBtn');
                    lessonContMainMenu.appendChild(lesson);
                    
                    button.appendChild(lessonContMainMenu);
                } else {
                    const symbCont = document.createElement('div');
                    symbCont.classList.add('symbCont');

                    const explSymb = document.createElement('div');
                    explSymb.classList.add('explSymb');
                    symbCont.appendChild(explSymb);

                    const bookSymb = document.createElement('div');
                    bookSymb.classList.add('bookSymb');
                    symbCont.appendChild(bookSymb);

                    const fillerSymb = document.createElement('div');
                    fillerSymb.classList.add('fillerSymb');

                    const filler1 = fillerSymb.cloneNode(true);
                    filler1.innerHTML = '.';
                    symbCont.appendChild(filler1);

                    const chapterSymb = document.createElement('div');
                    chapterSymb.classList.add('chapterSymb');
                    symbCont.appendChild(chapterSymb);

                    const filler2 = fillerSymb.cloneNode(true);
                    filler2.innerHTML = ':';
                    symbCont.appendChild(filler2);

                    const verseSymb = document.createElement('div');
                    verseSymb.classList.add('verseSymb');
                    symbCont.appendChild(verseSymb);

                    const filler3 = fillerSymb.cloneNode(true);
                    filler3.innerHTML = ': ';
                    symbCont.appendChild(filler3);

                    const textSymb = document.createElement('div');
                    textSymb.classList.add('textSymb');
                    symbCont.appendChild(textSymb);

                    button.appendChild(symbCont);
                }
                button.classList.add('menuBtn2');
                const desc = document.createElement('div');
                desc.classList.add('desc');
                desc.innerHTML = title;
                button.appendChild(desc);
                btnsContainer.appendChild(button);
            })

            const buttons = [...btnsContainer.childNodes];

            buttons.forEach(function(button, i) {
                if (i == 1) {
                    button.getElementsByClassName('bookSymb')[0].style.opacity = '1';
                } else if (i == 2) {
                    button.getElementsByClassName('chapterSymb')[0].style.opacity = '1';
                } else if (i == 3) {
                    button.getElementsByClassName('verseSymb')[0].style.opacity = '1';
                } else if (i == 4) {
                    button.getElementsByClassName('textSymb')[0].style.opacity = '1';
                } else if (i == 5) {
                    button.getElementsByClassName('explSymb')[0].style.opacity = '1';
                } 
            });

            buttons[0].addEventListener('click', function(event) {
                lessons.start();
            });
			buttons[1].addEventListener('click', function(event) {
                bookStudy.start();
            });
        }
    },

	addPendingEl: function() {
		[...document.getElementsByClassName('menuBtn2')].forEach((el, i) => {
			if (i > 0) {
				let pending = false;
				const lessonsObj = lessons.selected.lessons.inProgress[0];
				lessonsObj.forEach(lessonObj => {
					for (const index in lessonObj.verses) {
						if (pending) {
							return;
						}
						let paramInd = 0;
						for (const param in lessonObj.verses[index]) {
							if (paramInd == i - 1) {
								if (!lessonObj.verses[index][param].done) {
									pending = true;
									return;
								}
							}
							paramInd++;
						}
					} 
				})
				// debugger;
				if (pending) {
					const pendingEl = document.createElement('div');
					pendingEl.classList.add('pendingEl');
					el.appendChild(pendingEl);
				}
			}
		})
	},

    renderMenu: function() {
        const main = document.getElementById('main');
        main.innerHTML = '';
        const topNameCont = document.createElement('div');
        topNameCont.classList.add('topNameCont');
        const nameCont = document.createElement('div');
        nameCont.classList.add('nameCont');
        const name = document.createElement('p');
        name.innerHTML = this.user.getName();
        nameCont.appendChild(name);
        const chevronCont = document.createElement('div');
        chevronCont.classList.add('chevronCont');
        const chevron = document.createElement('img');
        chevron.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/circle-chevron-down.svg');
        chevron.classList.add('svg');
        chevronCont.appendChild(chevron);
        topNameCont.appendChild(nameCont);
        topNameCont.appendChild(chevronCont);
        main.appendChild(topNameCont);

        const bottomCont = document.createElement('div');
        bottomCont.classList.add('bottomCont');
        const settingsCont = document.createElement('div');
        settingsCont.classList.add('settingsCont');
        const gear = document.createElement('img');
        gear.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/gear-solid.svg');
        gear.classList.add('svg');
        settingsCont.appendChild(gear);
        bottomCont.appendChild(settingsCont);
        main.appendChild(bottomCont);

        const trainCard = document.createElement('div');
        trainCard.classList.add('trainCard');
        const dumbbell = document.createElement('img');
        dumbbell.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/dumbbell-solid.svg');
        dumbbell.classList.add('svg');
        dumbbell.style.width = '30vw';
        dumbbell.style.height = '30vw';
        trainCard.appendChild(dumbbell);
        const trainText = document.createElement('p');
        trainText.classList.add('description')
        trainText.innerText = 'Тренировка';
        trainCard.appendChild(trainText);

        const studyCard = document.createElement('div');
        studyCard.classList.add('studyCard');
        const studyText = document.createElement('p');
        const brain = document.createElement('img');
        brain.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/brain-solid.svg');
        brain.classList.add('svg');        
        brain.style.width = '30vw';
        brain.style.height = '30vw';
        studyCard.appendChild(brain);
        studyText.classList.add('description')
        studyText.innerText = 'Изучение';
        studyCard.appendChild(studyText);

        [trainCard, studyCard].forEach(el => bottomCont.appendChild(el)); //cadetblue

        const checkedCont = document.createElement('div');
        checkedCont.classList.add('checkedCont');
        const checkmark = document.createElement('img');
        checkmark.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/circle-check-solid.svg');
        checkmark.classList.add('svg');
        checkedCont.appendChild(checkmark);
        
        this.user.mode == 'training' ? trainCard.appendChild(checkedCont) : studyCard.appendChild(checkedCont);

        const self = this;
        studyCard.addEventListener('click', function(e) {
            if (!studyCard.contains(checkedCont)) {
                self.user.mode = 'study';
                trainCard.removeChild(checkedCont);
                studyCard.appendChild(checkedCont);
                main.style.backgroundColor = 'cadetblue';
                btnsContainer.style.alignContent = 'flex-start';
                self.renderButtons();
                setTimeout(function() {
                    settingsCont.click();
                }, 300);
            }
        });

        trainCard.addEventListener('click', function(e) {
            if (!trainCard.contains(checkedCont)) {
                self.user.mode = 'training';
                studyCard.removeChild(checkedCont);
                trainCard.appendChild(checkedCont);
                main.style.backgroundColor = '';
                btnsContainer.style.alignContent = '';
                self.renderButtons();
                setTimeout(function() {settingsCont.click()}, 300);
            }
        });

        const list = document.createElement('div');
        list.classList.add('chaptersList');
        const fundListCont = document.createElement('div');
        fundListCont.classList.add('fundListCont');
        list.appendChild(fundListCont);

        const bookTitle = document.createElement('div');
        bookTitle.classList.add('chapter');
        bookTitle.classList.add('title');
        bookTitle.classList.add('form-check');
        const inp = document.createElement('input');
        inp.classList.add('form-check-input');
        inp.classList.add('shadow-none');
        inp.setAttribute('type', 'checkbox');
        inp.setAttribute('id', 'fund1');
        bookTitle.appendChild(inp);
        inp.addEventListener('change', function(e) {
            let listWithTitle = [...document.getElementsByClassName('chapter')];
            let chaptersOnly = listWithTitle.slice(1);
            let checkboxStatus = inp.checked;
            chaptersOnly.forEach(chapter => {
                if (chapter.getElementsByTagName('input')[0].checked != checkboxStatus) {
                    chapter.getElementsByTagName('input')[0].checked = checkboxStatus;
                }
            })
        });

        let lab = document.createElement('label');
        lab.classList.add('form-check-label');
        lab.setAttribute('for', 'fund1');
        lab.innerHTML = 'ОСНОВЫ ИСТИНЫ I'
        bookTitle.appendChild(lab);

        fundListCont.appendChild(bookTitle);

        let len = texts.length;
        while (len > 0) {
            let cont = document.createElement('div')
            cont.classList.add('chapter');
            cont.classList.add('form-check');
            let input = document.createElement('input');
            input.classList.add('form-check-input');
            input.classList.add('shadow-none');
            input.setAttribute('type', 'checkbox');
            input.setAttribute('id', `f_${chaptersTitles.length - len + 1}`);
            cont.appendChild(input);

            let label = document.createElement('label');
            label.classList.add('form-check-label');
            label.setAttribute('for', `f_${chaptersTitles.length - len + 1}`);
            label.innerHTML = `${chaptersTitles[chaptersTitles.length - len]}`
            cont.appendChild(label);

            fundListCont.appendChild(cont);

            len--;
        }
        topNameCont.appendChild(list);

        const profileCont = document.createElement('div');
        profileCont.classList.add('profileCont');
        const photo = document.createElement('img');
        photo.classList.add('avatar');
        if (this.user.getName() == 'midea13') {
            photo.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/thumbnails%2Fmidea13.jpg')
        } else if (this.user.getName() == 'Yuriy') {
            photo.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/thumbnails%2Fyuriy.jpg')
        } else {
            photo.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/thumbnails%2Funknown2.jpg')
        }
        profileCont.appendChild(photo);
        topNameCont.appendChild(profileCont);

        const btnsContainer = document.createElement('div');
        btnsContainer.classList.add('btnsContainer');
        main.appendChild(btnsContainer);
        this.renderButtons();

        chevronCont.addEventListener('click' ,function(event) {
            if (topNameCont.style.height == '100%') {
                mainMenu.user.getFlags();
                topNameCont.style.height = '45px';
                profileCont.style.width = '58px';
                profileCont.style.transform = '';
                profileCont.style.top = '5px';
                profileCont.style.left = '5px';
                photo.style.borderWidth = '3px';
                nameCont.style.top = '3px';
                nameCont.style.left = '45px';
                nameCont.style.transform = '';

                bottomCont.style.setProperty('height', '');
                settingsCont.style.setProperty('bottom', '');
                const backCont = document.getElementsByClassName('backCont')[0];
                if (backCont) {backCont.style.setProperty('bottom', '')};

                setTimeout(function(){
                    chevron.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/circle-chevron-down.svg');
                    document.getElementsByClassName('chaptersList')[0].scrollTop = 0;
                }, 500)
            } else {
                mainMenu.user.setFlags();
                topNameCont.style.height = '100%';
                profileCont.style.width = '50%';
                profileCont.style.transform = 'translate(-30%, 0%)';
                profileCont.style.top = '15px';
                profileCont.style.left = '50%';
                photo.style.borderWidth = '4px';
                nameCont.style.top = 'calc(33vw + 5px)';
                nameCont.style.left = '50%';
                nameCont.style.transform = 'translate(-50%, 0px)';

                bottomCont.style.setProperty('height', '0px');
                settingsCont.style.setProperty('bottom', '-40px');
                const backCont = document.getElementsByClassName('backCont')[0];
                if (backCont) {backCont.style.setProperty('bottom', '-40px')};

                setTimeout(function(){
                    chevron.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/circle-chevron-up.svg');
                }, 500)
            }
        });

        settingsCont.addEventListener('click', function(event){
            gear.style.setProperty('animation', 'spin 0.5s infinite linear');
            if (bottomCont.style.height == '100%') {
                bottomCont.style.height = '45px';

                topNameCont.style.setProperty('height', '');
                nameCont.style.setProperty('top', '');
                profileCont.style.setProperty('top', '');

                setTimeout(function(){
                    gear.style.setProperty('animation', '');
                }, 500)
            } else {
                bottomCont.style.height = '100%';
                topNameCont.style.setProperty('height', '0px');
                nameCont.style.setProperty('top', '-40px');
                profileCont.style.setProperty('top', '-40px');

                setTimeout(function(){
                    gear.style.setProperty('animation', '');
                }, 500)
            }
        });

    },

    renderInitialPage: function() {
        let self = this;
        if (localStorage.getItem('name')) {
            this.renderMenu();
            this.renderBackButton();
            this.hideBackButton();
        } else {
            document.getElementById('nameForm').addEventListener('submit', function(event) {
                event.preventDefault();
                localStorage.setItem('name', document.getElementById('nameInputText').value);
                self.user.setName(localStorage.getItem('name'));
                let div = document.getElementsByClassName('formContainer')[0];
                div.innerHTML = '';

                let h2 = document.createElement('h2');
                h2.innerHTML = `${self.user.getName()}, рады приветствовать в DailyReadings!`;
                div.appendChild(h2);

                let button = document.createElement('button');
                button.classList.add('initial');
                button.innerHTML = 'Продолжить';
                div.appendChild(button);
                button.addEventListener('click', function() {
                    self.renderMenu();
                })

            })
        }
    },

    renderBackButton: function() {
        const self = this;
        const bottomCont = document.getElementsByClassName('bottomCont')[0];
        const backCont = document.createElement('div');
        backCont.classList.add('backCont');
        const chevron = document.createElement('img');
        chevron.setAttribute('src', 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/circle-chevron-left.svg');
        chevron.classList.add('svg');
        backCont.appendChild(chevron);
        bottomCont.appendChild(backCont);

        backCont.addEventListener('click', function() {
            if (self.transition) {
                if (self.pending) {
                    clearInterval(self.pending);
                    self.pending = null;
                }
                self.pending = setInterval(function() {
					// debugger;
                    if (!self.transition) {
                        clearInterval(self.pending);
                        self.pending = null;
                        self.back();
                    }
                }, 100)
            } else {
                self.back();
            }
        });
    },

    hideBackButton: function() {
        const backCont = document.getElementsByClassName('backCont')[0];
        backCont.style.opacity = '0';
        setTimeout(function() {backCont.style.display = 'none'}, 500);
    },

    showBackButton: function() {
        const backCont = document.getElementsByClassName('backCont')[0];
        setTimeout(function() {backCont.style.display = 'block'}, 0);
        setTimeout(function() {backCont.style.opacity = '1'}, 1);
    },

    back: function() {
        const self = this;
        if (!self.transition) {
            self.transition = true;
        }

        if (this.user.currentView == 'sections' || this.user.currentView == 'books') {
			// console.log('im here!');
			const overlappingCont = this.user.currentView == 'sections' ? document.querySelector('.overlappingCont') : document.querySelector('.overlappingCont2');
            self.user.currentView = 'initial';
			self.addPendingEl();
            self.hideBackButton();
            setTimeout(function() {
                overlappingCont.innerHTML = '';
                overlappingCont.style.width = '';
                overlappingCont.style.height = '';
                overlappingCont.style.borderRadius = '';
                overlappingCont.style.top = '';
                overlappingCont.style.left = '';
                overlappingCont.style.margin = '';
                overlappingCont.style.opacity = '0';
    
                [...document.getElementsByClassName('sectionBtn')].forEach(btn => btn.opacity = '0'); 
    
                setTimeout(function() {
                    overlappingCont.remove();
                    self.transition = false;
                }, 300);
            }, 0);
        } else if (this.user.currentView == 'lessons') {
            self.user.currentView = 'sections';
            const overlappingCont = document.querySelector('.overlappingCont');
            const needToScroll = overlappingCont.scrollTop == 0 ? false : true;
            
            if (needToScroll) {
                overlappingCont.scrollTo({top: 0, behavior: 'smooth'});
            }

            setTimeout(function() {
                document.querySelector('.selectedSectionTitle').style.opacity = '0';
                document.querySelector('.lessonsCont').style.opacity = '0';
                const clonedImgCont = document.querySelector('.clonedImgCont');
                
                setTimeout(function() {
                    document.getElementsByClassName('selectedSectionTitle')[0].remove();
                    document.getElementsByClassName('lessonsCont')[0].remove();
                    lessons.renderSections(false);
                    clonedImgCont.style.top = '';
                    clonedImgCont.style.left = '';
                    clonedImgCont.style.width = '';
                    
                    setTimeout(function() {
                        clonedImgCont.style.opacity = '0'
                        
                        setTimeout(function() {
                            clonedImgCont.remove();
                            self.transition = false;
                        }, 300);
                    }, 300);
                }, 300)
            }, needToScroll * 300)
        } else if (this.user.currentView == 'lesson') {
            self.user.currentView = 'lessons';
            const overlappingCont = document.querySelector('.overlappingCont');
            const needToScroll = overlappingCont.scrollTop == 0 ? false : true;

            overlappingCont.scrollTo({top: 0, behavior: 'smooth'});

            setTimeout(function() {
                lessons.renderLessons(false, lessons.params.lastSectionOpened);
            }, needToScroll * 300);
        };
    },
}

mainMenu.renderInitialPage();

const matchGame = {
    currentState: {
        texts: {
            readyToUse: [],
            recentlyUsed: [],
            archive: [],
            reset: function() {
                this.readyToUse = [];
                this.recentlyUsed = [];
                this.archive = [];
                this.preView.links = [];
                this.preView.texts = [];
                this.currentView.links = [];
                this.currentView.texts = [];
            },
            moveToRecentlyUsed: function(el) {
                this.recentlyUsed.push(el);
                remove(el, this.readyToUse);
                remove(el, this.currentView.links);
                remove(el, this.currentView.texts);
                if (this.recentlyUsed.length == 3) {
                    this.shiftToArchive();
                }
                if (this.readyToUse.length == 2) {
                    this.refill();
                }
            },
            nextStep: function(size, el) {
                this.moveToRecentlyUsed(el);
                let linksView = this.currentView.links;
                let textsView = this.currentView.texts;
                let linksPre = this.preView.links;
                let textsPre = this.preView.texts;
                if (size == 4) {
                    let anyLink = getAnyEl(linksView);

                    let len = anyLink.similar.length;
                    while (len > 0 && linksView.length < 3) {
                        let searchResult = linksPre.find(element => element.id == anyLink.similar[len - 1]);
                        if (searchResult) {
                            linksView.push(searchResult);
                            remove(searchResult, linksPre);
                        }
                        len--
                    }

                    while (linksView.length < 3) {
                        let newEl = getAnyEl(linksPre);
                        linksView.push(newEl);
                        remove(newEl, linksPre);
                    }            
                    
                    let textToAdd = getElByID(anyLink, textsPre);
                    textsView.push(textToAdd);
                    remove(textToAdd, textsPre);
                } else {
                    let anyLink = getAnyEl(linksPre);
                    linksView.push(anyLink);
                    remove(anyLink, linksPre);

                    let anyText = getAnyEl(textsPre);
                    textsView.push(anyText);
                    remove(anyText, textsPre);
                }
            },
            shiftToArchive: function() {
                const removed = this.recentlyUsed.splice(1, 1);
                this.archive.push(removed[0]);
            },
            refill: function() {
                this.archive = shuffle(this.archive);
                this.archive.forEach(el => {
                    this.readyToUse.push(el);
                    this.preView.texts.push(el);
                    this.preView.links.push(el);
                });
                this.archive = [];
            },
            preView: {
                texts: [],
                links: [],
            },
            currentView: {
                texts: [],
                links: [],
            },
        },
        setInitialState: function() {
            let self = this;
            mixedSelection.forEach((el) => {
                el.similar = [];
                let similarTextsArr = getSimilar(el, mixedSelection);
                if (similarTextsArr.length > 0) {
                    similarTextsArr.forEach(element => {                        
                        el.similar.push(element);
                    })
                }
                self.texts.readyToUse.push(el);
                self.texts.preView.texts.push(el);
                self.texts.preView.links.push(el);
            })

            let curEl = self.texts.readyToUse[0];
            let linksView = self.texts.currentView.links;
            let textsView = self.texts.currentView.texts;
            let linksPre = self.texts.preView.links;
            let textsPre = self.texts.preView.texts;
            linksView.push(curEl);
            remove(curEl, linksPre);
            textsView.push(curEl);
            remove(curEl, textsPre);
    
            let len = curEl.similar.length;
            while (len > 0 && linksView.length < 3) {
                let searchResult = linksPre.find(element => element.id == curEl.similar[len - 1]);
                if (searchResult) {
                    linksView.push(searchResult);
                    remove(searchResult, linksPre);
                }
                len--
            }

            while (linksView.length < 3) {
                let newEl = getAnyEl(linksPre);
                linksView.push(newEl);
                remove(newEl, linksPre);
            }            
            
            while (textsView.length < 3) {
                let newEl = getAnyEl(textsPre);
                textsView.push(newEl);
                remove(newEl, textsPre);
            }
        },
    },

    points: {
        currentState: 0,
        render: function() {
            let div = document.createElement('div');
            div.classList.add('counter');
            div.setAttribute('id', 'counter');
            document.getElementById('main').appendChild(div);
            div.innerHTML = this.currentState;
        },
        update: function(bool) {
            if (bool) {
                this.currentState++
            } else {
                this.currentState--
            }
            let div = document.getElementById('counter');
            div.innerHTML = this.currentState;
        },
        reset: function() {
            this.currentState = 0;
        },
    },

    timer: {
        currentState: 120,
        render: function() {
            let self = this;
            let div = document.createElement('div');
            div.classList.add('timer');
            div.setAttribute('id', 'timer');
            document.getElementById('main').appendChild(div);
            div.innerHTML = self.currentState;
            const timer = setInterval(function() {
                self.currentState--;
                div.innerHTML = self.currentState;
                if (self.currentState === 0) {
                    clearInterval(timer);
                    matchGame.result.render();
                }
            }, 1000);
        },
        reset: function() {
            this.currentState = 120;
        },
    },

    result: {
        render: function() {
            const modal = document.createElement('div');
            modal.classList.add('modal');
            modal.classList.add('fade');
            modal.setAttribute('data-bs-backdrop', 'static');
            modal.setAttribute('data-bs-keyboard', 'false');
            
            modal.setAttribute('tabindex', '-1');
            
            const dialog = document.createElement('div');
            dialog.classList.add('modal-dialog');
            dialog.classList.add('modal-dialog-centered');
            modal.appendChild(dialog);

            const content = document.createElement('div');
            content.classList.add('modal-content');
            dialog.appendChild(content);

            const body = document.createElement('div');
            body.classList.add('modal-body');
            content.appendChild(body);

            const chaptersText = document.createElement('p');
            chaptersText.innerHTML = mainMenu.user.displayChapters();

            const resultText = document.createElement('p');
            resultText.innerHTML = `Ваш результат: ${matchGame.points.currentState} ${pointsText(matchGame.points.currentState)}!`;
            body.appendChild(chaptersText);
            body.appendChild(resultText);

            const footer = document.createElement('div');
            footer.classList.add('modal-footer');
            content.appendChild(footer);

            const button = document.createElement('button');
            button.classList.add('btn');
            button.classList.add('btn-success');
            button.setAttribute('type', 'button');
            button.setAttribute('data-bs-dismiss', 'modal');
            button.innerHTML = 'Закрыть';
            footer.appendChild(button);

            const resultsModal = new bootstrap.Modal(modal);
            resultsModal.show();
            modal.addEventListener('hidden.bs.modal', function(){
                mainMenu.renderMenu();
            })
        },
    },

    renderInitialView: function() {
        this.timer.render();
        this.points.render();
        let self = this;
        let list = document.createElement('div');
        list.classList.add('flex');
        document.getElementById('main').appendChild(list);
        let sixMix = shuffle([1, 2, 3, 4, 5, 6]);
        sixMix.forEach(el => {
            let text;
            let classText;
            let id;
            if (el <= 3) {
                text = self.currentState.texts.currentView.texts[el - 1].text;
                classText = 'text';
                id = self.currentState.texts.currentView.texts[el - 1].id;
            } else {
                let element = self.currentState.texts.currentView.links[el - 4];
                text = `${element.book}.${element.chapter}:${element.verse}`;
                classText = 'link';
                id = element.id;
            }
            let listElement = document.createElement('div');
            let container = document.createElement('button');
            listElement.appendChild(container);
            container.classList.add(`${classText}`, 'option');
            container.setAttribute('id', id);
            container.setAttribute('type', 'button');
            container.innerHTML = text;
            list.appendChild(listElement);    
        })
    },

    activate: function() {
        let self = this;
        const buttons = document.getElementsByClassName('option');
        [...buttons].forEach(btn => {
            btn.addEventListener('click', function(event) {
                const curEl = event.target;
                const selectedBtns = [...document.getElementsByClassName('selected')];
                if (selectedBtns.length == 0 || curEl.classList.contains('selected')) {
                    curEl.classList.toggle('selected');
                } else if (selectedBtns.length == 1) {
                    if (curEl.classList.contains('text') == selectedBtns[0].classList.contains('text')) {
                        curEl.classList.toggle('selected');
                        selectedBtns[0].classList.toggle('selected');
                    } else {
                        if (selectedBtns[0].getAttribute('id') == curEl.getAttribute('id')) {
                            self.points.update(true);
                            curEl.classList.toggle('selected');
                            selectedBtns[0].style.setProperty('background-color', 'gold');
                            curEl.style.setProperty('background-color', 'gold');
                            selectedBtns[0].style.setProperty('opacity', '0');
                            curEl.style.setProperty('opacity', '0');
                            
                            setTimeout(function() {
                                selectedBtns[0].style.setProperty('transition', 'opacity 0s')
                                curEl.style.setProperty('transition', 'opacity 0s');
                                curEl.classList.toggle('selected');
                                selectedBtns[0].classList.toggle('selected');

                                const buttons = [...document.getElementsByClassName('option')];
                                const remOptions = buttons.filter(el => el.getAttribute('id') != curEl.getAttribute('id'));
                                const set = new Set();
                                remOptions.forEach(el => set.add(el.getAttribute('id')));
                                const curTextObj = self.currentState.texts.readyToUse.find(el => el.id == curEl.getAttribute('id')); 
                                self.currentState.texts.nextStep(set.size, curTextObj);
                                self.reRender();
                            }, 500)
                        } else {
                            self.points.update(false);
                            selectedBtns[0].style.setProperty('transition', 'background-color 0.5s');
                            curEl.style.setProperty('transition', 'background-color 0.5s');
                            selectedBtns[0].style.setProperty('background-color', 'lightcoral');
                            curEl.style.setProperty('background-color', 'lightcoral');

                            setTimeout(function() {
                                selectedBtns[0].style.setProperty('transition', 'background-color 0s')
                                curEl.style.setProperty('transition', 'background-color 0s');
                                selectedBtns[0].style.removeProperty('background-color');
                                curEl.style.removeProperty('background-color');
                                selectedBtns[0].style.setProperty('transition', '')
                                curEl.style.setProperty('transition', '');

                                selectedBtns[0].classList.toggle('selected');
                            }, 500)
                        }
                    } 
                }
            })
        })
    },

    reRender: function() {
        let self = this;
        let options = [...document.getElementsByClassName('option')];
        let hiddenEls = shuffle(options.filter(el => el.style.opacity == '0'));

        hiddenEls[0].setAttribute('id', self.currentState.texts.currentView.texts[2].id);
        hiddenEls[0].innerHTML = self.currentState.texts.currentView.texts[2].text;
        hiddenEls[0].classList.replace('link', 'text');
        hiddenEls[0].style.removeProperty('background-color');
        hiddenEls[0].style.setProperty('opacity', '1');
        hiddenEls[0].style.setProperty('transition', 'opacity 0.5s')

        let newLinkEl = self.currentState.texts.currentView.links[2];
        hiddenEls[1].setAttribute('id', newLinkEl.id);
        hiddenEls[1].innerHTML = `${newLinkEl.book}.${newLinkEl.chapter}:${newLinkEl.verse}`;
        hiddenEls[1].classList.replace('text', 'link');
        hiddenEls[1].style.removeProperty('background-color');
        hiddenEls[1].style.setProperty('opacity', '1');
        hiddenEls[1].style.setProperty('transition', 'opacity 0.5s')
    },

    reActivate: function() {

    },

    start: function() {
        if (mainMenu.user.chapters.length == 0) {
            document.getElementsByClassName('svg')[0].click();
            return;
        }
        this.currentState.texts.reset();
        mainMenu.user.getChapters();
        this.timer.reset();
        this.points.reset();
        document.getElementById('main').innerHTML = '';
        this.currentState.setInitialState();
        this.renderInitialView();
        this.activate();
    },
}

const studyGame = {
    texts: {
        consoling: function() {
            console.log(`---`);
            console.log(`remaining:`);
            console.log(this.remaining);
            console.log(`now:`);
            console.log(this.now);
            console.log(`studied:`);
            console.log(this.studied);
            console.log(`repeat:`);
            console.log(this.repeat);
            console.log(`side:`);
            console.log(this.side);
            console.log(`---`);
        },
        remaining: [],
        now: [],
        studied: [],
        repeat: [],
        side: 'main',
        reset: function(turn) {
            this.remaining = [];
            this.now = [];
            this.studied = [];
            this.repeat = [];
            turn ? this.side = 'back' : this.side = 'main'
        },
        continue: function() {
            if (this.repeat.length != 0) {
                const self = this;
                this.remaining = [];
                this.repeat.forEach(el => {
                    self.remaining.push(el);
                });
                this.now = [];
                this.studied = [];
                this.repeat = [];
            } else if (this.side = 'main') {
                mixedSelection = shuffle(mixedSelection);
                this.reset(true);
                this.setInitialState();
            } else {
                this.reset(false);
                //back
            }


        },
        setInitialState: function() {
            let self = this;
            mixedSelection.forEach(el => {
                self.remaining.push(el);
            })
        },
        shiftToNow: function() {
            this.now.push(this.remaining[0]);
            if (this.remaining) {
                this.remaining.splice(0, 1);
            } 
        },
        shiftToStudied: function() {
            this.studied.push(this.now[0]);
            this.now = [];
        },
        shiftToRepeat: function() {
            this.repeat.push(this.now[0]);
            this.now = [];
        },
    },

    counters: {
        repeat: 0,
        studied: 0,
        repeatAdd: function() {
            this.repeat += 1;
            document.getElementsByClassName('repeatCount')[0].innerHTML = this.repeat;
        },
        studiedAdd: function() {
            this.studied += 1;
            document.getElementsByClassName('studiedCount')[0].innerHTML = this.studied;
        },
        reset: function() {
            this.repeat = 0;
            this.studied = 0;
        },
    },

    renderInitialView: function() {
        const self = this;
        document.getElementById('main').innerHTML = '';
        const flexCont = document.createElement('div');
        flexCont.classList.add('flexCont');
        
        flexCont.addEventListener('click', () => {
            flexCont.classList.toggle('flip');
        });
        
        const card = document.createElement('div');
        card.classList.add('vCard');

        this.texts.shiftToNow();
        let firstEl = this.texts.now[0];
        if (this.texts.side == 'main') {
            card.innerHTML = `${firstEl.book}.${firstEl.chapter}:${firstEl.verse}`;
        } else if (this.texts.side == 'back') {
            card.innerHTML = `${firstEl.text}`; 
        }

        flexCont.appendChild(card);
        
        const back = document.createElement('div');
        back.classList.add('back');
        if (this.texts.side == 'main') {
            back.innerHTML = `${firstEl.text}`;
        } else if (this.texts.side == 'back') {
            back.innerHTML = `${firstEl.book}.${firstEl.chapter}:${firstEl.verse}`;
        }
        
        flexCont.appendChild(back);

        const sides = [];
        sides.push(card);
        sides.push(back);

        sides.forEach(el => {
            el.addEventListener('mousedown', function(event) {
                self.move.pickup(event);
            });
            el.addEventListener('touchstart', function(event) {
                self.move.pickup(event);
            });
    
            el.addEventListener('mousemove', function(event) {
                self.move.move(event);
            });
            el.addEventListener('touchmove', function(event) {
                self.move.move(event);
            });
    
            el.addEventListener('mouseup', function(event) {
                self.move.drop(event);
            });
            el.addEventListener('touchend', function(event) {
                self.move.drop(event);
            });
            el.addEventListener('touchcancel', function(event) {
                self.move.drop(event);
            });
            el.style.fontSize = properFont(el.innerHTML);
        });

        const countersCont = document.createElement('div');
        countersCont.classList.add('countersCont');

        const repeatCount = document.createElement('div');
        repeatCount.classList.add('repeatCount');
        countersCont.appendChild(repeatCount);
        repeatCount.innerHTML = 0;

        const studiedCount = document.createElement('div');
        studiedCount.classList.add('studiedCount');
        countersCont.appendChild(studiedCount);
        studiedCount.innerHTML = 0;

        document.getElementById('main').appendChild(countersCont);
        document.getElementById('main').appendChild(flexCont);
    },

    putNextCard: function(side, ok) {
        ok ? this.texts.shiftToStudied() : this.texts.shiftToRepeat();
        if (this.texts.remaining.length != 0) {
            this.texts.shiftToNow();
            const frontSide = document.getElementsByClassName('vCard')[0];
            const backSide = document.getElementsByClassName('back')[0];
            if (side == 'back') {
                const card = document.getElementsByClassName('flexCont')[0];
                card.style.transitionProperty = 'none';
                card.classList.toggle('flip');
                setTimeout(function() {card.style.transitionProperty = '';}, 100);
            } else {
                frontSide.style.transitionProperty = 'none';
                setTimeout(function() {frontSide.style.transitionProperty = '';}, 100);
            }
            
            let firstEl = this.texts.now[0];

            if (this.texts.side == 'main') {
                frontSide.innerHTML = `${firstEl.book}.${firstEl.chapter}:${firstEl.verse}`;
                backSide.innerHTML = `${firstEl.text}`;
            } else if (this.texts.side == 'back') {
                frontSide.innerHTML = `${firstEl.text}`;
                backSide.innerHTML = `${firstEl.book}.${firstEl.chapter}:${firstEl.verse}`;
            }

            const cardSides = [];
            cardSides.push(frontSide);
            cardSides.push(backSide);
            cardSides.forEach((sideEl) =>{
                sideEl.style.left = '';
                sideEl.style.top = '';
                sideEl.style.height = '';
                sideEl.style.width = '';
                sideEl.style.padding = '';
                sideEl.style.position = '';
                sideEl.style.fontSize = properFont(sideEl.innerHTML);
            });
        } else {
            this.showResults(this.counters.studied, this.counters.repeat);
        }
    },

    showResults: function(studNum, repNum) {
        const self = this;
        const resultsCont = document.createElement('div');
        resultsCont.classList.add('resultsCont');

        const resultText = document.createElement('div');
        resultText.classList.add('resultText');
        resultText.innerHTML = `Ваш результат:`;
        resultsCont.appendChild(resultText);

        const nextButtonCont = document.createElement('div');
        nextButtonCont.classList.add('nextButtonCont');
        const nextButton = document.createElement('button');
        nextButton.classList.add('nextButton');
        (self.texts.repeat.length == 0 && self.texts.side == 'back') ? nextButton.innerHTML = 'Вернуться' : nextButton.innerHTML = 'Продолжить';
        nextButtonCont.appendChild(nextButton);
        resultsCont.appendChild(nextButtonCont);
        
        nextButton.addEventListener('click', function() {
            self.counters.reset()
            if (self.texts.repeat.length == 0 && self.texts.side == 'back') {
                mainMenu.renderMenu();
                return;   
            }
            self.texts.continue();
            self.renderInitialView();
        });

        let animationTime = 1500;
        let delayTime = 500;

        const pointsCont = document.createElement('div');
        pointsCont.classList.add('pointsCont');
        resultsCont.appendChild(pointsCont);

        const studied = document.createElement('div');
        studied.classList.add('studiedResult');
        let counterProgress = 0;
        studied.innerHTML = `${counterProgress}`;

        setTimeout(function() {
            const setIntID = setInterval(function() {
                counterProgress < studNum ? counterProgress++ : clearInterval(setIntID);
                studied.innerHTML = `${counterProgress}`;
            }, animationTime/studNum);
    
        }, delayTime);

        const slash = document.createElement('div');
        slash.classList.add('slashResult');
        slash.innerHTML = '/';

        const repeat = document.createElement('div');
        repeat.classList.add('repeatResult');
        let repeatProgress = 0;
        repeat.innerHTML = `${repeatProgress}`;

        setTimeout(function() {
            const setIntID2 = setInterval(function() {
                repeatProgress < repNum ? repeatProgress++ : clearInterval(setIntID2);
                repeat.innerHTML = `${repeatProgress}`;
            }, animationTime/repNum);
    
        }, delayTime);

        pointsCont.appendChild(studied);
        pointsCont.appendChild(slash);
        pointsCont.appendChild(repeat);
        
        const canvasCont = document.createElement('div');
        canvasCont.classList.add('canvasCont');

        const canvas = document.createElement('canvas');
        canvasCont.appendChild(canvas);
        resultsCont.appendChild(canvasCont);
        new Chart(canvas, {
            type: 'doughnut',
            data: {
                datasets: [{
                    label: 'Результаты',
                    data: [studNum, repNum],
                    backgroundColor: [
                      'gold',
                      'lightcoral'
                    ],
                    hoverOffset: 4,
                    cutout: '70%',
                  }]
            },
            options: {
                events: [],
                animation: {
                    duration: animationTime,
                    easing: (studNum == 0 || repNum == 0) ? 'easeOutExpo' : 'easeOutBack',
                    delay: delayTime,
                },
                elements: {
                    arc: {
                        borderColor: 'blanchedalmond',
                        borderWidth: 4,
                    }
                }
            }
        });
        document.getElementById('main').innerHTML = '';
        document.getElementById('main').appendChild(resultsCont);
    },

    start: function(){
        if (mainMenu.user.chapters.length == 0) {
            document.getElementsByClassName('svg')[0].click();
            return;
        }
        this.counters.reset();
        mainMenu.user.getChapters();
        this.texts.setInitialState();
        document.getElementById('main').innerHTML = '';
        this.renderInitialView();
    },

    move: {
        moving: null,

        type: '',

        coords: {
            x: 0,
            y: 0,
            reset: function() {
                this.x = 0;
                this.y = 0;
            },
            set: function(x, y) {
                this.x = x;
                this.y = y;
            },
        },

        pickup: function(event) {            
            this.moving = event.target;
  
            if (this.moving.classList.contains('vCard')) {
                this.type = 'front';
            } else {
                this.type = 'back';
            }

            if (event.clientX) {
                this.coords.set(event.clientX, event.clientY);
            } else {
                this.coords.set(event.changedTouches[0].clientX, event.changedTouches[0].clientY);
            }

            this.moving.style.height = `${this.moving.offsetHeight - 6}px`;
            this.moving.style.width = `${this.moving.offsetWidth - 6}px`;
            this.moving.style.padding = '6px';
            this.moving.style.position = 'fixed';

            const resultCont = document.createElement('div');
            resultCont.classList.add('resultCont');
            this.moving.appendChild(resultCont);
        },

        move: function (event) {
            if (this.moving) {
                if (event.clientX) {
                    // mousemove
                    if (this.type == 'front') {
                        this.moving.style.left = `calc(10vw + ${event.clientX - this.coords.x}px)`;
                        this.moving.style.top = `calc(10vh + ${event.clientY - this.coords.y}px)`;
                    } else {
                        this.moving.style.left = `calc(10vw - ${event.clientX - this.coords.x}px)`;
                        this.moving.style.top = `calc(10vh + ${event.clientY - this.coords.y}px)`;
                    }
                } else {
                    // touchmove - assuming a single touchpoint
                    if (this.type == 'front') {
                        this.moving.style.left = `calc(10vw + ${event.changedTouches[0].clientX - this.coords.x}px`;
                        this.moving.style.top = `calc(10vh + ${event.changedTouches[0].clientY - this.coords.y}px`;
                    } else {
                        this.moving.style.left = `calc(10vw - ${event.changedTouches[0].clientX - this.coords.x}px`;
                        this.moving.style.top = `calc(10vh + ${event.changedTouches[0].clientY - this.coords.y}px`;
                    }
                }
                let clX = event.clientX ? event.clientX : event.changedTouches[0].clientX;
                let percentage = Math.round(Math.abs(clX - this.coords.x)/(window.innerWidth*0.2/2)*100)/100;
                let direction = clX < this.coords.x ? 'left' : 'right';
                // debugger;
                const resultCont = document.getElementsByClassName('resultCont')[0];
                const repeatCount = document.getElementsByClassName('repeatCount')[0];
                const studiedCount = document.getElementsByClassName('studiedCount')[0];

                let adjPercent;
                if (percentage > 1) {
                    adjPercent = 1;
                } else if (percentage < 0) {
                    adjPercent = 0;
                } else {
                    adjPercent = percentage;
                }
                if (direction == 'left') {
                    repeatCount.style.backgroundColor = mixColors('darkseagreen', 'lightcoral', percentage);
                } else {
                    studiedCount.style.backgroundColor = mixColors('darkseagreen', 'gold', percentage);
                }
                if (this.type == 'front') {
                    this.moving.style.color = mixColors('darkslategrey', 'blanchedalmond', percentage);
                    resultCont.style.color = 'blanchedalmond';
                    if (direction == 'left') {
                        this.moving.style.borderColor = mixColors('blanchedalmond', 'lightcoral', percentage);
                        resultCont.innerHTML = 'Повторить';
                        // resultCont.style.color = mixColors('blanchedalmond', 'lightcoral', percentage);
                        // resultCont.style.opacity = adjPercent;
                    } else {
                        this.moving.style.borderColor = mixColors('blanchedalmond', 'gold', percentage);
                        resultCont.innerHTML = 'Верно';
                        // resultCont.style.color = mixColors('blanchedalmond', 'gold', percentage);
                        // resultCont.style.opacity = adjPercent;
                    }
                    // resultCont.style.opacity = adjPercent;
                } else if (this.type == 'back') {
                    this.moving.style.color = mixColors('blanchedalmond', 'darkslategrey', percentage);
                    resultCont.style.color = 'blanchedalmond';
                    if (direction == 'left') {
                        this.moving.style.borderColor = mixColors('darkslategrey', 'lightcoral', percentage);
                        resultCont.innerHTML = 'Повторить';
                        // resultCont.style.zIndex = '1';
                        // resultCont.style.color = mixColors('darkslategrey', 'lightcoral', percentage);
                    } else {
                        this.moving.style.borderColor = mixColors('darkslategrey', 'gold', percentage);
                        resultCont.innerHTML = 'Верно';
                        // resultCont.style.zIndex = '1';
                        // resultCont.style.color = mixColors('darkslategrey', 'gold', percentage);
                    }
                }
                resultCont.style.opacity = adjPercent;
                resultCont.style.zIndex = '1';
                resultCont.style.color = resultCont.innerHTML == 'Верно' ? 'gold' : 'lightcoral';
            }
        },

        switchTransition: {
            status: '',
            on: function(el) {
                el.style.transition = 'all 0.5s';
                this.status = 'on';
            },

            off: function(el) {
                el.style.transitionProperty = '';
                this.status = 'off';
            },
        },

        drop: function (event) {
            if (this.moving) {
                if (document.getElementsByClassName('resultCont')[0]) {
                    document.getElementsByClassName('resultCont')[0].remove();
                }
                document.getElementsByClassName('repeatCount')[0].style.backgroundColor = '';
                document.getElementsByClassName('studiedCount')[0].style.backgroundColor = '';
                document.getElementsByClassName('vCard')[0].style.borderColor = '';
                document.getElementsByClassName('back')[0].style.borderColor = '';

                if (this.switchTransition.status = 'off') {
                    this.switchTransition.on(this.moving);
                }
                let direction = '';
                let currentLeft = this.moving.style.left;

                let shift;
                if (currentLeft.match(/\d*px/i)) {
                    shift  = parseInt(currentLeft.match(/\d*\.?\d*px/i)[0]);
                }
                
                let clX = event.clientX ? event.clientX : event.changedTouches[0].clientX;

                if (shift > window.innerWidth*0.2/2) {
                    direction = clX < this.coords.x ? 'left' : 'right';
                } else {
                    direction = '';
                }
                if (!direction) {
                    this.moving.style.left = '';
                    this.moving.style.top = '';
                    this.moving.style.height = '';
                    this.moving.style.width = '';
                    this.moving.style.padding = '';
                } else if ((direction == 'left' && this.type == 'front') || (direction == 'right' && this.type == 'back')) {
                    this.moving.style.left = `${currentLeft.slice(0, -1)} - 100vw)` 
                } else {
                    this.moving.style.left = `${currentLeft.slice(0, -1)} + 100vw)`
                }
                this.moving.style.position = '';

                if (!direction) {
                    if (this.switchTransition.status == 'on') {
                        this.switchTransition.off(this.moving);
                    }
                    this.moving = null;
                    ['vCard', 'back'].forEach(side => {
                        document.getElementsByClassName(side)[0].style.color = '';
                    });
                } else {
                    let self = this;
                    setTimeout(function() {
                        if (self.switchTransition.status == 'on') {
                            self.switchTransition.off(self.moving);
                        }
                        self.moving = null;
                        direction == 'left' ? studyGame.putNextCard(self.type, false) : studyGame.putNextCard(self.type, true);
                        
                        ['vCard', 'back'].forEach(side => {
                            if (document.getElementsByClassName(side)[0]) {
                                document.getElementsByClassName(side)[0].style.color = '';
                            }
                        });
                    }, 500);
                    if (direction == 'left') {
                        studyGame.counters.repeatAdd();
                    } else {
                        studyGame.counters.studiedAdd();
                    }
                }
                this.coords.reset();
            }
        },
    },
};

const quizGame = {
    texts: {
        readyToUse: [],
        used: [],
        side: '',
        halfStudied: {
            chapter: [],
            verse: [],
        },
        studied: {
            chapter: [],
            verse: [],
        },
        count: 0,
        round: 0,
    },

    setInitialState: function() {
        let self = this;
        // debugger;
        mixedSelection.forEach(el => {
            self.texts.readyToUse.push(el);
        });

        self.texts.readyToUse = shuffle(self.texts.readyToUse);
        if (self.texts.side == '' || self.texts.side == 'verse') {
            self.texts.side = 'chapter';
        } else {
            self.texts.side = 'verse';
        }
        self.texts.round += 1;
        
    },

    reset: function() {
        this.texts.readyToUse = [];
        this.texts.used = [];
        this.texts.side = '';
        this.texts.halfStudied.chapter = [];
        this.texts.halfStudied.verse = [];
        this.texts.studied.chapter = [];
        this.texts.studied.verse = [];
        this.texts.count = 0;
        this.texts.round = 0;
    },

    renderGame: function() {
        let self = this;
        const main = document.getElementById('main');
        main.innerHTML = '';
        
        const timerCont = document.createElement('div');
        timerCont.classList.add('timerCont');

        const timer = document.createElement('div');
        timer.classList.add('timer');
        timer.innerHTML = 10;

        timerCont.appendChild(timer);
        main.appendChild(timerCont);

        const textCont = document.createElement('div');
        textCont.classList.add('textCont');
        textCont.innerHTML = self.texts.readyToUse[0].text;
        main.appendChild(textCont);

        const answersCont = document.createElement('div');
        answersCont.classList.add('answersCont');
        let buttonsArr = [];
        let textsArr = self.findNear(self.texts.readyToUse[0], self.texts.side);
        textsArr.forEach((text, ind) => {
            let button = document.createElement('div');
            button.classList.add('qOption');
            button.innerHTML = text;
            if (ind == 0) {
                button.setAttribute('isProper', 'true')
            } else {
                button.setAttribute('isProper', 'false')
            }
            buttonsArr.push(button);
        });

        let timerID = setInterval(function(){
            if (parseInt(timer.innerHTML) == 0) {
                self.showProper(checkFunc);
                clearInterval(timerID);
            } else {
                timer.innerHTML = parseInt(timer.innerHTML) - 1;
            }
        }, 1000);

        const checkFunc = function(e) {
            let currentEl = self.texts.readyToUse[0];
            let result;
            if (e.target.getAttribute('isProper') == 'true') {
                result = true;
                e.target.classList.add('proper');
                if (arrContains(currentEl, self.texts.halfStudied[self.texts.side])) {
                    if (!arrContains(currentEl, self.texts.studied[self.texts.side])) {
                        self.texts.studied[self.texts.side].push(currentEl);
                        remove(currentEl, self.texts.halfStudied[self.texts.side]);
                    }
                } else {
                    self.texts.halfStudied[self.texts.side].push(currentEl);
                }
            } else {
                result = false;
                e.target.classList.add('false');
                document.querySelectorAll('[isProper="true"]')[0].classList.add('proper');
            }
            self.texts.used.push(currentEl);
            remove(currentEl, self.texts.readyToUse);
            clearInterval(timerID);
            let delay = result ? 2000 : 5000;
            setTimeout(self.nextStep, delay, self);
            [...document.getElementsByClassName('qOption')].forEach(el => {el.removeEventListener('click', checkFunc)});
        }

        buttonsArr = shuffle(buttonsArr);
        buttonsArr.forEach(btn => {
            answersCont.appendChild(btn)
            btn.addEventListener('click', checkFunc)   
        });
        main.appendChild(answersCont);
    },

    nextStep: function(self) {
        if (self.texts.readyToUse.length > 0) {
            self.renderGame();
        } else {
            self.renderResults();
        }
    },

    continue: function(self) {
        if (self.texts.round == 4) {
            self.reset();
            mainMenu.renderMenu();
            return;
        }
        self.setInitialState();
        self.renderGame();
    },

    showProper: function(checkFunc) {
        let self = this;
        let currentEl = self.texts.readyToUse[0];
        let proper = document.querySelectorAll('[isProper="true"]')[0]
        proper.classList.add('proper');
        self.texts.used.push(currentEl);
        remove(currentEl, self.texts.readyToUse);
        // clearInterval(timerID);
        let delay = 5000;
        setTimeout(self.nextStep, delay, self);
        [...document.getElementsByClassName('qOption')].forEach(el => {el.removeEventListener('click', checkFunc)});


    },

    renderResults: function() {
        const self = this;
        const main = document.getElementById('main');
        main.innerHTML = '';
        const resultsCont = document.createElement('div');
        resultsCont.classList.add('qResultsCont');
        let count = 0;

        mixedSelection.forEach(el => {
            let cont = document.createElement('div');
            cont.classList.add('qLink');
            cont.innerHTML = `${el.book}.`;

            let chapter = document.createElement('span');
            chapter.innerHTML = el.chapter;
            let chapterValue;
            let chapterClass;
            if (arrContains(el, self.texts.halfStudied.chapter)) {
                chapterValue = 0.5;
                chapterClass = 'half';
            } else if (arrContains(el, self.texts.studied.chapter)) {
                chapterValue = 1;
                chapterClass = 'full';
            } else {
                chapterValue = 0;
                chapterClass = 'zero';
            }

            count += chapterValue; 
            chapter.classList.add(chapterClass);
            cont.innerHTML = `${cont.innerHTML}${chapter.outerHTML}:`;
            
            let verse = document.createElement('span');
            verse.innerHTML = parseInt(el.verse);
            let verseValue;
            let verseClass;
            if (arrContains(el, self.texts.halfStudied.verse)) {
                verseValue = 0.5;
                verseClass = 'half';
            } else if (arrContains(el, self.texts.studied.verse)) {
                verseValue = 1;
                verseClass = 'full';
            } else {
                verseValue = 0;
                verseClass = 'zero';
            }

            count += verseValue;
            verse.classList.add(verseClass);
            cont.innerHTML = `${cont.innerHTML}${verse.outerHTML}: «${el.text}»`;
            resultsCont.appendChild(cont);
        });
        main.appendChild(resultsCont);

        let progressCont = document.createElement('div');
        progressCont.classList.add('progress');
       
        let progressBar = document.createElement('div');
        progressBar.classList.add('progress-bar');
        progressBar.classList.add('progress-bar-striped');
        // progressBar.classList.add('progress-bar-animated');
        progressBar.setAttribute('role', 'progressbar');
        progressBar.setAttribute('aria-valuenow', '0');
        progressBar.setAttribute('aria-valuemin', '0');
        progressBar.setAttribute('aria-valuemax', '100');
        progressBar.style.width = `${Math.round((self.texts.count / (mixedSelection.length * 2)) * 100)}%`;
        progressCont.appendChild(progressBar);
        main.appendChild(progressCont);

        const progressPercentCont = document.createElement('div');
        progressPercentCont.classList.add('progressPercentCont');
        progressPercentCont.innerHTML = `${Math.round((self.texts.count / (mixedSelection.length * 2)) * 100)}%`;
        let currentPercent = Math.round((self.texts.count / (mixedSelection.length * 2)) * 100);
        let newPercent = Math.round(((count) / (mixedSelection.length * 2)) * 100);
        let steps = newPercent - currentPercent;
        console.log(`new percent: ${newPercent}`);
        main.appendChild(progressPercentCont);

        const nextCont = document.createElement('div');
        nextCont.classList.add('nextCont');
        const nextButtonTriple = document.createElement('div');
        nextButtonTriple.classList.add('nextButtonTriple');
        nextCont.appendChild(nextButtonTriple);
        nextButtonTriple.addEventListener('click', function(){
            nextCont.style.transition = 'all 1s ease-in-out';
            nextCont.style.right = 'calc(0vw - 40px)';
            setTimeout(function(){self.continue(self)}, 1000);
        });

        nextCont.style.right = 'calc(0vw - 40px)';
        main.appendChild(nextCont);

        setTimeout(function(){
            let iterator = currentPercent;
            let intID = this.setInterval(function() {
                if (iterator == newPercent - 1) {
                    clearInterval(intID);
                }
                iterator++;
                progressPercentCont.innerHTML = `${iterator}%`;
            }, 2000/steps)
        }, 500);

        self.texts.count = count;
        setTimeout(function(){
            progressBar.style.width = `${newPercent}%`;
        }, 500);

        setTimeout(function(){
            nextCont.style.right = '';
        }, 500);


    },

    findNear: function(obj, side) {
        let bookIndex = bibleBooks.indexOf(obj.book);
        if (side == 'chapter') {
            let chaptersNum = max[bookIndex].length;
            let selection = [];
            let result = [];
            result.push(`${obj.book}.${obj.chapter}:${parseInt(obj.verse)}`);

            const verseExist = function(first, final, obj, bookIndex, selection) {
                let current = first;
                while (current <= final) {
                    if (current != parseInt(obj.chapter)) {
                        if (parseInt(max[bookIndex][current - 1]) >= parseInt(obj.verse)) {
                            selection.push(current)
                        }
                    }

                    current++;
                }    
            };

            const selectRandomCh = function(result, selection, obj) {
                while (result.length < 4) {
                    let anyEl = getAnyEl(selection);
                    let text = `${obj.book}.${anyEl}:${parseInt(obj.verse)}`;
                    result.push(text);
                    let index = selection.indexOf(anyEl);
                    selection.splice(index, 1);
                }
            };

            let first, final;
            if (obj.chapter.length == 1) {
                first = 1;
                final = chaptersNum < 9 ? chaptersNum : 9;
            } else if (obj.chapter.length == 2) {
                first = parseInt(obj.chapter.charAt(0) + '0');
                final = chaptersNum < parseInt(obj.chapter.charAt(0) + '9') ? chaptersNum : parseInt(obj.chapter.charAt(0) + '9');
            } else {
                first = parseInt(obj.chapter.slice(0, 2) + '0');
                final = chaptersNum < parseInt(obj.chapter.slice(0, 2) + '9') ? chaptersNum : parseInt(obj.chapter.slice(0, 2) + '9');
            }

            verseExist(first, final, obj, bookIndex, selection);

            if (selection.length >= 3) {
                selectRandomCh(result, selection, obj);
            } else {
                let direction = 'prev';
                let prevTry = 0;
                let nextTry = 0;
                let prevBouncer = obj.chapter.length == 1 ? true : false;
                let nextBouncer = final == chaptersNum ? true : false;

                const prev = function() {
                    prevTry++;
                    if ((first - prevTry * 10) == 10) {
                        verseExist(1, 9, obj, bookIndex, selection);
                        prevBouncer = true;
                    } else {
                        let newFirst, newFinal;
                        if (obj.chapter.length == '2') {
                            newFirst = parseInt(obj.chapter.charAt(0) - prevTry + '0');
                            newFinal = parseInt(obj.chapter.charAt(0) - prevTry + '9');    
                        } else {
                            newFirst = parseInt(obj.chapter.slice(0, 2) - prevTry + '0');
                            newFinal = parseInt(obj.chapter.slice(0, 2) - prevTry + '9');    
                        }
                        verseExist(newFirst, newFinal, obj, bookIndex, selection);
                    }
                };

                const next = function() {
                    nextTry++;                    
                    let newFirst, newFinal;
                    if (obj.chapter.length == '2') {
                        newFirst = parseInt(obj.chapter.charAt(0) + nextTry + '0');
                        newFinal = chaptersNum < parseInt(obj.chapter.charAt(0) + nextTry + '9') ? chaptersNum : parseInt(obj.chapter.charAt(0) + nextTry + '9');
                    } else {
                        newFirst = parseInt(obj.chapter.slice(0, 2) + nextTry + '0');
                        newFinal = chaptersNum < parseInt(obj.chapter.slice(0, 2) + nextTry + '9') ? chaptersNum : chaptersNum < parseInt(obj.chapter.slice(0, 2) + nextTry + '9');
                    }
                    verseExist(newFirst, newFinal, obj, bookIndex, selection);
                    nextBouncer = newFinal == chaptersNum ? true : false;
                };

                while (selection.length < 3 && (!prevBouncer || !nextBouncer)) {
                    if (direction == 'prev') {
                        if (!prevBouncer) {
                            prev();
                        }
                        direction = 'next';
                    } else if (direction = 'next') {
                        if (!nextBouncer) {
                            next();
                        }
                        direction = 'prev';
                    }
                };

                if (selection.length >= 3) {
                    selectRandomCh(result, selection, obj);
                } else {
                    selection = [];
                    if (chaptersNum >= 4) {
                        let first, final;
                        if (obj.chapter.length == 1) {
                            first = 1;
                            final = chaptersNum < 9 ? chaptersNum : 9;
                        } else if (obj.chapter.length == 2) {
                            first = parseInt(obj.chapter.charAt(0) + '0');
                            final = chaptersNum < parseInt(obj.chapter.charAt(0) + '9') ? chaptersNum : parseInt(obj.chapter.charAt(0) + '9');
                        } else {
                            first = parseInt(obj.chapter.slice(0, 2) + '0');
                            final = chaptersNum < parseInt(obj.chapter.slice(0, 2) + '9') ? chaptersNum : parseInt(obj.chapter.slice(0, 2) + '9');
                        }

                        if (parseInt(obj.chapter.slice(-1)) < 3) {
                            if (obj.chapter.length == 2) {
                                first = parseInt(obj.chapter.charAt(0) - 1 + '0');
                            } else if (obj.chapter.length == 3) {
                                first = parseInt(obj.chapter.slice(0, 2) - 1 + '0');
                            };
                        }
                       
                        let chArr = [];
                        for (let i = first; i <= final; i++) {
                            if (i != obj.chapter) {
                                chArr.push(i);
                            }
                        }

                        while (selection.length < 3) {
                            let anyEl = getAnyEl(chArr);
                            let ind = chArr.indexOf(anyEl);
                            chArr.splice(ind, 1);
                            selection.push(anyEl)
                        }

                        selection.forEach(chapter => {
                            let verse = getRandom(max[bookIndex][chapter - 1]);
                            let text = `${obj.book}.${chapter}:${verse}`;
                            result.push(text);
                        });
                    } else {
                        let chArr = [];
                        let fullArr = [];
                        
                        for (let i = 1; i <= chaptersNum; i++) {
                            fullArr.push(i);
                            if (i != obj.chapter) {
                                chArr.push(i);
                            }
                        };

                        chArr = shuffle(chArr);
                        
                        while (chArr.length < 3) {
                            chArr.push(getAnyEl(fullArr));
                        }

                        chArr.forEach(chapter => {
                            let verse = getRandom(max[bookIndex][chapter - 1]);
                            let text = `${obj.book}.${chapter}:${verse}`;

                            while (result.includes(text)) {
                                verse = getRandom(max[bookIndex][chapter - 1]);
                                text = `${obj.book}.${chapter}:${verse}`;
                            }

                            result.push(text);
                        });
                    }
                }
            };
            return result;
        } else {
            let versesNum = max[bookIndex][obj.chapter - 1];
            let verse = parseInt(obj.verse).toString();
            let selection = [];
            let result = [];
            result.push(`${obj.book}.${obj.chapter}:${parseInt(obj.verse)}`);

            if (versesNum > 3) {
                let first, final;
                if (verse.length == 1) {
                    first = 1;
                    final = versesNum < 9 ? versesNum : 9;
                } else if (verse.length == 2) {
                    first = parseInt(verse.charAt(0) + '0');
                    final = versesNum < parseInt(verse.charAt(0) + '9') ? versesNum : parseInt(verse.charAt(0) + '9');
                } else {
                    first = parseInt(verse.slice(0, 2) + '0');
                    final = versesNum < parseInt(verse.slice(0, 2) + '9') ? versesNum : parseInt(verse.slice(0, 2) + '9');
                }

                if (parseInt(verse.slice(-1)) < 3) {
                    if (verse.length == 2) {
                        first = parseInt(verse.charAt(0) - 1 + '0');
                    } else if (verse.length == 3) {
                        first = parseInt(verse.slice(0, 2) - 1 + '0');
                    };
                }
               
                let chArr = [];
                for (let i = first; i <= final; i++) {
                    if (i != verse) {
                        chArr.push(i);
                    }
                }

                while (selection.length < 3) {
                    let anyEl = getAnyEl(chArr);
                    let ind = chArr.indexOf(anyEl);
                    chArr.splice(ind, 1);
                    selection.push(anyEl)
                }

                selection.forEach(v => {
                    let text = `${obj.book}.${obj.chapter}:${v}`;
                    result.push(text);
                });
            } else {
                let chArr = [];
                let fullArr = [];
                
                for (let i = 1; i <= versesNum; i++) {
                    fullArr.push(i);
                    if (i != verse) {
                        chArr.push(i);
                    }
                };

                chArr = shuffle(chArr);

                while (chArr.length < 3) {
                    chArr.push(getAnyEl(fullArr));
                }

                chArr.forEach(v => {
                    let text = `${obj.book}.${obj.chapter}:${v}`;

                    while (result.includes(text)) {
                        text = `${obj.book}.${obj.chapter - 1}:${v}`;
                    }

                    result.push(text);
                });
            }

            return result;
        }
    },

    start: function() {
        if (mainMenu.user.chapters.length == 0) {
            document.getElementsByClassName('svg')[0].click();
            return;
        }
        mainMenu.user.getChapters();
        this.setInitialState();
        this.renderGame();
    },
};

const booksGame = {
    texts: {
        readyToUse: [],
        used: [],
        books: [],
        halfStudied: [],
        studied: [],
        count: 0,
        round: 0,
    },

    reset: function() {
        this.texts.readyToUse = [];
        this.texts.used = [];
        this.texts.books = [];
        this.texts.halfStudied = [];
        this.texts.studied = [];
        this.texts.count = 0;
        this.texts.round = 0;
    },

    setInitialState: function() {
        let self = this;
        let uniqueBooks = [];
        // let selectedBooks = [];
        mixedSelection.forEach(item => {
            if (!uniqueBooks.includes(item.book)) {
                uniqueBooks.push(item.book);
            }
        });

        if (uniqueBooks.length > 15) {
            uniqueBooks = shuffle(uniqueBooks);
            let counter = 0;
            while (counter < 15) {
                self.texts.books.push(uniqueBooks[counter]);
                counter++;
                // self.texts.remaining = true;
            };
        } else {
            uniqueBooks.forEach(item => {
                self.texts.books.push(item);
            });
        };

        let map = {};

        self.texts.books.forEach(bookTitle => {
            let index = bibleBooks.indexOf(bookTitle);
            map[`Ind_${index}`] = bookTitle;
        });

        let sortedArr = [];

        let counter = 0;

        while (counter < 66) {
            if (map[`Ind_${counter}`]) {
                sortedArr.push(map[`Ind_${counter}`]);
            }
            counter++;
        };

        self.texts.books = sortedArr;

        mixedSelection.forEach(item => {
            if (self.texts.books.includes(item.book)) {
                self.texts.readyToUse.push(item);
            }
        });
        self.texts.round += 1;
    },
    
    renderGame: function() {
        let self = this;
        const main = document.getElementById('main');
        main.innerHTML = '';
        
        const timerCont = document.createElement('div');
        timerCont.classList.add('timerCont');

        const timer = document.createElement('div');
        timer.classList.add('timer');
        timer.innerHTML = 20;

        timerCont.appendChild(timer);
        main.appendChild(timerCont);

        const textCont = document.createElement('div');
        textCont.classList.add('textCont');
        textCont.innerHTML = self.texts.readyToUse[0].text;
        main.appendChild(textCont);

        const answersCont = document.createElement('div');
        answersCont.classList.add('answersCont');
        answersCont.style.alignContent = 'space-evenly';
        let buttonsArr = [];

        self.texts.books.forEach((book) => {
            let button = document.createElement('div');
            button.classList.add('bOption');
            button.innerHTML = book;
            buttonsArr.push(button);
        });

        let timerID = setInterval(function(){
            if (parseInt(timer.innerHTML) == 0) {
                self.showProper(checkFunc);
                clearInterval(timerID);
            } else {
                timer.innerHTML = parseInt(timer.innerHTML) - 1;
            }
        }, 1000);

        const checkFunc = function(e) {
            let currentEl = self.texts.readyToUse[0];
            let result;
            if (e.target.innerHTML == currentEl.book) {
                result = true;
                e.target.classList.add('proper');
                if (arrContains(currentEl, self.texts.halfStudied)) {
                    if (!arrContains(currentEl, self.texts.studied)) {
                        self.texts.studied.push(currentEl);
                        remove(currentEl, self.texts.halfStudied);
                    }
                } else {
                    self.texts.halfStudied.push(currentEl);
                }
            } else {
                result = false;
                e.target.classList.add('false');
                let proper = [...document.getElementsByClassName('bOption')].find(el => el.innerHTML == currentEl.book);
                proper.classList.add('proper');
            }
            self.texts.used.push(currentEl);
            remove(currentEl, self.texts.readyToUse);
            clearInterval(timerID);
            let delay = result ? 2000 : 5000;
            setTimeout(self.nextStep, delay, self);
            [...document.getElementsByClassName('bOption')].forEach(el => {el.removeEventListener('click', checkFunc)});
        }

        // buttonsArr = shuffle(buttonsArr);
        buttonsArr.forEach(btn => {
            answersCont.appendChild(btn)
            btn.addEventListener('click', checkFunc)   
        });
        main.appendChild(answersCont);
    },

    nextStep: function(self) {
        if (self.texts.readyToUse.length > 0) {
            self.renderGame();
        } else {
            self.renderResults();
        }
    },

    renderResults: function() {
        const self = this;
        const main = document.getElementById('main');
        main.innerHTML = '';
        const resultsCont = document.createElement('div');
        resultsCont.classList.add('bResultsCont');
        let count = 0;

        mixedSelection.forEach(el => {
            let cont = document.createElement('div');
            cont.classList.add('bLink');
            cont.innerHTML = '';

            let book = document.createElement('span');
            book.innerHTML = el.book;
            let bookValue;
            let bookClass;
            if (arrContains(el, self.texts.halfStudied)) {
                bookValue = 0.5;
                bookClass = 'half';
            } else if (arrContains(el, self.texts.studied)) {
                bookValue = 1;
                bookClass = 'full';
            } else {
                bookValue = 0;
                bookClass = 'zero';
            }

            count += bookValue; 
            book.classList.add(bookClass);
            cont.innerHTML = `${book.outerHTML}.${el.chapter}:${parseInt(el.verse)}: «${el.text}»`;
            
            resultsCont.appendChild(cont);
        });
        main.appendChild(resultsCont);

        let progressCont = document.createElement('div');
        progressCont.classList.add('progress');
       
        let progressBar = document.createElement('div');
        progressBar.classList.add('progress-bar');
        progressBar.classList.add('progress-bar-striped');
        progressBar.setAttribute('role', 'progressbar');
        progressBar.setAttribute('aria-valuenow', '0');
        progressBar.setAttribute('aria-valuemin', '0');
        progressBar.setAttribute('aria-valuemax', '100');
        progressBar.style.width = `${Math.round((self.texts.count / (mixedSelection.length)) * 100)}%`;
        progressCont.appendChild(progressBar);
        main.appendChild(progressCont);

        const progressPercentCont = document.createElement('div');
        progressPercentCont.classList.add('progressPercentCont');
        progressPercentCont.innerHTML = `${Math.round((self.texts.count / (mixedSelection.length)) * 100)}%`;
        let currentPercent = Math.round((self.texts.count / (mixedSelection.length)) * 100);
        let newPercent = Math.round(((count) / (mixedSelection.length)) * 100);
        let steps = newPercent - currentPercent;
        console.log(`new percent: ${newPercent}`);
        main.appendChild(progressPercentCont);

        const nextCont = document.createElement('div');
        nextCont.classList.add('nextCont');
        const nextButtonTriple = document.createElement('div');
        nextButtonTriple.classList.add('nextButtonTriple');
        nextCont.appendChild(nextButtonTriple);
        nextButtonTriple.addEventListener('click', function(){
            nextCont.style.transition = 'all 1s ease-in-out';
            nextCont.style.right = 'calc(0vw - 40px)';
            setTimeout(function(){self.continue(self)}, 1000);
        });

        nextCont.style.right = 'calc(0vw - 40px)';
        main.appendChild(nextCont);

        setTimeout(function(){
            let iterator = currentPercent;
            let intID = this.setInterval(function() {
                if (iterator == newPercent - 1) {
                    clearInterval(intID);
                }
                iterator++;
                progressPercentCont.innerHTML = `${iterator}%`;
            }, 2000/steps)
        }, 500);

        self.texts.count = count;
        setTimeout(function(){
            progressBar.style.width = `${newPercent}%`;
        }, 500);

        setTimeout(function(){
            nextCont.style.right = '';
        }, 500);
    },

    continue: function(self) {
        if (self.texts.round == 2) {
            self.reset();
            mainMenu.renderMenu();
            return;
        }
        self.setInitialState();
        self.renderGame();
    },

    showProper: function(checkFunc) {
        let self = this;
        let currentEl = self.texts.readyToUse[0];

        let proper = [...document.getElementsByClassName('bOption')].find(el => el.innerHTML == currentEl.book);

        proper.classList.add('proper');
        self.texts.used.push(currentEl);
        remove(currentEl, self.texts.readyToUse);
        // clearInterval(timerID);
        let delay = 5000;
        setTimeout(self.nextStep, delay, self);
        [...document.getElementsByClassName('bOption')].forEach(el => {el.removeEventListener('click', checkFunc)});
    },

    start: function() {
        if (mainMenu.user.chapters.length == 0) {
            document.getElementsByClassName('svg')[0].click();
            return;
        }
        mainMenu.user.getChapters();
        this.setInitialState();
        this.renderGame();
    },

};

const lessons = {
    lessonsSplit: [
        [
			{
				chapter: 0,
				texts: [1, 2, 3, 4, 5, 6, 7, 8, 9],
			},
			{
				chapter: 0,
				texts: [10, 11, 12, 13, 14, 15],
			},
			{
				chapter: 0,
				texts: [16, 17, 18, 19, 20, 21, 22],
			},
			{
				chapter: 0,
				texts: [23, 24, 25, 26, 27, 28],
			},
			{
				chapter: 1,
				texts: [29, 30, 31, 32, 33, 34, 35, 36],
			},
			{
				chapter: 2,
				texts: [37, 38, 39, 40, 41, 42],
			},
			{
				chapter: 2,
				texts: [43, 44, 45, 46, 47, 48],
			},
			{
				chapter: 2,
				texts: [49, 50, 51, 52, 53, 54],
			},
			{
				chapter: 3,
				texts: [55, 56, 57, 58, 59, 60, 61],
			},
			{
				chapter: 3,
				texts: [62, 63, 64, 65, 66, 67, 68],
			},
			{
				chapter: 3,
				texts: [69, 70, 71, 72, 73, 74],
			},
			{
				chapter: 4,
				texts: [75, 76, 77, 78, 79, 80, 81],
			},
			{
				chapter: 4,
				texts: [82, 83, 84, 85, 86, 87],
			},
			{
				chapter: 5,
				texts: [88, 89, 90, 91, 92, 93, 94],
			},
			{
				chapter: 6,
				texts: [95, 96, 97, 98, 99, 100],
			},
			{
				chapter: 7,
				texts: [101, 102, 103, 104, 105, 106],
			},
			{
				chapter: 8,
				texts: [107, 108, 109, 110, 111, 112, 113, 114],
			},
			{
				chapter: 8,
				texts: [115, 116, 117, 118, 119, 120, 121],
			},
			{
				chapter: 9,
				texts: [122, 123, 124, 125, 126, 127, 128, 129, 130, 131],
			},
			{
				chapter: 9,
				texts: [132, 133, 134, 135, 136, 137, 138],
			},
			{
				chapter: 10,
				texts: [139, 140, 141, 142, 143, 144, 145],
			},
			{
				chapter: 11,
				texts: [146, 147, 148, 149, 150, 151],
			},
			{
				chapter: 12,
				texts: [152, 153, 154, 155, 156, 157, 158],
			},
			{
				chapter: 13,
				texts: [159, 160, 161, 162, 163, 164],
			},
			{
				chapter: 14,
				texts: [165, 166, 167, 168, 169, 170, 171, 172],
			},
			{
				chapter: 15,
				texts: [173, 174, 175, 176, 177, 178],
			},
			{
				chapter: 16,
				texts: [179, 180, 181, 182, 183, 184, 185, 186],
			},
			{
				chapter: 17,
				texts: [187, 188, 189, 190, 191, 192],
			},
			{
				chapter: 17,
				texts: [193, 194, 195, 196, 197, 198],
			},
			{
				chapter: 17,
				texts: [199, 200, 201, 202, 203, 204],
			},
			{
				chapter: 18,
				texts: [205, 206, 207, 208, 209, 210],
			},
			{
				chapter: 18,
				texts: [211, 212, 213, 214, 215, 216],
			},
			{
				chapter: 18,
				texts: [217, 218, 219, 220, 221, 222],
			},
			{
				chapter: 18,
				texts: [223, 224, 225, 226, 227, 228],
			},
			{
				chapter: 19,
				texts: [229, 230, 231, 232, 233, 234],
			},
			{
				chapter: 19,
				texts: [235, 236, 237, 238, 239, 240],
			},
			{
				chapter: 20,
				texts: [241, 242, 243, 244, 245, 246],
			},
			{
				chapter: 21,
				texts: [247, 248, 249, 250, 251, 252],
			},
			{
				chapter: 22,
				texts: [253, 254, 255, 256, 257, 258, 259],
			},
			{
				chapter: 23,
				texts: [260, 261, 262, 263, 264, 265],
			},
			{
				chapter: 24,
				texts: [266, 267, 268, 269, 270, 271],
			},
			{
				chapter: 25,
				texts: [272, 273, 274, 275, 276, 277, 278],
			},
			{
				chapter: 26,
				texts: [279, 280, 281, 282, 283, 284],
			},
			{
				chapter: 27,
				texts: [285, 286, 287, 288, 289, 290, 291, 292],
			},
			{
				chapter: 28,
				texts: [293, 294, 295, 296, 297, 298],
			},
			{
				chapter: 28,
				texts: [299, 300, 301, 302, 303, 304],
			},
			{
				chapter: 29,
				texts: [305, 306, 307, 308, 309, 310, 311],
			},
			{
				chapter: 30,
				texts: [312, 313, 314, 315, 316, 317, 318],
			},
			{
				chapter: 31,
				texts: [319, 320, 321, 322, 323, 324],
			},
			{
				chapter: 32,
				texts: [325, 326, 327, 328, 329, 330],
			},
			{
				chapter: 32,
				texts: [331, 332, 333, 334, 335, 336, 337],
			},
			{
				chapter: 33,
				texts: [338, 339, 340, 341, 342, 343],
			},
			{
				chapter: 34,
				texts: [344, 345, 346, 347, 348, 349],
			},
			{
				chapter: 35,
				texts: [350, 351, 352, 353, 354, 355],
			},
			{
				chapter: 36,
				texts: [356, 357, 358, 359, 360, 361],
			},
			{
				chapter: 37,
				texts: [362, 363, 364, 365, 366, 367],
			},
			{
				chapter: 37,
				texts: [368, 369, 370, 371, 372, 373, 374],
			},
			{
				chapter: 38,
				texts: [375, 376, 377, 378, 379, 380],
			},
			{
				chapter: 39,
				texts: [381, 382, 383, 384, 385, 386],
			},
			{
				chapter: 40,
				texts: [387, 388, 389, 390, 391, 392],
			},
			{
				chapter: 41,
				texts: [393, 394, 395, 396, 397, 398, 399],
			},
			{
				chapter: 42,
				texts: [400, 401, 402, 403, 404, 405, 406],
			},
			{
				chapter: 43,
				texts: [407, 408, 409, 410, 411, 412, 413],
            },
        ],
    ],

    selected: {
		// self: this,
        lessons: {
			// self: this,
            inProgress: [
                [], [], [], [], [], [],
            ],
            isStudying: function (lesson, i) {
				const index = lessons.getLessonIndex(lesson, i);
				if (this.inProgress[i].find(el => el.info.index == index)) {
                    return true;
                } else {
                    return false;
                }
            },
            getLesson: function (lesson, i) {
				const index = lessons.getLessonIndex(lesson, i);
                const lessonIfExists = this.inProgress[i].find(el => el.info.index == index);
                if (lessonIfExists) {
                    return lessonIfExists;
                } else {
                    return null;
                }
            },
        },

        item: [
            {}, {}, {}, {}, {}, {},
        ],
        needsToRepeat: [
            {
                book: [],
                chapter: [],
                verse: [],
                text: [],
                expl: [],
            },
            {}, {}, {}, {}, {},
        ],
        forgettingCurve: {
			hour: 1 * 60 * 60 * 1000,
			phasesStart: [
				this.hour, // 1st phase
				12 * this.hour, // 2nd phase
				24 * this.hour, // 3rd phase
				24 * this.hour, // 4th phase
				2 * 24 * this.hour, // 5th phase
				3 * 24 * this.hour, // 6th phase
				5 * 24 * this.hour, // 7th phase
				8 * 24 * this.hour, // 8th phase
				13 * 24 * this.hour, // 9th phase
				21 * 24 * this.hour, // 10th phase
				34 * 24 * this.hour, // 11th phase
				55 * 24 * this.hour, // 12th phase
				89 * 24 * this.hour, // 13th phase
				144 * 24 * this.hour, // 14th phase
				233 * 24 * this.hour // 15th phase
			],
			phasesExp: [
				6 * this.hour, // 1st phase
				12 * this.hour, // 2nd phase
				12 * this.hour, // 3rd phase
				12 * this.hour, // 4th phase
				12 * this.hour, // 5th phase
				12 * this.hour, // 6th phase
				24 * this.hour, // 7th phase
				24 * this.hour, // 8th phase
				2 * 24 * this.hour, // 9th phase
				2 * 24 * this.hour, // 10th phase
				2 * 24 * this.hour, // 11th phase
				3 * 24 * this.hour, // 12th phase
				3 * 24 * this.hour, // 13th phase
				7 * 24 * this.hour, // 14th phase
				10 * 24 * this.hour // 15th phase
			],
		},
    },

    params: {
        lastSectionOpened: '',
        lastScrollPosition: 0,
    },

    sectionsList: ['Основы Истины I', 'Основы Истины II', 'Цари', 'Большие пророки', 'Малые пророки', 'Откровение'],


    getLessonTitle: function(lesson) {
        let lessonsWithinChapter = this.lessonsSplit[0].filter(el => el.chapter == lesson.chapter);
        let index = lessonsWithinChapter.indexOf(lessonsWithinChapter.find(el => el.texts[0] == lesson.texts[0]))
        let text = chaptersTitles[lesson.chapter];
        if (index != 0) {
            if (lessonsWithinChapter.length - 1 == index) {
                text += ' (ОКОНЧАНИЕ)';
            } else if (lessonsWithinChapter.length == 3) {
                text += ' (ПРОДОЛЖЕНИЕ)';
            } else if (lessonsWithinChapter.length > 3) {
                text += ` (ПРОДОЛЖЕНИЕ ${index}-Е)`;
            }
        }

        return text;
    },

	getLessonIndex: function(lesson, i) {
		// console.log(lesson);
		// debugger;
		const lessonFromArr = this.lessonsSplit[i].filter(el => el.texts[0] == lesson.texts[0])[0];
		const index = this.lessonsSplit[i].indexOf(lessonFromArr);
        return index;
	},

    start: function() {
        this.renderSections(true); // arg: true - forward; false - backward;
    },

    renderSections: function(forward) {
        mainMenu.user.currentView = 'sections';
        if (!mainMenu.transition) {
            mainMenu.transition = true;
        }

        if (forward) {
            const overlappingCont = document.createElement('div');
            overlappingCont.classList.add('overlappingCont');
            document.getElementById('main').appendChild(overlappingCont);
            setTimeout(function() {
                overlappingCont.style.opacity = '1';
                overlappingCont.style.width = '100vw';
                overlappingCont.style.height = '100vh';
                overlappingCont.style.borderRadius = '0px';
                overlappingCont.style.top = '-45px';
                overlappingCont.style.paddingTop = '45px';
                overlappingCont.style.paddingBottom = '45px';
                overlappingCont.style.left = '0px';
                overlappingCont.style.margin = '45px 0px';
            }, 0)
        }

        const overlappingCont = document.querySelector('.overlappingCont');

        const self = this;

        if (forward) {
            mainMenu.showBackButton();
        };

        setTimeout(function() {
            self.sectionsList.forEach(function(title, index) {
                const sectionBtn = document.createElement('button');
                sectionBtn.classList.add('sectionBtn');

                const svgCont = document.createElement('div');
                svgCont.classList.add('symbContSection');
                const svg = document.createElement('img');

                let url = 'https://cdn.glitch.global/cc8f623d-c674-4323-a733-cbbc688508ee/';
                if (index == 0) {
                    url += 'building-columns-solid.svg';
                } else if (index == 1) {
                    url += 'building-columns.svg';
                } else if (index == 2) {
                    url += 'crown.svg';
                } else if (index == 3) {
                    url += 'scroll-old.svg';
                } else if (index == 4) {
                    url += 'scroll-old-duo.svg';
                } else if (index == 5) {
                    url += 'omega.svg';
                }

                svg.setAttribute('src', url);
                svg.classList.add('svgBtn');
                svgCont.appendChild(svg);
                
                sectionBtn.appendChild(svgCont);

                const desc = document.createElement('div');
                desc.classList.add('descSection');
                desc.innerHTML = title;

                sectionBtn.appendChild(desc);
                
                overlappingCont.appendChild(sectionBtn);

                setTimeout(function(){
                    sectionBtn.style.opacity = '1';
                }, Math.floor(Math.random() * 300));

                setTimeout(function() {
                    mainMenu.transition = false;
                }, 300)
            });

            const sectionBtns = document.getElementsByClassName('sectionBtn');

            sectionBtns[0].addEventListener('click', function() {
                if (!mainMenu.transition) {
                    self.renderLessons(true, 0);
                }
            });
			// sectionBtns[1].addEventListener('click', function() {
			// 	if (!mainMenu.transition) {
                    
            //     }
			// });
        }, 300);
    },

	// renderBooks: function() {
	// 	mainMenu.user.currentView = 'books';
    //     if (!mainMenu.transition) {
    //         mainMenu.transition = true;
    //     }

    //     const overlappingCont = document.createElement('div');
    //     overlappingCont.classList.add('overlappingCont');
    //     document.getElementById('main').appendChild(overlappingCont);

    //     setTimeout(function() {
    //         overlappingCont.style.opacity = '1';
    //         overlappingCont.style.width = '100vw';
    //         overlappingCont.style.height = '100vh';
    //         overlappingCont.style.borderRadius = '0px';
    //         overlappingCont.style.top = '-45px';
    //         overlappingCont.style.paddingTop = '45px';
    //         overlappingCont.style.paddingBottom = '45px';
    //         overlappingCont.style.left = '0px';
    //         overlappingCont.style.margin = '45px 0px';
    //     }, 0)

    //     const self = this;

    //     mainMenu.showBackButton();

    //     setTimeout(function() {

    //     }, 300);
	// },

    renderLessons: function(forward, ind) {
        mainMenu.user.currentView = 'lessons';
        if (!mainMenu.transition) {
            mainMenu.transition = true;
        }

        const overlappingCont = document.querySelector('.overlappingCont');
        
        if (forward) {
            this.params.lastSectionOpened = ind;
        };

        const self = this;
        const sectionBtns = document.getElementsByClassName('sectionBtn');

        if (forward) {
            const clonedImgCont = document.createElement('div');
            clonedImgCont.classList.add('clonedImgCont');
            clonedImgCont.appendChild(sectionBtns[0].querySelector('.svgBtn').cloneNode(true));
    
            overlappingCont.appendChild(clonedImgCont);
        }

        const clonedImgCont = document.querySelector('.clonedImgCont');

        const descText = self.sectionsList[ind];
        
        if (forward) {
            [0, 1, 2, 3, 4, 5].forEach(num => {
                sectionBtns[num].style.opacity = 0;
            });
        } else {
            document.querySelector('.selectedSectionTitle').style.opacity = '0';
            document.querySelector('.lessonCont').style.opacity = '0';
        };

        setTimeout(function() {
            if (forward) {
                clonedImgCont.style.top = '55px';
                clonedImgCont.style.left = '10px';
                clonedImgCont.querySelector('.svgBtn').style.width = '100%';
                clonedImgCont.style.width = `calc(10vw + 5px)`;
                [...sectionBtns].forEach(button => button.remove());
                clonedImgCont.querySelector('.svgBtn').style.filter = 'invert(29%) sepia(6%) saturate(2527%) hue-rotate(131deg) brightness(89%) contrast(90%)';
            } else {
                document.querySelector('.selectedSectionTitle').remove();
                document.querySelector('.lessonCont').remove();
            };

            const selectedSectionTitle = document.createElement('div');
            selectedSectionTitle.classList.add('selectedSectionTitle');
            selectedSectionTitle.innerHTML = descText;
            overlappingCont.appendChild(selectedSectionTitle);

            const lessonsCont = document.createElement('div');
            lessonsCont.classList.add('lessonsCont');
            overlappingCont.appendChild(lessonsCont);

            self.lessonsSplit[0].forEach(function(lesson) {
                const lessonTitleCont = document.createElement('div');
                lessonTitleCont.classList.add('lessonTitleCont');

                const lessonStatus = document.createElement('div');
                lessonStatus.classList.add('lessonStatus');

                if (self.selected.lessons.isStudying(lesson, 0)) {
                    lessonStatus.style.opacity = 1;
                    
                    let lessonFromArr = self.selected.lessons.getLesson(lesson, 0);
                    // let index = lessonFromArr.info.index;
                    let ratio = Math.round(lessonFromArr.info.percentage * 100);

                    lessonStatus.style.background = `linear-gradient(to right, darkslategrey ${ratio}%, transparent ${ratio}% 100%)`;
                }

                lessonTitleCont.appendChild(lessonStatus);

                const lessonTitle = document.createElement('div');
                lessonTitle.classList.add('lessonTitle');
                lessonTitle.innerHTML = self.getLessonTitle(lesson);
                lessonTitleCont.appendChild(lessonTitle);

                lessonsCont.appendChild(lessonTitleCont);

                lessonTitle.addEventListener('click', function() {
                    if (!mainMenu.transition) {
                        self.renderLesson(lesson);
                    }
                });
            });

            setTimeout(function() {
                selectedSectionTitle.style.opacity = '1';
                lessonsCont.style.opacity = '1';
                const needToScroll = !forward && self.params.lastScrollPosition > 0;
                if (needToScroll) {
                    setTimeout(function() {
                        overlappingCont.scrollTo({top: self.params.lastScrollPosition, behavior: 'smooth'});
                    }, 300);
                }
                setTimeout(() => mainMenu.transition = false, (300 + needToScroll * 300));
            }, forward * 300);
        }, 300)
    },

    renderLesson: function(lesson) {
        mainMenu.transition = true;
        mainMenu.user.currentView = 'lesson';

        const self = this;
        const overlappingCont = document.querySelector('.overlappingCont');
        this.params.lastScrollPosition = overlappingCont.scrollTop;

        const selectedSectionTitle = document.querySelector('.selectedSectionTitle');
        const lessonsCont = document.querySelector('.lessonsCont');

        const needToScroll = self.params.lastScrollPosition > 0;

        if (needToScroll) {
            overlappingCont.scrollTo({top: 0, behavior: 'smooth'});
        }

        setTimeout(function() {
            lessonsCont.style.opacity = '0';
            selectedSectionTitle.style.opacity = '0';
        }, needToScroll * 300);

        setTimeout(function() {
            lessonsCont.remove();
            selectedSectionTitle.innerHTML = self.getLessonTitle(lesson);

            const vw = Math.max(document.documentElement.clientWidth || 0, window.innerWidth || 0);
            const allowedWidth = vw - ((vw / 10) + 25) + 1;
            const currentWidth = selectedSectionTitle.clientWidth;
            const currentFontSize = (vw / 10 + 5) / 1.2;

            const ratio = allowedWidth / currentWidth;

            if (ratio < 1) {
                selectedSectionTitle.style.fontSize = `${currentFontSize * ratio - 1}px`;
            }

            const lessonCont = document.createElement('div');
            lessonCont.classList.add('lessonCont')
            overlappingCont.appendChild(lessonCont);
    
            lesson.texts.forEach(function(textID) {
                const textEl = texts[lesson.chapter].find(el => el.id == textID);
                const textWrapper = document.createElement('div');
                textWrapper.setAttribute('textID', textEl.id);
                textWrapper.classList.add('textWrapper');
    
                const explCont = document.createElement('div');
                explCont.classList.add('explCont');
                textWrapper.appendChild(explCont);
                explCont.innerHTML = textEl.reason[0];
    
                const bookCont = document.createElement('div');
                bookCont.classList.add('bookCont');
                textWrapper.appendChild(bookCont);
                bookCont.innerHTML = textEl.book;
    
                const dotCont = document.createElement('div');
                dotCont.classList.add('filler');
                textWrapper.appendChild(dotCont);
                dotCont.innerHTML = '.';
    
                const chapterCont = document.createElement('div');
                chapterCont.classList.add('chapterCont');
                textWrapper.appendChild(chapterCont);
                chapterCont.innerHTML = textEl.chapter;
    
                const doubleDotCont = document.createElement('div');
                doubleDotCont.classList.add('filler');
                textWrapper.appendChild(doubleDotCont);
                doubleDotCont.innerHTML = ':';
    
                const verseCont = document.createElement('div');
                verseCont.classList.add('verseCont');
                textWrapper.appendChild(verseCont);
                verseCont.innerHTML = textEl.verse;
                textWrapper.appendChild(doubleDotCont.cloneNode(true));
    
                const textCont = document.createElement('div');
                textCont.classList.add('textCont2');
                textWrapper.appendChild(textCont);
                textCont.innerHTML = textEl.text;
    
                lessonCont.appendChild(textWrapper);
            });

            if (!self.selected.lessons.isStudying(lesson, 0)) {
                const studyButton = document.createElement('div');
                studyButton.classList.add('studyButton');
                studyButton.innerHTML = 'Изучать!';
    
                lessonCont.appendChild(studyButton);

                studyButton.addEventListener('click', function(){
					// debugger;
					const lessonObj = {
						info: {
							index: lessons.getLessonIndex(lesson, 0),
							repeatPhase: 0,
							nextRepeat: Date.now(),
							expiry: Date.now() + (6 * 60 * 60 * 1000),
							percentage: 0,
						},
						verses: {},
					};

					lesson.texts.forEach(function(textID) {
                        lessonObj.verses[`i_${textID}`] =
                            {
                                book: {
                                    done: false,
                                    score: 10,
                                },
                                chapter : {
                                    done: false,
                                    score: 10,
                                },
                                verse: {
                                    done: false,
                                    score: 10,
                                },
                                text: {
                                    done: false,
                                    score: 10,
                                },
                                expl: {
                                    done: false,
                                    score: 10,
                                },
                            };
                    });

                    self.selected.lessons.inProgress[0].push(lessonObj);
                    // let index = self.selected.lessons.inProgress[0].length - 1;
                    // self.selected.lessons.percentageStudied[0][index] = 0;

                    document.querySelector('.backCont').click();
                });
            }
    
            lessonCont.style.marginTop = `${selectedSectionTitle.offsetHeight + 15}px`;
            
            lessonCont.style.opacity = '1';
            selectedSectionTitle.style.opacity = '1';

            setTimeout(() => mainMenu.transition = false, 300);
        }, 300 + needToScroll * 300);
    },
};

const bookStudy = {
	active: function() {
		lessons.selected.item[0].forEach
	},

	// textsToRepeat: [],

    start: function() {
        this.renderBooks();
    },

    renderBooks: function() {
        mainMenu.user.currentView = 'books';
        if (!mainMenu.transition) {
            mainMenu.transition = true;
        }

        const overlappingCont = document.createElement('div');
        overlappingCont.classList.add('overlappingCont2');
        document.getElementById('main').appendChild(overlappingCont);

        setTimeout(function() {
            overlappingCont.style.opacity = '1';
            overlappingCont.style.width = '100vw';
            overlappingCont.style.height = '100vh';
            overlappingCont.style.borderRadius = '0px';
            overlappingCont.style.top = '-45px';
            overlappingCont.style.paddingTop = '45px';
            overlappingCont.style.paddingBottom = '45px';
            overlappingCont.style.right = '0px';
            overlappingCont.style.margin = '45px 0px';
			// overlappingCont.style.backgroundPosition = '50% 100%'
			// setTimeout(function() {
			// 	overlappingCont.style.backgroundImage = 'url(bg1.jpg)';
			// }, 300);
        }, 0);

        const self = this;

        mainMenu.showBackButton();

		// selected.item[0].forEach

        setTimeout(function() {
            mainMenu.transition = false;
			const curLesson = lessons.selected.lessons.inProgress[0].reduce((minObj, currentObj) => {
				return currentObj.expiry < minObj.expiry ? currentObj : minObj;
			});

			const verseIndexes = [];
			for (const key in curLesson.verses) {
				verseIndexes.push(+key.slice(2));
			}
			const verseIndexesMixed = shuffle(verseIndexes);

			const chapterIndex = lessons.lessonsSplit[0][curLesson.info.index].chapter;

			

        }, 300);
    },
};

window.onerror = function(msg, url, lineNo, columnNo, error) {
    alert(`${msg}, ${lineNo}`);
    return false;
}

// let resArr = [];

// booksArr.forEach(book  => {
//     let chap = book.querySelectorAll('div[c]');
//     let chapArr = [...chap];
//     let curBook = [];
//     chapArr.forEach(ch => {
//         let coll = ch.querySelectorAll('[v]');
//         curBook.push(coll[coll.length - 1].getAttribute('v'));
//     });
//     resArr.push(curBook);
// })